title: Enumerate Users Local Group Using Telegram
id: fcd74532-ae54-11eb-a5ab-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a Telegram process enumerating all network users in a local group. It leverages EventCode 4798, which is generated when a process enumerates a user's security-enabled
  local groups on a computer or device. This activity is significant as it may indicate an attempt to gather information on user accounts, a common precursor to further malicious actions. If confirmed malicious,
  this behavior could allow an attacker to map out user accounts, potentially leading to privilege escalation or lateral movement within the network.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4798
tags:
- attack.T1087
date: '2021-05-07'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4798
  selection_1:
    CallerProcessName|contains: '*\telegram.exe'
  condition: selection_0 and selection_1
