title: Kerberoasting spn request with RC4 encryption
id: 5cc67381-44fa-4111-8a37-7a230943f027
status: stable
level: medium
author: Jose Hernandez, Patrick Bareiss, Mauricio Velazco, Dean Luxton, Splunk
description: The following analytic detects potential Kerberoasting attacks by identifying Kerberos service ticket requests with RC4 encryption through Event ID 4769. It leverages specific Ticket_Options
  values commonly used by Kerberoasting tools. This activity is significant as Kerberoasting allows attackers to request service tickets for domain accounts, typically service accounts, and crack them offline
  to gain privileged access. If confirmed malicious, this could lead to unauthorized access, privilege escalation, and further compromise of the Active Directory environment.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/4e3e9c8096dde00639a6b98845ec349135554ed5/atomics/T1208/T1208.md
- https://www.hub.trimarcsecurity.com/post/trimarc-research-detecting-kerberoasting-activity
tags:
- attack.T1558_003
date: '2020-06-11'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4769
  selection_1:
    ServiceName!|contains: '*$'
  selection_2:
    TicketOptions: '0x40810000'
  selection_3:
    TicketOptions: '0x40800000'
  selection_4:
    TicketOptions: '0x40810010'
  selection_5:
    TicketEncryptionType: '0x17'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5
