title: Kerberos Service Ticket Request Using RC4 Encryption
id: 7d90f334-a482-11ec-908c-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: 'The following analytic detects Kerberos service ticket requests using RC4 encryption, leveraging Kerberos Event 4769. This method identifies potential Golden Ticket attacks, where adversaries
  forge Kerberos Granting Tickets (TGT) using the Krbtgt account NTLM password hash to gain unrestricted access to an Active Directory environment. Monitoring for RC4 encryption usage is significant as
  it is rare in modern networks, indicating possible malicious activity. If confirmed malicious, attackers could move laterally and execute code on remote systems, compromising the entire network. Note:
  This detection may be bypassed if attackers use the AES key instead of the NTLM hash.'
references:
- https://attack.mitre.org/techniques/T1558/001/
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4769
- https://adsecurity.org/?p=1515
- https://gist.github.com/TarlogicSecurity/2f221924fef8c14a1d8e29f3cb5c5c4a
- https://en.hackndo.com/kerberos-silver-golden-tickets/
tags:
- attack.T1558_001
date: '2022-03-15'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4769
  selection_1:
    ServiceName|contains: '*$'
  selection_2:
    TicketOptions: '0x40810000'
  selection_3:
    TicketOptions: '0x40800000'
  selection_4:
    TicketOptions: '0x40810010'
  selection_5:
    TicketEncryptionType: '0x17'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5
