title: Kerberos TGT Request Using RC4 Encryption
id: 18916468-9c04-11ec-bdc6-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects a Kerberos Ticket Granting Ticket (TGT) request using RC4-HMAC encryption (type 0x17) by leveraging Event 4768. This encryption type is outdated and its presence
  may indicate an OverPass The Hash attack. Monitoring this activity is crucial as it can signify credential theft, allowing adversaries to authenticate to the Kerberos Distribution Center (KDC) using a
  stolen NTLM hash. If confirmed malicious, this could enable unauthorized access to systems and resources, potentially leading to lateral movement and further compromise within the network.
references:
- https://stealthbits.com/blog/how-to-detect-overpass-the-hash-attacks/
- https://www.thehacker.recipes/ad/movement/kerberos/ptk
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4768
tags:
- attack.T1550
date: '2022-03-08'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4768
  selection_1:
    TicketEncryptionType: '0x17'
  selection_2:
    ServiceName!|contains: '*$'
  condition: selection_0 and selection_1 and selection_2
