title: Non Firefox Process Access Firefox Profile Dir
id: e6fc13b0-1609-11ec-b533-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects non-Firefox processes accessing the Firefox profile directory, which contains sensitive user data such as login credentials, browsing history, and cookies. It
  leverages Windows Security Event logs, specifically event code 4663, to monitor access attempts. This activity is significant because it may indicate attempts by malware, such as RATs or trojans, to harvest
  user information. If confirmed malicious, this behavior could lead to data exfiltration, unauthorized access to user accounts, and further compromise of the affected system.
tags:
- attack.t1555.003
date: '2021-09-15'
original_spl: '`wineventlog_security` EventCode=4663 NOT (ProcessName IN ("*\\firefox.exe", "*\\explorer.exe", "*sql*")) ObjectName="*\\AppData\\Roaming\\Mozilla\\Firefox\\Profiles*" | stats count min(_time)
  as firstTime max(_time) as lastTime by ObjectName ObjectType ProcessName AccessMask EventCode dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `non_firefox_process_access_firefox_profile_dir_filter`'
splunk_rule_id: e6fc13b0-1609-11ec-b533-acde48001122
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  filter_1:
    ProcessName:
    - '*\firefox.exe'
    - '*\explorer.exe'
    - '*sql*'
  selection_2:
    ObjectName|contains: \AppData\Roaming\Mozilla\Firefox\Profiles
  condition: (selection_0 and selection_2) and not (filter_1)
