title: Randomly Generated Scheduled Task Name
id: 9d22a780-5165-11ec-ad4f-3e22fbd008af
status: experimental
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the creation of a Scheduled Task with a high entropy, randomly generated name, leveraging Event ID 4698. It uses the `ut_shannon` function from the URL ToolBox
  Splunk application to measure the entropy of the Task Name. This activity is significant as adversaries often use randomly named Scheduled Tasks for lateral movement and remote code execution, employing
  tools like Impacket or CrackMapExec. If confirmed malicious, this could allow attackers to execute arbitrary code remotely, potentially leading to further compromise and persistence within the network.
references:
- https://attack.mitre.org/techniques/T1053/005/
- https://splunkbase.splunk.com/app/2734/
- https://en.wikipedia.org/wiki/Entropy_(information_theory)
tags:
- attack.T1053_005
date: '2021-11-30'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4698
  condition: selection_0
