title: Randomly Generated Scheduled Task Name
id: 9d22a780-5165-11ec-ad4f-3e22fbd008af
status: experimental
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the creation of a Scheduled Task with a high entropy, randomly generated name, leveraging Event ID 4698. It uses the `ut_shannon` function from the URL ToolBox
  Splunk application to measure the entropy of the Task Name. This activity is significant as adversaries often use randomly named Scheduled Tasks for lateral movement and remote code execution, employing
  tools like Impacket or CrackMapExec. If confirmed malicious, this could allow attackers to execute arbitrary code remotely, potentially leading to further compromise and persistence within the network.
references:
- https://attack.mitre.org/techniques/T1053/005/
- https://splunkbase.splunk.com/app/2734/
- https://en.wikipedia.org/wiki/Entropy_(information_theory)
tags:
- attack.t1053.005
date: '2021-11-30'
original_spl: |-
  `wineventlog_security` EventCode=4698
    | xmlkv Message
    | lookup ut_shannon_lookup word as Task_Name
    | where ut_shannon > 3
    | table  _time, dest, Task_Name, ut_shannon, Command, Author, Enabled, Hidden
    | `randomly_generated_scheduled_task_name_filter`
splunk_rule_id: 9d22a780-5165-11ec-ad4f-3e22fbd008af
splunk_rule_type: Hunting
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4698
  condition: selection_0
