title: Schedule Task with HTTP Command Arguments
id: 523c2684-a101-11eb-916b-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of scheduled tasks on Windows systems that include HTTP command arguments, using Windows Security EventCode 4698. It identifies tasks registered
  via schtasks.exe or TaskService with HTTP in their command arguments. This behavior is significant as it often indicates malware activity or the use of Living off the Land binaries (lolbins) to download
  additional payloads. If confirmed malicious, this activity could lead to data exfiltration, malware propagation, or unauthorized access to sensitive information, necessitating immediate investigation
  and mitigation.
references:
- https://app.any.run/tasks/92d7ef61-bfd7-4c92-bc15-322172b4ebec/
tags:
- attack.T1053
date: '2021-04-26'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4698
  condition: selection_0
