title: Suspicious Computer Account Name Change
id: 35a61ed8-61c4-11ec-bc1e-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects a suspicious computer account name change in Active Directory. It leverages Event ID 4781, which logs account name changes, to identify instances where a computer
  account name is changed to one that does not end with a `$`. This behavior is significant as it may indicate an attempt to exploit CVE-2021-42278 and CVE-2021-42287, which can lead to domain controller
  impersonation and privilege escalation. If confirmed malicious, this activity could allow an attacker to gain elevated privileges and potentially control the domain.
references:
- https://exploit.ph/cve-2021-42287-cve-2021-42278-weaponisation.html
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-42278
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-42287
tags:
- attack.T1078_002
date: '2021-12-20'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4781
  selection_1:
    OldTargetUserName|contains: '*$'
  selection_2:
    NewTargetUserName!|contains: '*$'
  condition: selection_0 and selection_1 and selection_2
