title: Suspicious Kerberos Service Ticket Request
id: 8b1297bc-6204-11ec-b7c4-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects suspicious Kerberos Service Ticket (TGS) requests where the requesting account name matches the service name, potentially indicating an exploitation attempt of
  CVE-2021-42278 and CVE-2021-42287. This detection leverages Event ID 4769 from Domain Controller and Kerberos events. Such activity is significant as it may represent an adversary attempting to escalate
  privileges by impersonating a domain controller. If confirmed malicious, this could allow an attacker to take control of the domain controller, leading to complete domain compromise and unauthorized access
  to sensitive information.
references:
- https://exploit.ph/cve-2021-42287-cve-2021-42278-weaponisation.html
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-42278
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-42287
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-sfu/02636893-7a1f-4357-af9a-b672e3e3de13
tags:
- attack.t1078.002
date: '2021-12-20'
original_spl: |-
  `wineventlog_security` EventCode=4769
    | eval isSuspicious = if(lower(ServiceName) = lower(mvindex(split(TargetUserName,"@"),0)),1,0)
    | where isSuspicious = 1
    | rename Computer as dest
    | rename TargetUserName as user
    | table _time, dest, src_ip, user, ServiceName, Error_Code, isSuspicious
    | `suspicious_kerberos_service_ticket_request_filter`
splunk_rule_id: 8b1297bc-6204-11ec-b7c4-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4769
  condition: selection_0
