title: Windows Credentials from Password Stores Chrome LocalState Access
id: 3b1d09a8-a26f-473e-a510-6c6613573657
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects non-Chrome processes accessing the Chrome "Local State" file, which contains critical settings and information. It leverages Windows Security Event logs, specifically event code 4663, to identify this behavior.
  This activity is significant because threat actors can exploit this file to extract the encrypted master key used for decrypting saved passwords in Chrome.
  If confirmed malicious, this could lead to unauthorized access to sensitive information, posing a severe security risk.
  Monitoring this anomaly helps identify potential threats and safeguard browser-stored data.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
tags:
- attack.T1012
date: '2023-05-02'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|contains: '*\AppData\Local\Google\Chrome\User Data\Local State'
  filter_2:
    Image:
    - '*:\Windows\explorer.exe'
    - '*\AppData\Local\Google\Chrome Beta\Application\chrome.exe'
    - '*\AppData\Local\Google\Chrome Dev\Application\chrome.exe'
    - '*\AppData\Local\Google\Chrome SxS\Application\chrome.exe'
    - '*\AppData\Local\Google\Chrome Unstable\Application\chrome.exe'
    - '*\AppData\Local\Google\Chrome\Application\chrome.exe'
    - '*\platform_experience_helper.exe*'
    - '*:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe*'
  condition: (selection_0 and selection_1) and not (filter_2)
