title: Windows Credentials from Password Stores Chrome Login Data Access
id: 0d32ba37-80fc-4429-809c-0ba15801aeaf
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic identifies non-Chrome processes accessing the Chrome user data file "login data."
  This file is an SQLite database containing sensitive information, including saved passwords.
  The detection leverages Windows Security Event logs, specifically event code 4663, to monitor access attempts.
  This activity is significant as it may indicate attempts by threat actors to extract and decrypt stored passwords, posing a risk to user credentials.
  If confirmed malicious, attackers could gain unauthorized access to sensitive accounts and escalate their privileges within the environment.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
tags:
- attack.T1012
date: '2023-05-02'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|contains: '*\AppData\Local\Google\Chrome\User Data\Default\Login Data'
  filter_2:
    Image:
    - '*:\Windows\explorer.exe'
    - '*:\Windows\System32\dllhost.exe'
    - '*\AppData\Local\Google\Chrome Beta\Application\\chrome.exe'
    - '*\AppData\Local\Google\Chrome Dev\Application\\chrome.exe'
    - '*\AppData\Local\Google\Chrome SxS\Application\\chrome.exe'
    - '*\AppData\Local\Google\Chrome Unstable\Application\\chrome.exe'
    - '*\AppData\Local\Google\Chrome\Application\\chrome.exe'
  condition: (selection_0 and selection_1) and not (filter_2)
