title: Windows Steal Authentication Certificates - ESC1 Authentication
id: f0306acf-a6ab-437a-bbc6-8628f8d5c97e
status: stable
level: medium
author: Steven Dick
description: The following analytic detects when a suspicious certificate with a Subject Alternative Name (SAN) is issued using Active Directory Certificate Services (AD CS) and then immediately used for
  authentication. This detection leverages Windows Security Event Logs, specifically EventCode 4887, to identify the issuance and subsequent use of the certificate. This activity is significant because
  improperly configured certificate templates can be exploited for privilege escalation and environment compromise. If confirmed malicious, an attacker could gain unauthorized access, escalate privileges,
  and potentially compromise the entire environment.
references:
- https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
- https://github.com/ly4k/Certipy#esc1
- https://pentestlaboratories.com/2021/11/08/threat-hunting-certificate-account-persistence/
tags:
- attack.T1649
- attack.T1550
date: '2023-07-28'
logsource:
  product: windows
  service: security
detection:
  selection_1:
    Attributes|contains: '*SAN:*upn*'
  selection_2:
    Attributes|contains: '*CertificateTemplate:*'
  condition: selection_1 and selection_2
