title: Windows Multiple Users Remotely Failed To Authenticate From Host
id: 80f9d53e-9ca1-11eb-b0d6-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies a source host failing to authenticate against a remote host with 30 unique users. It leverages Windows Event 4625 with Logon Type 3, indicating remote authentication
  attempts. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial access or elevate privileges in an Active Directory environment. If confirmed
  malicious, this activity could lead to unauthorized access, privilege escalation, and potential compromise of sensitive information. This detection is crucial for real-time security monitoring and threat
  hunting.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4625
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/basic-audit-logon-events
tags:
- attack.t1110.003
date: '2021-04-14'
original_spl: |-
  `wineventlog_security` EventCode=4625 Logon_Type=3 IpAddress!="-"
    | bucket span=5m _time
    | stats dc(TargetUserName) AS unique_accounts values(TargetUserName) as tried_accounts values(dest) as dest values(src) as src values(user) as user
      BY _time, IpAddress, Computer,
         action, app, authentication_method,
         signature, signature_id
    | rename Computer as dest
    | where unique_accounts > 30
    | `windows_multiple_users_remotely_failed_to_authenticate_from_host_filter`
splunk_rule_id: 80f9d53e-9ca1-11eb-b0d6-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4625
  selection_1:
    Logon_Type: 3
  selection_2:
    IpAddress: '-'
  condition: selection_0 and selection_1 and selection_2
