title: Windows DnsAdmins New Member Added
id: 27e600aa-77f8-4614-bc80-2662a67e2f48
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the addition of a new member to the DnsAdmins group in Active Directory by leveraging Event ID 4732. This detection uses security event logs to identify changes
  to this high-privilege group. Monitoring this activity is crucial because members of the DnsAdmins group can manage the DNS service, often running on Domain Controllers, and potentially execute malicious
  code with SYSTEM privileges. If confirmed malicious, this activity could allow an attacker to escalate privileges and gain control over critical domain services, posing a significant security risk.
references:
- https://attack.mitre.org/techniques/T1098/
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/from-dnsadmins-to-system-to-domain-compromise
- https://www.hackingarticles.in/windows-privilege-escalation-dnsadmins-to-domainadmin/
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4732
tags:
- attack.T1098
date: '2023-03-28'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4732
  selection_1:
    TargetUserName: DnsAdmins
  condition: selection_0 and selection_1
