title: Windows AD Privileged Account SID History Addition
id: 6b521149-b91c-43aa-ba97-c2cac59ec830
status: stable
level: medium
author: Dean Luxton
description: The following analytic identifies when the SID of a privileged user is added to the SID History attribute of another user. It leverages Windows Security Event Codes 4742 and 4738, combined
  with identity lookups, to detect this activity. This behavior is significant as it may indicate an attempt to abuse SID history for unauthorized access across multiple domains. If confirmed malicious,
  this activity could allow an attacker to escalate privileges or maintain persistent access within the environment, posing a significant security risk.
references:
- https://adsecurity.org/?p=1772
tags:
- attack.T1134_005
date: '2023-04-11'
logsource:
  product: windows
  service: security
detection:
  filter_1:
    SidHistory:
    - '%%1793'
    - '-'
  condition: filter_1
