title: Windows Unusual Intelliform Storage Registry Access
id: 99d69078-7dae-4ffe-9f3d-063242772f5a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies processes accessing Intelliform Storage Registry keys used by Internet Explorer. It leverages Windows Security Event logs, specifically monitoring EventCode
  4663, which tracks object access events. This activity is significant because it can indicate unauthorized access or manipulation of sensitive registry keys used for storing form data in Internet Explorer.
  If confirmed malicious, this could lead to data exfiltration, credential theft, or further compromise of the system.
references:
- https://stackoverflow.com/questions/1276700/where-does-internet-explorer-stores-its-form-data-history-that-is-uses-for-auto
tags:
- attack.t1552.001
date: '2025-07-16'
original_spl: '`wineventlog_security` EventCode=4663  NOT (ProcessName IN("C:\\Program Files\\Internet Explorer\\iexplore.exe", "C:\\Windows\\System32\\dllhost.exe", "C:\\Windows\\SysWow64\\dllhost.exe"))
  ObjectName IN ("*Software\\microsoft\\Internet Explorer\\Intelliforms\\storage2*") | stats count min(_time) as firstTime max(_time) as lastTime by  ObjectName ObjectType ProcessName AccessMask process_id
  EventCode Computer Caller_User_Name | rename Computer as dest Caller_User_Name as user ProcessName as process_name |  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_unusual_intelliform_storage_registry_access_filter`'
splunk_rule_id: 99d69078-7dae-4ffe-9f3d-063242772f5a
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  filter_1:
    ProcessName:
    - C:\Program Files\Internet Explorer\iexplore.exe
    - C:\Windows\System32\dllhost.exe
    - C:\Windows\SysWow64\dllhost.exe
  selection_2:
    ObjectName|contains: Software\microsoft\Internet Explorer\Intelliforms\storage2
  condition: (selection_0 and selection_2) and not (filter_1)
