title: Windows Non Discord App Access Discord LevelDB
id: 1166360c-d495-45ac-87a6-8948aac1fa07
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects non-Discord applications accessing the Discord LevelDB database. It leverages Windows Security Event logs, specifically event code 4663, to identify file access
  attempts to the LevelDB directory by processes other than Discord. This activity is significant as it may indicate attempts to steal Discord credentials or access sensitive user data. If confirmed malicious,
  this could lead to unauthorized access to user profiles, messages, and other critical information, potentially compromising the security and privacy of the affected users.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.404keylogger
tags:
- attack.T1012
date: '2024-02-22'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|contains: '*\discord\Local Storage\leveldb*'
  selection_2:
    Image|contains: '*\discord.exe'
  filter_3:
    Image:
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWow64\*'
    - '*:\Program Files*'
    - '*:\Windows\*'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
