title: Windows Scheduled Tasks for CompMgmtLauncher or Eventvwr
id: feb43b86-8c38-46cd-865e-20ce8a96c26c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation or modification of Windows Scheduled Tasks related to CompMgmtLauncher or Eventvwr. These legitimate system utilities, used for launching the Computer
  Management Console and Event Viewer, can be abused by attackers to execute malicious payloads under the guise of normal system processes. By leveraging these tasks, adversaries can establish persistence
  or elevate privileges without raising suspicion. This detection helps security analysts identify unusual or unauthorized scheduled tasks involving these executables, allowing for timely investigation
  and remediation of potential threats.
references:
- https://www.proofpoint.com/us/blog/threat-insight/chinese-malware-appears-earnest-across-cybercrime-threat-landscape
- https://www.fortinet.com/blog/threat-research/valleyrat-campaign-targeting-chinese-speakers
tags:
- attack.T1053
date: '2024-09-18'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4698
    TaskContent|contains: '*<Command>C:\Windows\System32\CompMgmtLauncher.exe</Command>*'
  selection_1:
    TaskContent|contains: '*<Command>C:\Windows\System32\zh-CN\eventvwr.msc</Command>*'
  selection_2:
    TaskContent|contains: '*<Command>C:\Windows\System32\eventvwr.msc</Command>*'
  condition: selection_0 and selection_1 and selection_2
