title: Windows Unsecured Outlook Credentials Access In Registry
id: 36334123-077d-47a2-b70c-6c7b3cc85049
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects unauthorized access to Outlook credentials stored in the Windows registry. It leverages Windows Security Event logs, specifically EventCode 4663, to identify
  access attempts to registry paths associated with Outlook profiles. This activity is significant as it may indicate attempts to steal sensitive email credentials, which could lead to unauthorized access
  to email accounts. If confirmed malicious, this could allow attackers to exfiltrate sensitive information, impersonate users, or execute further unauthorized actions within Outlook, posing a significant
  security risk.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/choice
- https://malpedia.caad.fkie.fraunhofer.de/details/win.404keylogger
tags:
- attack.T1552
date: '2024-02-22'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|contains:
    - '*\Profiles\Outlook\9375CFF0413111d3B88A00104B2A6676*'
    - '*\Windows Messaging Subsystem\Profiles\9375CFF0413111d3B88A00104B2A6676*'
  selection_2:
    Image|contains: '*\outlook.exe'
  condition: selection_0 and selection_1 and selection_2
