title: Windows AD GPO Disabled
id: 72793bc0-c0cd-400e-9e60-fdf36f278917
status: stable
level: medium
author: Dean Luxton
description: This detection identifies when an Active Directory Group Policy is disabled using the Group Policy Management Console.
references:
- https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
tags:
- attack.T1685
- attack.T1484_001
date: '2024-07-01'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  selection_1:
    AttributeLDAPDisplayName: flags
  selection_2:
    OperationType: '%%14674'
  selection_3:
    AttributeValue!: 0
  condition: selection_0 and selection_1 and selection_2 and selection_3
