title: Windows Domain Admin Impersonation Indicator
id: 10381f93-6d38-470a-9c30-d25478e3bd3f
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies potential Kerberos ticket forging attacks, specifically the Diamond Ticket attack. This is detected when a user logs into a host and the GroupMembership field
  in event 4627 indicates a privileged group (e.g., Domain Admins), but the user does not actually belong to that group in the directory service. The detection leverages Windows Security Event Log 4627,
  which logs account logon events. The analytic cross-references the GroupMembership field from the event against a pre-populated lookup of actual group memberships. Its crucial to note that the accuracy
  and effectiveness of this detection heavily rely on the users diligence in populating and regularly updating this lookup table. Any discrepancies between the events GroupMembership and the lookup indicate
  potential ticket forging. Kerberos ticket forging, especially the Diamond Ticket attack, allows attackers to impersonate any user and potentially gain unauthorized access to resources. By forging a ticket
  that indicates membership in a privileged group, an attacker can bypass security controls and gain elevated privileges. Detecting such discrepancies in group memberships during logon events can be a strong
  indicator of this attack in progress, making it crucial for security teams to monitor and investigate. If validated as a true positive, this indicates that an attacker has successfully forged a Kerberos
  ticket and may have gained unauthorized access to critical resources, potentially with elevated privileges.
references:
- https://trustedsec.com/blog/a-diamond-in-the-ruff
- https://unit42.paloaltonetworks.com/next-gen-kerberos-attacks
- https://github.com/GhostPack/Rubeus/pull/136
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4627
tags:
- attack.t1558
date: '2023-10-06'
original_spl: |-
  `wineventlog_security` EventCode=4627 LogonType=3 NOT TargetUserName IN ("*$", "SYSTEM", "DWM-*","LOCAL SERVICE","NETWORK SERVICE", "ANONYMOUS LOGON", "UMFD-*")
    | where match(GroupMembership, "Domain Admins")
    | stats count
      BY _time TargetUserName GroupMembership
         action app dest
         signature_id user vendor_product
    | lookup domain_admins username as TargetUserName OUTPUT username
    | fillnull value=NotDA username
    | search username = "NotDA"
    | `windows_domain_admin_impersonation_indicator_filter`
splunk_rule_id: 10381f93-6d38-470a-9c30-d25478e3bd3f
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4627
  selection_1:
    LogonType: 3
  filter_2:
    TargetUserName:
    - '*$'
    - SYSTEM
    - DWM-*
    - LOCAL SERVICE
    - NETWORK SERVICE
    - ANONYMOUS LOGON
    - UMFD-*
  condition: (selection_0 and selection_1) and not (filter_2)
