title: Windows Multiple Accounts Disabled
id: 5d93894e-befa-4429-abde-7fc541020b7b
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies instances where more than five unique Windows accounts are disabled within a 10-minute window, as indicated by Event Code 4725 in the Windows Security Event
  Log. It leverages the wineventlog_security dataset, grouping data into 10-minute segments and tracking the count and distinct count of TargetUserName. This behavior is significant as it may indicate internal
  policy breaches or an external attacker's attempt to disrupt operations. If confirmed malicious, this activity could lead to widespread account lockouts, hindering user access and potentially disrupting
  business operations.
references:
- https://attack.mitre.org/techniques/T1098/
tags:
- attack.t1098
- attack.t1078
date: '2024-03-06'
original_spl: |-
  `wineventlog_security` EventCode=4725 status=success
    | bucket span=10m _time
    | stats count dc(user) as unique_users values(user) as user values(dest) as dest
      BY EventCode signature _time
         src_user SubjectDomainName TargetDomainName
         Logon_ID
    | where unique_users > 5
    | `windows_multiple_accounts_disabled_filter`
splunk_rule_id: 5d93894e-befa-4429-abde-7fc541020b7b
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4725
  selection_1:
    status: success
  condition: selection_0 and selection_1
