title: Windows Computer Account With SPN
id: 9a3e57e7-33f4-470e-b25d-165baa6e8357
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the addition of Service Principal Names (SPNs) HOST and RestrictedKrbHost to a computer account, indicative of KrbRelayUp behavior. This detection leverages Windows
  Security Event Logs, specifically EventCode 4741, to identify changes in SPNs. This activity is significant as it is commonly associated with Kerberos-based attacks, which can be used to escalate privileges
  or perform lateral movement within a network. If confirmed malicious, this behavior could allow an attacker to impersonate services, potentially leading to unauthorized access to sensitive resources.
references:
- https://www.trustedsec.com/blog/an-attack-path-mapping-approach-to-cves-2021-42287-and-2021-42278
- https://github.com/Dec0ne/KrbRelayUp
tags:
- attack.t1558
date: '2022-04-28'
original_spl: |-
  `wineventlog_security` EventCode=4741 NewUacValue="0x80" ServicePrincipalNames IN ("*HOST/*","*RestrictedKrbHost/*")
    | stats count min(_time) as firstTime max(_time) as lastTime values(EventCode),values(TargetDomainName),values(PrimaryGroupId), values(OldUacValue), values(NewUacValue),values(SamAccountName),values(DnsHostName),values(ServicePrincipalNames)
      BY dest Logon_ID subject
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_computer_account_with_spn_filter`
splunk_rule_id: 9a3e57e7-33f4-470e-b25d-165baa6e8357
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4741
  selection_1:
    NewUacValue: '0x80'
  selection_2:
    ServicePrincipalNames|contains:
    - HOST/
    - RestrictedKrbHost/
  condition: selection_0 and selection_1 and selection_2
