title: Windows Non Discord App Access Discord LevelDB
id: 1166360c-d495-45ac-87a6-8948aac1fa07
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects non-Discord applications accessing the Discord LevelDB database. It leverages Windows Security Event logs, specifically event code 4663, to identify file access
  attempts to the LevelDB directory by processes other than Discord. This activity is significant as it may indicate attempts to steal Discord credentials or access sensitive user data. If confirmed malicious,
  this could lead to unauthorized access to user profiles, messages, and other critical information, potentially compromising the security and privacy of the affected users.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.404keylogger
tags:
- attack.t1012
date: '2024-02-22'
original_spl: '`wineventlog_security` EventCode=4663 object_file_path IN ("*\\discord\\Local Storage\\leveldb*") AND process_name != *\\discord.exe AND NOT (process_path IN ("*:\\Windows\\System32\\*",
  "*:\\Windows\\SysWow64\\*", "*:\\Program Files*", "*:\\Windows\\*")) | stats count min(_time) as firstTime max(_time) as lastTime by object_file_name object_file_path process_name process_path  process_id
  EventCode dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_non_discord_app_access_discord_leveldb_filter`'
splunk_rule_id: 1166360c-d495-45ac-87a6-8948aac1fa07
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|contains: \discord\Local Storage\leveldb
  selection_2:
    process_name|endswith: \discord.exe
  filter_3:
    process_path:
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWow64\*'
    - '*:\Program Files*'
    - '*:\Windows\*'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
