title: Windows Level RMM Watchdog Task Created
id: c4abe40f-91fb-42c0-bcc1-74ada766d0d8
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the watchdog task created when Level is installed.
  Level is a commercial remote management tool from Level.io.
  Remote management tools, when used for legitimate purposes, can help IT professionals and system administrators remotely access and manage computer systems.
  However, threat actors may exploit these tools for malicious purposes.
  It can be used to maintain persistence and execution on a host by a malicious actor.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-320a
tags:
- attack.T1053
- attack.T1219
date: '2026-05-05'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: '4698'
  selection_1:
    TaskName: \Level\Level Watchdog
  condition: selection_0 and selection_1
