title: Windows Multiple Account Passwords Changed
id: faefb681-14be-4f0d-9cac-0bc0160c7280
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects instances where more than five unique Windows account passwords are changed within a 10-minute interval. It leverages Event Code 4724 from the Windows Security
  Event Log, using the wineventlog_security dataset to monitor and count distinct TargetUserName values. This behavior is significant as rapid password changes across multiple accounts are unusual and may
  indicate unauthorized access or internal compromise. If confirmed malicious, this activity could lead to widespread account compromise, unauthorized access to sensitive information, and potential disruption
  of services.
references:
- https://attack.mitre.org/techniques/T1098/
tags:
- attack.t1098
- attack.t1078
date: '2024-03-06'
original_spl: |-
  `wineventlog_security` EventCode=4724 status=success
    | bucket span=10m _time
    | stats count dc(user) as unique_users values(user) as user values(dest) as dest
      BY EventCode signature _time
         src_user SubjectDomainName TargetDomainName
         Logon_ID
    | where unique_users > 5
    | `windows_multiple_account_passwords_changed_filter`
splunk_rule_id: faefb681-14be-4f0d-9cac-0bc0160c7280
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4724
  selection_1:
    status: success
  condition: selection_0 and selection_1
