title: Windows AD Short Lived Domain Controller SPN Attribute
id: 57e27f27-369c-4df8-af08-e8c7ee8373d4
status: stable
level: medium
author: Dean Luxton
description: The following analytic detects the temporary addition of a global catalog SPN or a DRS RPC SPN to an Active Directory computer object, indicative of a potential DCShadow attack. This detection
  leverages EventCode 5136 from the `wineventlog_security` data source, focusing on specific SPN attribute changes. This activity is significant as DCShadow attacks allow attackers with privileged access
  to register rogue Domain Controllers, enabling unauthorized changes to the AD infrastructure. If confirmed malicious, this could lead to unauthorized replication of changes, including credentials and
  keys, compromising the entire domain's security.
references:
- https://www.dcshadow.com/
- https://blog.netwrix.com/2022/09/28/dcshadow_attack/
- https://gist.github.com/gentilkiwi/dcc132457408cf11ad2061340dcb53c2
- https://attack.mitre.org/techniques/T1207/
- https://blog.alsid.eu/dcshadow-explained-4510f52fc19d
tags:
- attack.t1207
date: '2022-09-01'
original_spl: |-
  `wineventlog_security` EventCode=5136 AttributeLDAPDisplayName=servicePrincipalName (AttributeValue="GC/*" OR AttributeValue="E3514235-4B06-11D1-AB04-00C04FC2DCD2/*")
    | stats min(_time) as _time range(_time) as duration values(OperationType) as OperationType values(user) as user values(src_ip) as src_ip values(src_nt_domain) as src_nt_domain values(src_user) as src_user values(Computer) as dest, values(ObjectDN) as ObjectDN values(action) as action values(app) as app values(authentication_method) as authentication_method values(signature) as signature values(signature_id) as signature_id values(src) as src
      BY Logon_ID
    | eval short_lived=case((duration<30),"TRUE")
    | where short_lived="TRUE" AND mvcount(OperationType)>1
    | replace "%%14674" with "Value Added", "%%14675" with "Value Deleted" in OperationType
    | rename Logon_ID as TargetLogonId
    | appendpipe [
    | map search="search `wineventlog_security` EventCode=4624 TargetLogonId=$TargetLogonId$"]
    | `windows_ad_short_lived_domain_controller_spn_attribute_filter`
splunk_rule_id: 57e27f27-369c-4df8-af08-e8c7ee8373d4
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  selection_1:
    AttributeLDAPDisplayName: servicePrincipalName
  selection_2:
    AttributeValue|startswith: GC/
  selection_3:
    AttributeValue|startswith: E3514235-4B06-11D1-AB04-00C04FC2DCD2/
  condition: selection_0 and selection_1 and selection_2 and selection_3
