title: Windows AD ServicePrincipalName Added To Domain Account
id: 8a1259cb-0ea7-409c-8bfe-74bad89259f9
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the addition of a Service Principal Name (SPN) to a domain account. It leverages Windows Event Code 5136 and monitors changes to the servicePrincipalName attribute.
  This activity is significant because it may indicate an attempt to perform Kerberoasting, a technique where attackers extract and crack service account passwords offline. If confirmed malicious, this
  could allow an attacker to obtain cleartext passwords, leading to unauthorized access and potential lateral movement within the domain environment.
references:
- https://adsecurity.org/?p=3466
- https://www.thehacker.recipes/ad/movement/dacl/targeted-kerberoasting
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5136
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/t1208-kerberoasting
tags:
- attack.T1098
date: '2022-11-17'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  selection_1:
    AttributeLDAPDisplayName: servicePrincipalName
  selection_2:
    OperationType: '%%14674'
  selection_3:
    ObjectClass: user
  condition: selection_0 and selection_1 and selection_2 and selection_3
