title: Windows AD GPO Deleted
id: 0d41772b-35ab-4e1c-a2ba-d0b455481aee
status: stable
level: medium
author: Dean Luxton
description: This detection identifies when an Active Directory Group Policy is deleted using the Group Policy Management Console.
references:
- https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
tags:
- attack.T1685
- attack.T1484_001
date: '2024-07-01'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  selection_1:
    AttributeLDAPDisplayName: gpLink
  condition: selection_0 and selection_1
