title: Windows Rapid Authentication On Multiple Hosts
id: 62606c77-d53d-4182-9371-b02cdbbbcef7
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects a source computer authenticating to 30 or more remote endpoints within a 5-minute timespan using Event ID 4624. This behavior is identified by analyzing Windows
  Event Logs for LogonType 3 events and counting unique target computers. Such activity is significant as it may indicate lateral movement or network share enumeration by an adversary. If confirmed malicious,
  this could lead to unauthorized access to multiple systems, potentially compromising sensitive data and escalating privileges within the network.
references:
- https://attack.mitre.org/techniques/T1135/
- https://thedfirreport.com/2023/01/23/sharefinder-how-threat-actors-discover-file-shares/
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4624
tags:
- attack.T1003_002
date: '2023-03-23'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4624
  selection_1:
    LogonType: 3
  selection_2:
    TargetUserName!: ANONYMOUS LOGON
  selection_3:
    TargetUserName!|contains: '*$'
  condition: selection_0 and selection_1 and selection_2 and selection_3
