title: Windows Steal Authentication Certificates - ESC1 Abuse
id: cbe761fc-d945-4c8c-a71d-e26d12255d32
status: stable
level: medium
author: Steven Dick
description: The following analytic detects when a new certificate is requested or granted against Active Directory Certificate Services (AD CS) using a Subject Alternative Name (SAN). It leverages Windows
  Security Event Codes 4886 and 4887 to identify these actions. This activity is significant because improperly configured certificate templates can be exploited for privilege escalation and environment
  compromise. If confirmed malicious, an attacker could gain elevated privileges or persist within the environment, potentially leading to unauthorized access to sensitive information and further exploitation.
references:
- https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
- https://github.com/ly4k/Certipy#esc1
- https://pentestlaboratories.com/2021/11/08/threat-hunting-certificate-account-persistence/
tags:
- attack.t1649
date: '2023-07-28'
original_spl: '`wineventlog_security` EventCode IN (4886,4887) Attributes="*SAN:*upn*" Attributes="*CertificateTemplate:*" | stats count min(_time) as firstTime max(_time) as lastTime values(name) as name
  values(status) as status values(Subject) as ssl_subject values(SubjectKeyIdentifier) as ssl_hash by Computer, EventCode, Requester, Attributes, RequestId | `security_content_ctime(firstTime)`  | `security_content_ctime(lastTime)`|
  fillnull | rex field=Attributes "(?i)CertificateTemplate:(?<object>[^\r\n]+)" | rex field=Attributes "(?i)ccm:(?<req_src>[^\r\n]+)" | rex max_match=10 field=Attributes "(?i)(upn=(?<req_user_1>[^\r\n&]+))"
  | rex max_match=10 field=Attributes "(?i)(dns=(?<req_dest_1>[^\r\n&]+))" | rex field=Requester "(.+\\\\)?(?<src_user>[^\r\n]+)" | eval flavor_text = case(EventCode=="4886","A suspicious certificate was
  requested using request ID: ".''RequestId'',EventCode=="4887", "A suspicious certificate was issued using request ID: ".''RequestId''.". To revoke this certifacte use this request ID or the SSL fingerprint
  [".''ssl_hash''."]"), dest = upper(coalesce(req_dest_1,req_dest_2)), src = upper(coalesce(req_src,Computer)) | fields - req_* | rename Attributes as object_attrs, EventCode as signature_id, name as signature,
  RequestId as ssl_serial, Requester as ssl_subject_common_name| `windows_steal_authentication_certificates___esc1_abuse_filter`'
splunk_rule_id: cbe761fc-d945-4c8c-a71d-e26d12255d32
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID:
    - 4886
    - 4887
  selection_1:
    Attributes|contains: SAN:*upn
  selection_2:
    Attributes|contains: 'CertificateTemplate:'
  condition: selection_0 and selection_1 and selection_2
