title: Windows AD Suspicious Attribute Modification
id: 5682052e-ce55-4f9f-8d28-59191420b7e0
status: stable
level: medium
author: Dean Luxton
description: 'This detection monitors changes to the following Active Directory attributes: "msDS-AllowedToDelegateTo", "msDS-AllowedToActOnBehalfOfOtherIdentity", "msDS-KeyCredentialLink", "scriptPath",
  and "msTSInitialProgram".  Modifications to these attributes can indicate potential malicious activity or privilege escalation attempts. Immediate investigation is recommended upon alert.'
references:
- https://trustedsec.com/blog/a-hitchhackers-guide-to-dacl-based-detections-part-1-a
- https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
tags:
- attack.t1222.001
- attack.t1550
date: '2024-07-01'
original_spl: |-
  `wineventlog_security` EventCode=5136 AttributeLDAPDisplayName IN ("msDS-AllowedToDelegateTo","msDS-AllowedToActOnBehalfOfOtherIdentity","scriptPath","msTSInitialProgram") OperationType=%%14674  ```Changes to the attribute "msDS-KeyCredentialLink" are also worth moniroting, however tuning will need to be applied```
    | table _time ObjectClass ObjectDN OpCorrelationID src_user SubjectLogonId DSName AttributeValue AttributeLDAPDisplayName
    | rename SubjectLogonId as TargetLogonId, src_user as initiator, _time as eventTime
    | appendpipe [
    | map search="search `wineventlog_security` EventCode=4624 TargetLogonId=$TargetLogonId$"]
    | stats min(eventTime) as _time values(initiator) as src_user, values(DSName) as targetDomain, values(ObjectDN) as ObjectDN, values(ObjectClass) as ObjectClass, values(src_category) as src_category, values(src_ip) as src_ip values(LogonType) as LogonType values(AttributeValue) as AttributeValue values(AttributeLDAPDisplayName) as AttributeLDAPDisplayName
      BY TargetLogonId
    | rex field=ObjectDN "^CN=(?P<cn>.*?),[A-Z]{2}\="
    | eval dest=if(ObjectClass="computer",cn,null), user=if(ObjectClass="user",cn,null)
    | fields - cn
    | `windows_ad_suspicious_attribute_modification_filter`
splunk_rule_id: 5682052e-ce55-4f9f-8d28-59191420b7e0
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  selection_1:
    AttributeLDAPDisplayName:
    - msDS-AllowedToDelegateTo
    - msDS-AllowedToActOnBehalfOfOtherIdentity
    - scriptPath
    - msTSInitialProgram
  selection_2:
    OperationType: '%%14674'
  condition: selection_0 and selection_1 and selection_2
