title: Windows Kerberos Local Successful Logon
id: 8309c3a8-4d34-48ae-ad66-631658214653
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies a local successful authentication event on a Windows endpoint using the Kerberos package. It detects EventCode 4624 with LogonType 3 and source address 127.0.0.1,
  indicating a login to the built-in local Administrator account. This activity is significant as it may suggest a Kerberos relay attack, a method attackers use to escalate privileges. If confirmed malicious,
  this could allow an attacker to gain unauthorized access to sensitive systems, execute arbitrary code, or create new accounts in Active Directory, leading to potential system compromise.
references:
- https://github.com/Dec0ne/KrbRelayUp
tags:
- attack.t1558
date: '2022-04-28'
original_spl: |-
  `wineventlog_security`  EventCode=4624 LogonType=3 AuthenticationPackageName=Kerberos action=success src=127.0.0.1
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action app authentication_method
         dest dvc process
         process_id process_name process_path
         signature signature_id src
         src_port status subject
         user user_group vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_kerberos_local_successful_logon_filter`
splunk_rule_id: 8309c3a8-4d34-48ae-ad66-631658214653
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4624
  selection_1:
    LogonType: 3
  selection_2:
    AuthenticationPackageName: Kerberos
  selection_3:
    action: success
  selection_4:
    src: 127
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
