title: Windows Steal Authentication Certificates CS Backup
id: a2f4cc7f-6503-4078-b206-f83a29f408a7
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies the backup of the Active Directory Certificate Services (AD CS) store, detected via Event ID 4876. This event is logged when a backup is performed using the
  CertSrv.msc UI or the CertUtil.exe -BackupDB command. Monitoring this activity is crucial as unauthorized backups can indicate an attempt to steal authentication certificates, which are critical for secure
  communications. If confirmed malicious, this activity could allow an attacker to impersonate users, escalate privileges, or access sensitive information, severely compromising the security of the environment.
references:
- https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
tags:
- attack.t1649
date: '2023-02-06'
original_spl: |-
  `wineventlog_security` EventCode=4876
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest, name, action,
         Caller_Domain ,Caller_User_Name
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_steal_authentication_certificates_cs_backup_filter`
splunk_rule_id: a2f4cc7f-6503-4078-b206-f83a29f408a7
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4876
  condition: selection_0
