title: Windows Scheduled Task with Suspicious Name
id: 9e9ab4e3-c9d0-4967-a197-6d755e8a7e6e
status: stable
level: medium
author: Steven Dick
description: The following analytic detects the creation, modification, or enabling of scheduled tasks with known suspicious or malicious task names. It leverages Windows Security EventCode 4698, 4700,
  and 4702 to identify when such tasks are registered, modified, or enabled. This activity is significant as it may indicate an attempt to establish persistence or execute malicious commands on a system.
  If confirmed malicious, this could allow an attacker to maintain access, execute arbitrary code, or escalate privileges, posing a severe threat to the environment.
references:
- https://attack.mitre.org/techniques/T1053/005/
- https://www.ic3.gov/CSA/2023/231213.pdf
- https://news.sophos.com/en-us/2024/11/06/bengal-cat-lovers-in-australia-get-psspsspssd-in-google-driven-gootloader-campaign/
- https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_windows_tasks_list.csv
tags:
- attack.t1053.005
date: '2025-02-07'
original_spl: |-
  `wineventlog_security` EventCode IN (4698,4700,4702)
  | eval TaskContent = case(isnotnull(TaskContentNew),TaskContentNew,true(),TaskContent)
  | xmlkv TaskContent
  | stats count min(_time) as firstTime max(_time) as lastTime latest(Arguments) as Arguments latest(Author) as Author by Computer, TaskName, Command, Enabled, Hidden,Caller_User_Name, EventCode
  | lookup windows_suspicious_tasks task_name as TaskName
  | where isnotnull(tool_type)
  | eval command=TaskName, process=Command+if(isnotnull(Arguments)," ".Arguments,""), src_user=Author, user = Caller_User_Name, dest = Computer
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_scheduled_task_with_suspicious_name_filter`
splunk_rule_id: 9e9ab4e3-c9d0-4967-a197-6d755e8a7e6e
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID:
    - 4698
    - 4700
    - 4702
  condition: selection_0
