title: Windows Multiple Users Failed To Authenticate From Process
id: 9015385a-9c84-11eb-bef2-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects a source process failing to authenticate with 30 unique users, indicating a potential Password Spraying attack. It leverages Windows Event 4625 with Logon Type
  2, collected from domain controllers, member servers, and workstations. This activity is significant as it may represent an adversary attempting to gain initial access or elevate privileges within an
  Active Directory environment. If confirmed malicious, this could lead to unauthorized access, privilege escalation, or further compromise of the network, posing a severe security risk.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4625
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4625
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/basic-audit-logon-events
tags:
- attack.t1110.003
date: '2021-04-14'
original_spl: |-
  `wineventlog_security` EventCode=4625 Logon_Type=2 ProcessName!="-"
    | bucket span=5m _time
    | stats dc(TargetUserName) AS unique_accounts values(TargetUserName) as tried_accounts values(dest) as dest values(src) as src values(user) as user
      BY _time, ProcessName, SubjectUserName,
         Computer, action, app,
         authentication_method, signature, signature_id
    | rename Computer as dest
    | where unique_accounts > 30
    | `windows_multiple_users_failed_to_authenticate_from_process_filter`
splunk_rule_id: 9015385a-9c84-11eb-bef2-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4625
  selection_1:
    Logon_Type: 2
  selection_2:
    ProcessName: '-'
  condition: selection_0 and selection_1 and selection_2
