title: Windows AD Domain Controller Promotion
id: e633a0ef-2a6e-4ed7-b925-5ff999e5d1f0
status: stable
level: medium
author: Dean Luxton
description: The following analytic identifies a genuine Domain Controller (DC) promotion event by detecting when a computer assigns itself the necessary Service Principal Names (SPNs) to function as a
  domain controller. It leverages Windows Security Event Code 4742 to monitor existing domain controllers for these changes. This activity is significant as it can help identify rogue DCs added to the network,
  which could indicate a DCShadow attack. If confirmed malicious, this could allow an attacker to manipulate Active Directory, leading to potential privilege escalation and persistent access within the
  environment.
references:
- https://attack.mitre.org/techniques/T1207/
tags:
- attack.T1207
date: '2023-01-25'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4742
  selection_1:
    ServicePrincipalNames|contains:
    - '*E3514235-4B06-11D1-AB04-00C04FC2DCD2/*'
    - '*GC/*'
  condition: selection_0 and selection_1
