title: Windows Multiple Invalid Users Fail To Authenticate Using Kerberos
id: 001266a6-9d5b-11eb-829b-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies a source endpoint failing to authenticate with 30 unique invalid domain users using the Kerberos protocol. This detection leverages EventCode 4768, specifically
  looking for failure code 0x6, indicating the user is not found in the Kerberos database. This activity is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain
  initial access or elevate privileges. If confirmed malicious, this could lead to unauthorized access or privilege escalation within the Active Directory environment, posing a significant security risk.
references:
- https://attack.mitre.org/techniques/T1110/003/
tags:
- attack.T1110_003
date: '2021-04-14'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4768
  selection_1:
    TargetUserName!|contains: '*$'
  selection_2:
    Status: '0x6'
  condition: selection_0 and selection_1 and selection_2
