title: Windows AD Replication Request Initiated from Unsanctioned Location
id: 50998483-bb15-457b-a870-965080d9e3d3
status: stable
level: medium
author: Dean Luxton
description: The following analytic identifies unauthorized Active Directory replication requests initiated from non-domain controller locations. It leverages EventCode 4662 to detect when a computer account
  with replication permissions creates a handle to domainDNS, filtering out known domain controller IP addresses. This activity is significant as it may indicate a DCSync attack, where an attacker with
  privileged access can request password hashes for any or all users within the domain. If confirmed malicious, this could lead to unauthorized access to sensitive information and potential full domain
  compromise.
references:
- https://adsecurity.org/?p=1729
- https://www.linkedin.com/pulse/mimikatz-dcsync-event-log-detections-john-dwyer
- https://github.com/SigmaHQ/sigma/blob/0.22-699-g29a5c6278/rules/windows/builtin/security/win_security_dcsync.yml
tags:
- attack.T1003_006
date: '2022-11-16'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4662
  selection_1:
    ObjectType|contains:
    - '%{19195a5b-6da0-11d0-afd3-00c04fd930c9}'
    - domainDNS
  selection_2:
    Properties|contains:
    - '*Replicating Directory Changes All*'
    - '*Manage Replication Topology*'
    - '*Remove Replica In Domain*'
    - '*{1131f6ad-9c07-11d1-f79f-00c04fc2dcd2}*'
    - '*{9923a32a-3607-11d2-b9be-0000f87a36b2}*'
    - '*{1131f6ac-9c07-11d1-f79f-00c04fc2dcd2}*'
  selection_3:
    AccessMask: '0x100'
  condition: selection_0 and selection_1 and selection_2 and selection_3
