title: Windows Group Policy Object Created
id: 23add2a8-ea22-4fd4-8bc0-8c0b822373a1
status: stable
level: medium
author: Mauricio Velazco
description: The following analytic detects the creation of a new Group Policy Object (GPO) by leveraging Event IDs 5136 and 5137. This detection uses directory service change events to identify when a
  new GPO is created. Monitoring GPO creation is crucial as adversaries can exploit GPOs to escalate privileges or deploy malware across an Active Directory network. If confirmed malicious, this activity
  could allow attackers to control system configurations, deploy ransomware, or propagate malware, leading to widespread compromise and significant operational disruption.
references:
- https://attack.mitre.org/techniques/T1484/
- https://attack.mitre.org/techniques/T1484/001
- https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
- https://adsecurity.org/?p=2716
- https://www.bleepingcomputer.com/news/security/lockbit-ransomware-now-encrypts-windows-domains-using-group-policies/
- https://www.varonis.com/blog/group-policy-objects
tags:
- attack.t1078.002
- attack.t1484.001
date: '2023-03-28'
original_spl: |-
  `wineventlog_security` EventCode=5137 OR (EventCode=5136 AttributeValue!="New Group Policy Object" AND (AttributeLDAPDisplayName=displayName OR AttributeLDAPDisplayName=gPCFileSysPath) ) ObjectClass=groupPolicyContainer
    | stats values(AttributeValue) as details values(SubjectUserSid) as User values(ObjectDN) as ObjectDN
      BY ObjectGUID Computer dest
    | eval GPO_Name = mvindex(details, 0)
    | eval GPO_Path = mvindex(details, 1)
    | fields - details
    | `windows_group_policy_object_created_filter`
splunk_rule_id: 23add2a8-ea22-4fd4-8bc0-8c0b822373a1
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5137
  selection_1:
    EventID: 5136
    AttributeValue: New Group Policy Object
    ObjectClass: groupPolicyContainer
  condition: selection_0 and selection_1
