title: Windows Firewall Rule Added
id: efc25501-4e75-4075-8cc5-ac80f2847d80
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This detection identifies instances where a Windows Firewall rule is added by monitoring Event ID 4946 in the Windows Security Event Log. Firewall rule modifications can indicate legitimate
  administrative actions, but they may also signal unauthorized changes, misconfigurations, or malicious activity such as attackers allowing traffic for backdoors or persistence mechanisms. By analyzing
  fields like RuleName, RuleId, Computer, and ProfileChanged, security teams can determine whether the change aligns with expected behavior. Correlating with user activity and process execution can help
  distinguish false positives from real threats, ensuring better visibility into potential security risks.
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-4946
tags:
- attack.t1686
date: '2025-03-21'
original_spl: |-
  `wineventlog_security` EventCode=4946
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY RuleName signature subject
         status dest ProcessID
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_firewall_rule_added_filter`
splunk_rule_id: efc25501-4e75-4075-8cc5-ac80f2847d80
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4946
  condition: selection_0
