title: Windows Hosts File Access
id: b34bcf35-5380-4b00-b208-5531303fb751
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  This Analytic detects the execution of a process attempting to access the hosts file.
  The hosts file is a critical file for network configuration and DNS resolution.
  If an attacker gains access to it, they can redirect traffic to malicious websites, serve fake content or block legitimate security websites.
references:
- https://cert.gov.ua/article/6284730
tags:
- attack.T1012
date: '2026-03-16'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|contains: '*:\Windows\System32\drivers\etc\hosts'
  filter_2:
    Image:
    - '*:\Windows\explorer.exe'
    - '*:\Windows\System32\lsass.exe'
    - '*:\Windows\System32\SearchIndexer.exe'
    - '*:\Windows\System32\services.exe'
    - '*:\Windows\System32\svchost.exe'
    - '*:\Windows\SysWow64\SearchIndexer.exe'
    - '*:\Windows\SysWow64\svchost.exe'
  condition: (selection_0 and selection_1) and not (filter_2)
