title: Windows Suspicious Burst of Password Changes
id: 0dcfcab9-e936-43bc-8203-005e17dc0744
status: stable
level: low
author: Raven Tait, Splunk
description: |-
  A regular user account performed rapid, repeated password changes across multiple local accounts within a 2-second window.
  This pattern is consistent with automated credential manipulation tools that cycle account passwords to deny access to defenders or escalate privileges The speed and volume of changes indicates scripted or tooled activity rather than manual administration, as legitimate password resets do not occur at machine speed across multiple accounts simultaneously.
references:
- https://github.com/Nightmare-Eclipse/BlueHammer
tags:
- attack.t1068
date: '2026-04-29'
original_spl: |-
  `wineventlog_security`
  (
      EventCode=4723
      OR
      EventCode=4724
  )
  | eval log_time = strptime(SystemTime, "%Y-%m-%dT%H:%M:%S.%6NZ")
  | eval log_time = coalesce(log_time, _time)
  | eval time_bucket = floor(log_time / 2) * 2
  | eval SubjectRID = tonumber(replace(SubjectUserSid, ".*-(\d+)$", "\1"))
  | where SubjectRID >= 1000
  | stats count AS EventsForAccount
          min(log_time) AS firstTime
          max(log_time) AS lastTime
    by Computer TargetUserName SubjectUserName time_bucket

  | where EventsForAccount >= 4
  | eval DurationSecs = round(lastTime - firstTime, 3), DurationSecs = if(DurationSecs = 0, 0.001, DurationSecs), ChangeRatePerSec = round(EventsForAccount / DurationSecs, 2)
  | rename Computer as dest

  | stats dc(TargetUserName) AS AffectedAccounts
          values(TargetUserName) AS Accounts
          values(SubjectUserName) AS InitiatingAccounts
          sum(EventsForAccount) AS TotalEvents
          max(ChangeRatePerSec) AS PeakChangeRatePerSec
          min(DurationSecs) AS FastestBurstSecs
          min(firstTime) AS firstTime
          max(lastTime) AS lastTime
    by dest time_bucket

  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_suspicious_burst_of_password_changes_filter`
splunk_rule_id: 0dcfcab9-e936-43bc-8203-005e17dc0744
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4723
  selection_1:
    EventID: 4724
  condition: selection_0 and selection_1
