title: Windows AD Domain Replication ACL Addition
id: 8c372853-f459-4995-afdc-280c114d33ab
status: stable
level: medium
author: Dean Luxton
description: The following analytic detects the addition of permissions required for a DCSync attack, specifically DS-Replication-Get-Changes, DS-Replication-Get-Changes-All, and DS-Replication-Get-Changes-In-Filtered-Set.
  It leverages EventCode 5136 from the Windows Security Event Log to identify when these permissions are granted. This activity is significant because it indicates potential preparation for a DCSync attack,
  which can be used to replicate AD objects and exfiltrate sensitive data. If confirmed malicious, an attacker could gain extensive access to Active Directory, leading to severe data breaches and privilege
  escalation.
references:
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/1522b774-6464-41a3-87a5-1e5633c3fbbb
- https://github.com/SigmaHQ/sigma/blob/29a5c62784faf986dc03952ae3e90e3df3294284/rules/windows/builtin/security/win_security_account_backdoor_dcsync_rights.yml
- https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
tags:
- attack.t1484
date: '2022-11-17'
original_spl: |-
  `wineventlog_security` EventCode=5136 ObjectClass=domainDNS
    | stats min(_time) as _time values(eval(if(OperationType=="%%14675",AttributeValue,null))) as old_value values(eval(if(OperationType=="%%14674",AttributeValue,null))) as new_value values(OperationType) as OperationType
        BY ObjectClass ObjectDN OpCorrelationID
        src_user SubjectLogonId dest
    | rex field=old_value max_match=10000 "\((?P<old_values>.*?)\)"
    | rex field=new_value max_match=10000 "\((?P<new_ace>.*?)\)"
    | mvexpand new_ace
    | where NOT new_ace IN (old_values)
    | rex field=new_ace "(?P<aceType>.*?);(?P<aceFlags>.*?);(?P<aceAccessRights>.*?);(?P<aceObjectGuid>.*?);;(?P<aceSid>.*?)$"
    | search aceObjectGuid IN ("1131f6aa-9c07-11d1-f79f-00c04fc2dcd2","1131f6ad-9c07-11d1-f79f-00c04fc2dcd2","89e95b76-444d-4c62-991a-0facbeda640c")
    | rex max_match=100 field=aceAccessRights "(?P<AccessRights>[A-Z]{2})"
    | rex max_match=100 field=aceFlags "(?P<aceFlags>[A-Z]{2})"
    | lookup msad_guid_lookup guid as aceObjectGuid OUTPUT displayName as ControlAccessRights
    | lookup ace_access_rights_lookup access_rights_string as AccessRights OUTPUT access_rights_value
    | lookup ace_type_lookup ace_type_string as aceType OUTPUT ace_type_value
    | lookup ace_flag_lookup flag_string as aceFlags OUTPUT flag_value as ace_flag_value
    | lookup builtin_groups_lookup builtin_group_string as aceSid OUTPUT builtin_group_name as builtin_group
    | eval aceType=coalesce(ace_type_value,aceType), aceFlags=coalesce(ace_flag_value,"This object only"), aceAccessRights=if(aceAccessRights="CCDCLCSWRPWPDTLOCRSDRCWDWO","Full control",coalesce(access_rights_value,AccessRights)), aceControlAccessRights=coalesce(ControlAccessRights,aceObjectGuid), user=coalesce(user, group, builtin_group, aceSid)
    | stats min(_time) as _time values(aceType) as aceType values(aceFlags) as aceFlags(inheritance) values(aceControlAccessRights) as aceControlAccessRights values(aceAccessRights) as aceAccessRights values(new_ace) as new_ace values(SubjectLogonId) as SubjectLogonId
        BY ObjectClass ObjectDN src_user dest user
    | search (aceControlAccessRights="Replicating Directory Changes" AND aceControlAccessRights="Replicating Directory Changes All") OR (aceControlAccessRights="1131f6aa-9c07-11d1-f79f-00c04fc2dcd2" AND aceControlAccessRights="1131f6ad-9c07-11d1-f79f-00c04fc2dcd2")
    | `windows_ad_domain_replication_acl_addition_filter`
splunk_rule_id: 8c372853-f459-4995-afdc-280c114d33ab
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  selection_1:
    ObjectClass: domainDNS
  condition: selection_0 and selection_1
