title: Windows AD add Self to Group
id: 065f2701-b7ea-42f5-9ec4-fbc2261165f9
status: stable
level: medium
author: Dean Luxton
description: This analytic detects instances where a user adds themselves to an Active Directory (AD) group. This activity is a common indicator of privilege escalation, where a user attempts to gain unauthorized
  access to higher privileges or sensitive resources. By monitoring AD logs, this detection identifies such suspicious behavior, which could be part of a larger attack strategy aimed at compromising critical
  systems and data.
tags:
- attack.t1098
date: '2024-07-01'
original_spl: |-
  `wineventlog_security` EventCode IN (4728)
    | where lower(user)=lower(src_user)
    | stats min(_time) as _time dc(user) as usercount, values(user) as user values(user_category) as user_category values(src_user_category) as src_user_category values(dvc) as dvc
      BY signature, Group_Name, src_user,
         dest
    | `windows_ad_add_self_to_group_filter`
splunk_rule_id: 065f2701-b7ea-42f5-9ec4-fbc2261165f9
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4728
  condition: selection_0
