title: Windows Hosts File Access
id: b34bcf35-5380-4b00-b208-5531303fb751
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  This Analytic detects the execution of a process attempting to access the hosts file.
  The hosts file is a critical file for network configuration and DNS resolution.
  If an attacker gains access to it, they can redirect traffic to malicious websites, serve fake content or block legitimate security websites.
references:
- https://cert.gov.ua/article/6284730
tags:
- attack.t1012
date: '2026-03-16'
original_spl: |-
  `wineventlog_security`
  EventCode=4663
  object_file_path="*:\\Windows\\System32\\drivers\\etc\\hosts"
  NOT process_path IN (
      "*:\\Windows\\explorer.exe",
      "*:\\Windows\\System32\\lsass.exe",
      "*:\\Windows\\System32\\SearchIndexer.exe",
      "*:\\Windows\\System32\\services.exe",
      "*:\\Windows\\System32\\svchost.exe",
      "*:\\Windows\\SysWow64\\SearchIndexer.exe",
      "*:\\Windows\\SysWow64\\svchost.exe"
  )
  | stats count
      by _time object_file_path object_file_name dest process_name
         process_path process_id EventCode
  | eval process_path = lower(process_path)
  | lookup browser_process_and_path browser_process_path as process_path OUTPUT is_valid_browser_path
  | eval is_valid_browser_path=coalesce(is_valid_browser_path,"false")
  | where is_valid_browser_path = "false"
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_hosts_file_access_filter`
splunk_rule_id: b34bcf35-5380-4b00-b208-5531303fb751
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|endswith: :\Windows\System32\drivers\etc\hosts
  filter_2:
    process_path:
    - '*:\Windows\explorer.exe'
    - '*:\Windows\System32\lsass.exe'
    - '*:\Windows\System32\SearchIndexer.exe'
    - '*:\Windows\System32\services.exe'
    - '*:\Windows\System32\svchost.exe'
    - '*:\Windows\SysWow64\SearchIndexer.exe'
    - '*:\Windows\SysWow64\svchost.exe'
  condition: (selection_0 and selection_1) and not (filter_2)
