title: Windows AD Object Owner Updated
id: 4af01f6b-d8d4-4f96-8635-758a01557130
status: stable
level: medium
author: Dean Luxton
description: AD Object Owner Updated. The owner provides Full control level privileges over the target AD Object. This event has significant impact alone and is also a precursor activity for hiding an AD
  object.
references:
- https://learn.microsoft.com/en-us/windows/win32/secauthz/ace-strings
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-adts/1522b774-6464-41a3-87a5-1e5633c3fbbb
- https://trustedsec.com/blog/a-hitchhackers-guide-to-dacl-based-detections-part-1-a
- https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
tags:
- attack.t1222.001
- attack.t1484
date: '2024-07-01'
original_spl: |-
  `wineventlog_security` EventCode=5136
    | stats min(_time) as _time values(eval(if(OperationType=="%%14675",AttributeValue,null))) as old_value values(eval(if(OperationType=="%%14674",AttributeValue,null))) as new_value values(OperationType) as OperationType values(dest) as dest
      BY ObjectClass ObjectDN OpCorrelationID
         src_user SubjectLogonId DSName
    | rex field=old_value "O:(?P<old_owner>.*?)G:"
    | rex field=new_value "O:(?P<new_owner>.*?)G:"
    | where old_owner!=new_owner ``` optional SID resolution lookups
    | lookup identity_lookup_expanded objectSid as new_owner OUTPUT downLevelDomainName as new_owner_user
    | lookup admon_groups_def objectSid as new_owner OUTPUT cn as new_owner_group
    | lookup identity_lookup_expanded objectSid as old_owner OUTPUT downLevelDomainName as old_owner_user
    | lookup admon_groups_def objectSid as old_owner OUTPUT cn as old_owner_group ```
    | lookup builtin_groups_lookup builtin_group_string  as new_owner_group OUTPUT builtin_group_name as new_owner_group_builtin_group
    | lookup builtin_groups_lookup builtin_group_string  as old_owner OUTPUT builtin_group_name as old_owner_group_builtin_group
    | eval user=coalesce(new_owner_user, new_owner_group, new_owner_group_builtin_group, new_owner), previousOwner=coalesce(old_owner_user, old_owner_group, old_owner_group_builtin_group, old_owner)
    | stats values(previousOwner) as previousOwner values(user) as user values(SubjectLogonId) as SubjectLogonId
      BY _time ObjectClass ObjectDN
         src_user OpCorrelationID DSName
    | `windows_ad_object_owner_updated_filter`
splunk_rule_id: 4af01f6b-d8d4-4f96-8635-758a01557130
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  condition: selection_0
