title: Windows Kerberos Coercion via DNS
id: 9029b575-6f6b-4ab1-b660-67b24b7e9c3d
status: stable
level: medium
author: Raven Tait, Splunk
description: Detects DNS-based Kerberos coercion attacks where adversaries inject marshaled credential structures into DNS records to spoof SPNs and redirect authentication such as in CVE-2025-33073. This
  detection leverages Windows Security Event Codes 5136, 5137, 4662, looking for DNS events with specific CREDENTIAL_TARGET_INFORMATION entries.
references:
- https://web.archive.org/web/20250617122747/https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx
- https://www.guidepointsecurity.com/blog/the-birth-and-death-of-loopyticket/
tags:
- attack.t1071.004
- attack.t1557.001
- attack.t1187
date: '2025-11-18'
original_spl: |-
  `wineventlog_security`  (((EventCode="5136" OR EventCode="5137") ObjectClass="dnsNode" ObjectDN="*1UWhRCA*" ObjectDN="*AAAAA*" ObjectDN="*YBAAAA*") OR (EventCode="4662" AdditionalInfo="*1UWhRCA*" AdditionalInfo="*AAAAA*" AdditionalInfo="*YBAAAA*"))
    | eval Object=coalesce(lower(ObjectGUID), trim(AdditionalInfo2, "%{}"))
    | eval user=coalesce(SubjectUserName, Caller_User_Name)
    | stats min(_time) as firstTime, max(_time) as lastTime values(EventCode) as event_codes values(ObjectDN) as dns_record values(user) as user values(Computer) as dest
      BY Object
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_kerberos_coercion_via_dns_filter`
splunk_rule_id: 9029b575-6f6b-4ab1-b660-67b24b7e9c3d
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    ObjectClass: dnsNode
    ObjectDN|contains: '*1UWhRCA*'
  selection_1:
    EventID: '4662'
    AdditionalInfo|contains: '*1UWhRCA*'
  condition: selection_0 and selection_1
