title: Windows Multiple Accounts Deleted
id: 49c0d4d6-c55d-4d3a-b3d5-7709fafed70d
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the deletion of more than five unique Windows accounts within a 10-minute period, using Event Code 4726 from the Windows Security Event Log. It leverages the
  `wineventlog_security` dataset, segmenting data into 10-minute intervals to identify suspicious account deletions. This activity is significant as it may indicate an attacker attempting to erase traces
  of their actions. If confirmed malicious, this could lead to unauthorized access removal, hindering incident response and forensic investigations.
references:
- https://attack.mitre.org/techniques/T1098/
tags:
- attack.T1098
- attack.T1078
date: '2024-03-06'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4726
  selection_1:
    sc-status: success
  condition: selection_0 and selection_1
