title: Windows AD Self DACL Assignment
id: 16132445-da9f-4d03-ad44-56d717dcd67d
status: stable
level: medium
author: Dean Luxton
description: Detect when a user creates a new DACL in AD for their own AD object.
references:
- https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
tags:
- attack.T1484
- attack.T1098
date: '2024-07-01'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  condition: selection_0
