title: Windows Unusual FileZilla XML Config Access
id: 47dc0426-cbe4-4253-8b86-1a983c3f9951
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies processes accessing FileZilla XML config files such as recentservers.xml and sitemanager.xml. It leverages Windows Security Event logs, specifically monitoring
  EventCode 4663, which tracks object access events. This activity is significant because it can indicate unauthorized access or manipulation of sensitive configuration files used by FileZilla, a popular
  FTP client. If confirmed malicious, this could lead to data exfiltration, credential theft, or further compromise of the system.
references:
- https://www.trendmicro.com/en_us/research/18/k/trickbot-shows-off-new-trick-password-grabber-module.html
tags:
- attack.t1552.001
date: '2025-07-16'
original_spl: '`wineventlog_security` EventCode=4663  NOT (ProcessName IN("C:\\Program Files\\FileZilla FTP Client\\filezilla.exe", "C:\Program Files (x86)\\FileZilla FTP Client\\filezilla.exe", "C:\\Program
  Files\\Microsoft OneDrive\\OneDrive.exe", "C:\\Program Files (x86)\\Microsoft OneDrive\\OneDrive.exe")) file_path IN ("*FileZilla\\recentservers.xml*", "*FileZilla\\sitemanager.xml*") | stats count min(_time)
  as firstTime max(_time) as lastTime by  ObjectName ObjectType ProcessName AccessMask process_id EventCode Computer Caller_User_Name | rename Computer as dest Caller_User_Name as user ProcessName as process_name
  |  `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_unusual_filezilla_xml_config_access_filter`'
splunk_rule_id: 47dc0426-cbe4-4253-8b86-1a983c3f9951
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  filter_1:
    ProcessName:
    - C:\Program Files\FileZilla FTP Client\filezilla.exe
    - C:\Program Files (x86)\FileZilla FTP Client\filezilla.exe
    - C:\Program Files\Microsoft OneDrive\OneDrive.exe
    - C:\Program Files (x86)\Microsoft OneDrive\OneDrive.exe
  selection_2:
    file_path|contains:
    - FileZilla\recentservers.xml
    - FileZilla\sitemanager.xml
  condition: (selection_0 and selection_2) and not (filter_1)
