title: Windows Privileged Group Modification
id: b8cbef2c-2cc3-4550-b0fc-9715b7852df9
status: stable
level: medium
author: Brandon Sternfield, Optiv + ClearShark
description: |
  This analytic detects modifications to privileged groups in Active Directory, including addition, creation, deletion, and changes to various types of groups such as local, global, universal, and LDAP query groups.
  It specifically monitors for changes to high-privilege groups like "Administrators", "Domain Admins", "Enterprise Admins", and "ESX Admins", among others.
  This detection is particularly relevant in the context of potential exploitation of vulnerabilities like the VMware ESXi Active Directory Integration Authentication Bypass (CVE-2024-37085), where attackers may attempt to manipulate privileged groups to gain unauthorized access to systems.
references:
- https://nvd.nist.gov/vuln/detail/CVE-2024-37085
- https://www.rapid7.com/blog/post/2024/07/30/vmware-esxi-cve-2024-37085-targeted-in-ransomware-campaigns/%5C
- https://x.com/mthcht/status/1818196168515461431?s=12&t=kwffmj0KM1sZtg3MrqC0QQ
tags:
- attack.t1136.001
- attack.t1136.002
date: '2024-07-30'
original_spl: |-
  `wineventlog_security`
  EventCode IN (
          4727,
          4731,
          4744,
          4749,
          4754,
          4756,
          4759,
          4783,
          4790
      )
  TargetUserName IN (
          "Account Operators",
          "Administrators",
          "Admins DNS",
          "Backup Operators",
          "DnsAdmins",
          "Domain Admins",
          "Enterprise Admins",
          "Enterprise Key Admins",
          "ESX Admins",
          "ESXi Admins",
          "Group Policy Creator Owners",
          "Hyper-V Administrators",
          "Key Admins",
          "Print Operators",
          "Remote Desktop Users",
          "Remote Management Users",
          "Replicators",
          "Schema Admins",
          "Server Operators"
      )
  | eval object_category=case(
          EventCode="4727", "Global Group (Security)",
          EventCode="4731", "Local Group (Security)",
          EventCode="4744", "Local Group (Distribution)",
          EventCode="4749", "Global Group (Distribution)",
          EventCode="4754", "Universal Group (Security)",
          EventCode="4756", "Universal Group (Security)",
          EventCode="4759", "Universal Group (Distribution)",
          EventCode="4783", "Basic Application Group",
          EventCode="4790", "LDAP Query Group"
      )

  | rename Computer as dest
           result as change_type
           TargetUserName as object
           TargetSid as object_path

  | stats count min(_time) as firstTime
                max(_time) as lastTime
      BY EventCode src_user object_category
         object object_path dest
         change_type status
  | `windows_privileged_group_modification_filter`
splunk_rule_id: b8cbef2c-2cc3-4550-b0fc-9715b7852df9
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID:
    - 4727
    - 4731
    - 4744
    - 4749
    - 4754
    - 4756
    - 4759
    - 4783
    - 4790
  selection_1:
    TargetUserName:
    - Account Operators
    - Administrators
    - Admins DNS
    - Backup Operators
    - DnsAdmins
    - Domain Admins
    - Enterprise Admins
    - Enterprise Key Admins
    - ESX Admins
    - ESXi Admins
    - Group Policy Creator Owners
    - Hyper-V Administrators
    - Key Admins
    - Print Operators
    - Remote Desktop Users
    - Remote Management Users
    - Replicators
    - Schema Admins
    - Server Operators
  condition: selection_0 and selection_1
