title: Windows AD Replication Request Initiated by User Account
id: 51307514-1236-49f6-8686-d46d93cc2821
status: stable
level: medium
author: Dean Luxton
description: The following analytic detects a user account initiating an Active Directory replication request, indicative of a DCSync attack. It leverages EventCode 4662 from the Windows Security Event
  Log, focusing on specific object types and replication permissions. This activity is significant because it can allow an attacker with sufficient privileges to request password hashes for any or all users
  within the domain. If confirmed malicious, this could lead to unauthorized access, privilege escalation, and potential compromise of the entire domain.
references:
- https://adsecurity.org/?p=1729
- https://www.linkedin.com/pulse/mimikatz-dcsync-event-log-detections-john-dwyer
- https://github.com/SigmaHQ/sigma/blob/0.22-699-g29a5c6278/rules/windows/builtin/security/win_security_dcsync.yml
tags:
- attack.t1003.006
date: '2022-11-16'
original_spl: |-
  `wineventlog_security` EventCode=4662 ObjectType IN ("%{19195a5b-6da0-11d0-afd3-00c04fd930c9}","domainDNS")
    AND Properties IN ("*Replicating Directory Changes All*","*Manage Replication Topology*","*Remove Replica In Domain*","*{1131f6ad-9c07-11d1-f79f-00c04fc2dcd2}*","*{9923a32a-3607-11d2-b9be-0000f87a36b2}*","*{1131f6ac-9c07-11d1-f79f-00c04fc2dcd2}*")
    AND AccessMask="0x100" AND NOT (SubjectUserSid="NT AUT*" OR SubjectUserSid="S-1-5-18" OR SubjectDomainName="Window Manager" OR SubjectUserName="*$")
  | stats min(_time) as _time, count by SubjectDomainName, SubjectUserName, Computer, Logon_ID, ObjectName, ObjectServer, ObjectType, OperationType, status dest
  | rename SubjectDomainName as Target_Domain, SubjectUserName as user, Logon_ID as TargetLogonId, _time as attack_time
  | appendpipe
      [| map search="search `wineventlog_security` EventCode=4624 TargetLogonId=$TargetLogonId$"
      | fields - status]
  | stats min(attack_time) as _time values(TargetUserSid) as TargetUserSid, values(Target_Domain) as Target_Domain, values(user) as user, values(Computer) as Computer, values(status) as status, values(src_category) as
      src_category, values(src_ip) as src_ip values(action) as action values(authentication_method) as authentication_method values(dest) as dest values(signature) as signature values(signature_id) as signature_id by TargetLogonId
  | `windows_ad_replication_request_initiated_by_user_account_filter`
splunk_rule_id: 51307514-1236-49f6-8686-d46d93cc2821
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4662
  selection_1:
    ObjectType:
    - '%{19195a5b-6da0-11d0-afd3-00c04fd930c9}'
    - domainDNS
  selection_2:
    Properties|contains:
    - Replicating Directory Changes All
    - Manage Replication Topology
    - Remove Replica In Domain
    - '{1131f6ad-9c07-11d1-f79f-00c04fc2dcd2}'
    - '{9923a32a-3607-11d2-b9be-0000f87a36b2}'
    - '{1131f6ac-9c07-11d1-f79f-00c04fc2dcd2}'
  selection_3:
    AccessMask: '0x100'
  condition: selection_0 and selection_1 and selection_2 and selection_3
