title: Windows Group Policy Object Created
id: 23add2a8-ea22-4fd4-8bc0-8c0b822373a1
status: stable
level: medium
author: Mauricio Velazco
description: The following analytic detects the creation of a new Group Policy Object (GPO) by leveraging Event IDs 5136 and 5137. This detection uses directory service change events to identify when a
  new GPO is created. Monitoring GPO creation is crucial as adversaries can exploit GPOs to escalate privileges or deploy malware across an Active Directory network. If confirmed malicious, this activity
  could allow attackers to control system configurations, deploy ransomware, or propagate malware, leading to widespread compromise and significant operational disruption.
references:
- https://attack.mitre.org/techniques/T1484/
- https://attack.mitre.org/techniques/T1484/001
- https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
- https://adsecurity.org/?p=2716
- https://www.bleepingcomputer.com/news/security/lockbit-ransomware-now-encrypts-windows-domains-using-group-policies/
- https://www.varonis.com/blog/group-policy-objects
tags:
- attack.T1078_002
- attack.T1484_001
date: '2023-03-28'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5137
  selection_1:
    EventID: 5136
    AttributeValue!: New Group Policy Object
    ObjectClass: groupPolicyContainer
  condition: selection_0 and selection_1
