title: Windows Short Lived DNS Record
id: d585e253-1859-4170-977d-09376c731f74
status: stable
level: medium
author: Raven Tait, Splunk
description: The following analytic identifies the creation and quick deletion of a DNS object within 300 seconds in an Active Directory environment, indicative of a potential attack abusing DNS. This detection
  leverages Windows Security Event Codes 5136 and 5137, analyzing the duration between these events. This activity is significant as temporary DNS entries allows attackers to cause unexpecting network trafficking,
  leading to potential compromise.
references:
- https://web.archive.org/web/20250617122747/https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx
- https://www.guidepointsecurity.com/blog/the-birth-and-death-of-loopyticket/
tags:
- attack.t1071.004
- attack.t1557.001
- attack.t1187
date: '2025-11-18'
original_spl: |-
  `wineventlog_security` ((EventCode=5137  ObjectClass="dnsNode") OR (EventCode=5136 ObjectClass="dnsNode" AttributeLDAPDisplayName="dNSTombstoned" AttributeValue="TRUE"))
    | stats min(_time) as firstTime max(_time) as lastTime values(EventCode) as event_codes values(ObjectDN) as dns_record values(SubjectUserName) as user values(Computer) as dest
      BY ObjectGUID
    | where mvcount(event_codes)=2
    | eval time_diff=lastTime - firstTime
    | where time_diff <= 300
    | table firstTime, lastTime, dns_record, user, dest, time_diff, ObjectGUID
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_short_lived_dns_record_filter`
splunk_rule_id: d585e253-1859-4170-977d-09376c731f74
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5137
    ObjectClass: dnsNode
  selection_1:
    EventID: 5136
    ObjectClass: dnsNode
    AttributeLDAPDisplayName: dNSTombstoned
    AttributeValue: 'TRUE'
  condition: selection_0 and selection_1
