title: Windows Admin Password Changed by Non-Admin
id: 6d4c4d88-cd60-43a1-8c70-c74a9614f724
status: stable
level: medium
author: Raven Tait, Splunk
description: The following analytic detects when a unprivileged user changes an Admin accounts password. This is a common artifact of successful exploitation of the BlueHammer Windows Defender privilege
  escalation. The attacker's process momentarily changes the passwords of high-value local accounts including the built-in Administrator to spawn an authenticated shell session, then immediately reverts
  the passwords to avoid detection. This uses EventID 4723 to log this activity.
references:
- https://github.com/Nightmare-Eclipse/BlueHammer
tags:
- attack.t1068
- attack.t1543.003
date: '2026-04-27'
original_spl: |-
  `wineventlog_security`
  EventCode=4723
  | rex field=object_id "-(?<target_rid>\d+)$"
  | rex field=SubjectUserSid "-(?<subject_rid>\d+)$"
  | where target_rid="500" OR tonumber(target_rid) IN (512,513,518,519,520)
  | where tonumber(subject_rid) >= 1000
  | where SubjectUserSid != object_id
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by dest user object_id EventCode src_user
       SubjectUserSid SubjectLogonId PrivilegeList
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_admin_password_changed_by_non_admin_filter`
splunk_rule_id: 6d4c4d88-cd60-43a1-8c70-c74a9614f724
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4723
  condition: selection_0
