title: Windows Multiple Users Fail To Authenticate Wth ExplicitCredentials
id: e61918fa-9ca4-11eb-836c-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies a source user failing to authenticate with 30 unique users using explicit credentials on a host. It leverages Windows Event 4648, which is generated when a
  process attempts an account logon by explicitly specifying account credentials. This detection is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain initial
  access or elevate privileges within an Active Directory environment. If confirmed malicious, this activity could lead to unauthorized access, privilege escalation, and potential compromise of sensitive
  information.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4648
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/basic-audit-logon-events
tags:
- attack.t1110.003
date: '2021-04-14'
original_spl: |-
  `wineventlog_security` EventCode=4648 Caller_User_Name!=*$ Target_User_Name!=*$
    | bucket span=5m _time
    | stats dc(Target_User_Name) AS unique_accounts values(Target_User_Name) as tried_account values(dest) as dest values(src_ip) as src_ip values(user) as user
      BY _time, Computer, Caller_User_Name
    | where unique_accounts > 30
    | `windows_multiple_users_fail_to_authenticate_wth_explicitcredentials_filter`
splunk_rule_id: e61918fa-9ca4-11eb-836c-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4648
  selection_1:
    Caller_User_Name|endswith: $
  selection_2:
    Target_User_Name|endswith: $
  condition: selection_0 and selection_1 and selection_2
