title: Windows AD GPO New CSE Addition
id: 700c11d1-da09-47b2-81aa-358c143c7986
status: stable
level: medium
author: Dean Luxton
description: This detection identifies when a a new client side extension is added to an Active Directory Group Policy using the Group Policy Management Console.
references:
- https://wald0.com/?p=179
- https://learn.microsoft.com/en-gb/archive/blogs/mempson/group-policy-client-side-extension-list
- https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
- https://github.com/FSecureLABS/SharpGPOAbuse
tags:
- attack.T1222_001
- attack.T1484_001
date: '2024-07-01'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  selection_1:
    ObjectClass: groupPolicyContainer
  selection_2:
    AttributeLDAPDisplayName: gPCMachineExtensionNames
  condition: selection_0 and selection_1 and selection_2
