title: Windows Hidden Schedule Task Settings
id: 0b730470-5fe8-4b13-93a7-fe0ad014d0cc
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of hidden scheduled tasks on Windows systems, which are not visible in the UI. It leverages Windows Security EventCode 4698 to identify tasks where
  the 'Hidden' setting is enabled. This behavior is significant as it may indicate malware activity, such as Industroyer2, or the use of living-off-the-land binaries (LOLBINs) to download additional payloads.
  If confirmed malicious, this activity could allow attackers to execute code stealthily, maintain persistence, or further compromise the system by downloading additional malicious payloads.
references:
- https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/
- https://cert.gov.ua/article/39518
tags:
- attack.t1053
date: '2022-04-27'
original_spl: |-
  `wineventlog_security`
  EventCode=4698
  TaskContent = "*<Hidden>true</Hidden>*"
  | stats count min(_time) as firstTime max(_time) as lastTime
    by TaskName TaskContent action signature status dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_hidden_schedule_task_settings_filter`
splunk_rule_id: 0b730470-5fe8-4b13-93a7-fe0ad014d0cc
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4698
  selection_1:
    TaskContent|contains: '<Hidden>true</Hidden>'
  condition: selection_0 and selection_1
