title: Windows Suspicious Burst of Password Changes
id: 0dcfcab9-e936-43bc-8203-005e17dc0744
status: stable
level: low
author: Raven Tait, Splunk
description: |-
  A regular user account performed rapid, repeated password changes across multiple local accounts within a 2-second window.
  This pattern is consistent with automated credential manipulation tools that cycle account passwords to deny access to defenders or escalate privileges The speed and volume of changes indicates scripted or tooled activity rather than manual administration, as legitimate password resets do not occur at machine speed across multiple accounts simultaneously.
references:
- https://github.com/Nightmare-Eclipse/BlueHammer
tags:
- attack.T1068
date: '2026-04-29'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4723
  selection_1:
    EventID: 4724
  condition: selection_0 and selection_1
