title: Windows Multiple Disabled Users Failed To Authenticate Wth Kerberos
id: 98f22d82-9d62-11eb-9fcf-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects a single source endpoint failing to authenticate with 30 unique disabled domain users using the Kerberos protocol within 5 minutes. It leverages Windows Security
  Event 4768, focusing on failure code `0x12`, indicating revoked credentials. This activity is significant as it may indicate a Password Spraying attack targeting disabled accounts, a tactic used by adversaries
  to gain initial access or elevate privileges. If confirmed malicious, this could lead to unauthorized access or privilege escalation within the Active Directory environment, posing a severe security risk.
references:
- https://attack.mitre.org/techniques/T1110/003/
tags:
- attack.t1110.003
date: '2021-04-14'
original_spl: |-
  `wineventlog_security` EventCode=4768 TargetUserName!=*$ Status=0x12
    | bucket span=5m _time
    | stats dc(TargetUserName) AS unique_accounts values(TargetUserName) as user values(dest) as dest
      BY _time, IpAddress
    | where unique_accounts > 30
    | `windows_multiple_disabled_users_failed_to_authenticate_wth_kerberos_filter`
splunk_rule_id: 98f22d82-9d62-11eb-9fcf-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4768
  selection_1:
    TargetUserName|endswith: $
  selection_2:
    Status: '0x12'
  condition: selection_0 and selection_1 and selection_2
