title: Windows AD DCShadow Privileges ACL Addition
id: ae915743-1aa8-4a94-975c-8062ebc8b723
status: stable
level: medium
author: Dean Luxton
description: This detection identifies an Active Directory access-control list (ACL) modification event, which applies the minimum required extended rights to perform the DCShadow attack.
references:
- https://www.labofapenetrationtester.com/2018/04/dcshadow.html
- https://github.com/samratashok/nishang/blob/master/ActiveDirectory/Set-DCShadowPermissions.ps1
- https://trustedsec.com/blog/a-hitchhackers-guide-to-dacl-based-detections-part-1-a
- https://lantern.splunk.com/Security/Product_Tips/Enterprise_Security/Enabling_an_audit_trail_from_Active_Directory
tags:
- attack.t1484
- attack.t1207
- attack.t1222.001
date: '2024-07-01'
original_spl: |-
  `wineventlog_security` EventCode=5136 ObjectClass=domainDNS
    | stats min(_time) as _time values(eval(if(OperationType=="%%14675",AttributeValue,null))) as old_value values(eval(if(OperationType=="%%14674",AttributeValue,null))) as new_value values(OperationType) as OperationType values(dest) as dest
      BY ObjectClass ObjectDN OpCorrelationID
         src_user SubjectLogonId
    | rex field=old_value max_match=10000 "\((?P<old_values>.*?)\)"
    | rex field=new_value max_match=10000 "\((?P<new_ace>.*?)\)"
    | mvexpand new_ace
    | where NOT new_ace IN (old_values)
    | rex field=new_ace "(?P<aceType>.*?);(?P<aceFlags>.*?);(?P<aceAccessRights>.*?);(?P<aceObjectGuid>.*?);;(?P<aceSid>.*?)$"
    | search aceObjectGuid IN ("9923a32a-3607-11d2-b9be-0000f87a36b2","1131f6ab-9c07-11d1-f79f-00c04fc2dcd2","1131f6ac-9c07-11d1-f79f-00c04fc2dcd2")
    | rex max_match=100 field=aceAccessRights "(?P<AccessRights>[A-Z]{2})"
    | rex max_match=100 field=aceFlags "(?P<aceFlags>[A-Z]{2})"
    | lookup msad_guid_lookup guid as aceObjectGuid OUTPUT displayName as ControlAccessRights
    | lookup ace_access_rights_lookup access_rights_string as AccessRights OUTPUT access_rights_value
    | lookup ace_type_lookup ace_type_string as aceType OUTPUT ace_type_value
    | lookup ace_flag_lookup flag_string as aceFlags OUTPUT flag_value as ace_flag_value ``` Optional SID resolution lookups
    | lookup identity_lookup_expanded objectSid as aceSid OUTPUT downLevelDomainName as user
    | lookup admon_groups_def objectSid as aceSid OUTPUT cn as group ```
    | lookup builtin_groups_lookup builtin_group_string  as aceSid OUTPUT builtin_group_name as builtin_group
    | eval aceType=coalesce(ace_type_value,aceType), aceFlags=coalesce(ace_flag_value,"This object only"), aceAccessRights=if(aceAccessRights="CCDCLCSWRPWPDTLOCRSDRCWDWO","Full control",coalesce(access_rights_value,AccessRights)), aceControlAccessRights=coalesce(ControlAccessRights,aceObjectGuid), user=coalesce(user, group, builtin_group, aceSid)
    | stats min(_time) as _time values(aceType) as aceType values(aceFlags) as aceFlags(inheritance) values(aceControlAccessRights) as aceControlAccessRights values(aceAccessRights) as aceAccessRights values(new_ace) as new_ace values(SubjectLogonId) as SubjectLogonId
      BY ObjectClass ObjectDN src_user
         user
    | search (aceControlAccessRights="Add/Remove Replica In Domain" AND aceControlAccessRights="Manage Replication Topology" AND aceControlAccessRights="Replication Synchronization") OR (aceControlAccessRights="9923a32a-3607-11d2-b9be-0000f87a36b2" AND aceControlAccessRights="1131f6ab-9c07-11d1-f79f-00c04fc2dcd2" AND aceControlAccessRights="1131f6ac-9c07-11d1-f79f-00c04fc2dcd2")
    | `windows_ad_dcshadow_privileges_acl_addition_filter`
splunk_rule_id: ae915743-1aa8-4a94-975c-8062ebc8b723
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 5136
  selection_1:
    ObjectClass: domainDNS
  condition: selection_0 and selection_1
