title: Windows Event Log Cleared
id: ad517544-aff9-4c96-bd99-d6eb43bfbb6a
status: stable
level: medium
author: Rico Valdez, Michael Haag, Splunk
description: The following analytic detects the clearing of Windows event logs by identifying Windows Security Event ID 1102 or System log event 104. This detection leverages Windows event logs to monitor
  for log clearing activities. Such behavior is significant as it may indicate an attempt to cover tracks after malicious activities. If confirmed malicious, this action could hinder forensic investigations
  and allow attackers to persist undetected, making it crucial to investigate further and correlate with other alerts and data sources.
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/auditing/event-1102
- https://www.ired.team/offensive-security/defense-evasion/disabling-windows-event-logs-by-suspending-eventlog-service-threads
- https://attack.mitre.org/techniques/T1070/001/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.001/T1070.001.md
tags:
- attack.t1685.005
date: '2019-10-16'
original_spl: |-
  (`wineventlog_security` EventCode=1102)
  OR
  (`wineventlog_system` EventCode=104)
  | stats count min(_time) as firstTime max(_time) as lastTime
    by action change_type dest dvc object_category signature_id status user vendor_product object EventCode
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_event_log_cleared_filter`
splunk_rule_id: ad517544-aff9-4c96-bd99-d6eb43bfbb6a
splunk_rule_type: TTP
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 1102
  selection_1:
    EventID: 104
  condition: selection_0 and selection_1
