title: Windows ESX Admins Group Creation Security Event
id: 53b4c927-5ec4-47cd-8aed-d4b303304f87
status: stable
level: medium
author: Michael Haag, Splunk
description: This analytic detects creation, deletion, or modification of the "ESX Admins" group in Active Directory. These events may indicate attempts to exploit the VMware ESXi Active Directory Integration
  Authentication Bypass vulnerability (CVE-2024-37085).
references:
- https://support.broadcom.com/web/ecx/support-content-notification/-/external/content/SecurityAdvisories/0/24505
- https://www.microsoft.com/en-us/security/blog/2024/07/29/ransomware-operators-exploit-esxi-hypervisor-vulnerability-for-mass-encryption/
- https://www.securityweek.com/microsoft-says-ransomware-gangs-exploiting-just-patched-vmware-esxi-flaw/
tags:
- attack.T1136_001
- attack.T1136_002
date: '2024-07-30'
logsource:
  product: windows
  service: security
detection:
  selection_1:
    TargetUserName: ESX Admins
  selection_2:
    TargetUserName|contains: '*ESX Admins*'
  condition: selection_1 and selection_2
