title: Windows Query Registry Browser List Application
id: 45ebd21c-f4bf-4ced-bd49-d25b6526cebb
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a suspicious process accessing the registry entries for default internet browsers. It leverages Windows Security Event logs, specifically event code 4663, to
  identify access attempts to these registry paths. This activity is significant because adversaries can exploit this registry key to gather information about installed browsers and their settings, potentially
  leading to the theft of sensitive data such as login credentials and browsing history. If confirmed malicious, this behavior could enable attackers to exfiltrate sensitive information and compromise user
  accounts.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
tags:
- attack.t1012
date: '2023-05-02'
original_spl: '`wineventlog_security` EventCode=4663 object_file_path IN ("*\\SOFTWARE\\Clients\\StartMenuInternet\\*", "*\\SOFTWARE\\Clients\\StartMenuInternet\\*") AND NOT process_path IN ("*:\\Windows\\System32\\*",
  "*:\\Windows\\SysWow64\\*", *:\\Windows\\WinSxS\\*, "*:\\Program Files\\*", "*:\\Program Files (x86)\\*") | stats count min(_time) as firstTime max(_time) as lastTime by object_file_name object_file_path
  process_name process_path  process_id EventCode dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_query_registry_browser_list_application_filter`'
splunk_rule_id: 45ebd21c-f4bf-4ced-bd49-d25b6526cebb
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|contains:
    - \SOFTWARE\Clients\StartMenuInternet\
    - \SOFTWARE\Clients\StartMenuInternet\
  filter_2:
    process_path:
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWow64\*'
    - '*:\Windows\WinSxS\*'
    - '*:\Program Files\*'
    - '*:\Program Files (x86)\*'
  condition: (selection_0 and selection_1) and not (filter_2)
