title: Windows Credentials from Password Stores Chrome Extension Access
id: 2e65afe0-9a75-4487-bd87-ada9a9f1b9af
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects non-Chrome processes attempting to access the Chrome extensions file.
  It leverages Windows Security Event logs, specifically event code 4663, to identify this behavior.
  This activity is significant because adversaries may exploit this file to extract sensitive information from the Chrome browser, posing a security risk.
  If confirmed malicious, this could lead to unauthorized access to stored credentials and other sensitive data, potentially compromising the security of the affected system and broader network.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
tags:
- attack.t1012
date: '2023-05-02'
original_spl: |-
  `wineventlog_security`
  EventCode=4663
  object_file_path="*\\AppData\\Local\\Google\\Chrome\\User Data\\Default\\Local Extension Settings\\*"
  NOT process_path IN (
      "*:\\Windows\\explorer.exe",
      "*\\AppData\\Local\\Google\\Chrome Beta\\Application\\chrome.exe",
      "*\\AppData\\Local\\Google\\Chrome Dev\\Application\\chrome.exe",
      "*\\AppData\\Local\\Google\\Chrome SxS\\Application\\chrome.exe",
      "*\\AppData\\Local\\Google\\Chrome Unstable\\Application\\chrome.exe",
      "*\\AppData\\Local\\Google\\Chrome\\Application\\chrome.exe"
  )
  | stats count min(_time) as firstTime
                max(_time) as lastTime

    by object_file_name object_file_path
       process_name process_path
       process_id EventCode dest

  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_credentials_from_password_stores_chrome_extension_access_filter`
splunk_rule_id: 2e65afe0-9a75-4487-bd87-ada9a9f1b9af
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4663
  selection_1:
    object_file_path|contains: \AppData\Local\Google\Chrome\User Data\Default\Local Extension Settings\
  filter_2:
    process_path:
    - '*:\Windows\explorer.exe'
    - '*\AppData\Local\Google\Chrome Beta\Application\chrome.exe'
    - '*\AppData\Local\Google\Chrome Dev\Application\chrome.exe'
    - '*\AppData\Local\Google\Chrome SxS\Application\chrome.exe'
    - '*\AppData\Local\Google\Chrome Unstable\Application\chrome.exe'
    - '*\AppData\Local\Google\Chrome\Application\chrome.exe'
  condition: (selection_0 and selection_1) and not (filter_2)
