title: Windows Kerberos Coercion via DNS
id: 9029b575-6f6b-4ab1-b660-67b24b7e9c3d
status: stable
level: medium
author: Raven Tait, Splunk
description: Detects DNS-based Kerberos coercion attacks where adversaries inject marshaled credential structures into DNS records to spoof SPNs and redirect authentication such as in CVE-2025-33073. This
  detection leverages Windows Security Event Codes 5136, 5137, 4662, looking for DNS events with specific CREDENTIAL_TARGET_INFORMATION entries.
references:
- https://web.archive.org/web/20250617122747/https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx
- https://www.guidepointsecurity.com/blog/the-birth-and-death-of-loopyticket/
tags:
- attack.T1071_004
- attack.T1557_001
- attack.T1187
date: '2025-11-18'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    ObjectClass: dnsNode
    ObjectDN|contains: '*1UWhRCA*'
  selection_1:
    EventID: '4662'
    AdditionalInfo|contains: '*1UWhRCA*'
  condition: selection_0 and selection_1
