title: Windows Identify PowerShell Web Access IIS Pool
id: d8419343-f0f8-4d8e-91cc-18bb531df87d
status: stable
level: medium
author: Michael Haag, Splunk
description: This analytic detects and analyzes PowerShell Web Access (PSWA) usage in Windows environments. It tracks both connection attempts (EventID 4648) and successful logons (EventID 4624) associated
  with PSWA, providing a comprehensive view of access patterns. The analytic identifies PSWA's operational status, host servers, processes, and connection metrics. It highlights unique target accounts,
  domains accessed, and verifies logon types. This information is crucial for detecting potential misuse, such as lateral movement, brute force attempts, or unusual access patterns. By offering insights
  into PSWA activity, it enables security teams to quickly assess and investigate potential security incidents involving this powerful administrative tool.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-241a
- https://gist.github.com/MHaggis/7e67b659af9148fa593cf2402edebb41
tags:
- attack.T1190
date: '2024-09-30'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4648
  selection_1:
    EventID: 4624
  selection_2:
    EventID: 4625
  selection_3:
    SubjectUserName: pswa_pool
  condition: selection_0 and selection_1 and selection_2 and selection_3
