title: WinEvent Scheduled Task Created to Spawn Shell
id: 203ef0ea-9bd8-11eb-8201-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of scheduled tasks designed to execute commands using native Windows shells like PowerShell, Cmd, Wscript, or Cscript. It leverages Windows Security
  EventCode 4698 to identify when such tasks are registered. This activity is significant as it may indicate an attempt to establish persistence or execute malicious commands on a system. If confirmed malicious,
  this could allow an attacker to maintain access, execute arbitrary code, or escalate privileges, posing a severe threat to the environment.
references:
- https://research.checkpoint.com/2021/irans-apt34-returns-with-an-updated-arsenal/
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4698
- https://redcanary.com/threat-detection-report/techniques/scheduled-task-job/
- https://docs.microsoft.com/en-us/windows/win32/taskschd/time-trigger-example--scripting-?redirectedfrom=MSDN
tags:
- attack.T1053_005
date: '2021-04-08'
logsource:
  product: windows
  service: security
detection:
  selection_0:
    EventID: 4698
  selection_1:
    TaskContent|contains:
    - '*powershell.exe*'
    - '*wscript.exe*'
    - '*cscript.exe*'
    - '*cmd.exe*'
    - '*sh.exe*'
    - '*ksh.exe*'
    - '*zsh.exe*'
    - '*bash.exe*'
    - '*scrcons.exe*'
    - '*pwsh.exe*'
  condition: selection_0 and selection_1
