title: Access LSASS Memory for Dump Creation
id: fb4c31b0-13e8-4155-8aa5-24de4b8d6717
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects attempts to dump the LSASS process memory, a common technique in credential dumping attacks. It leverages Sysmon logs, specifically EventCode 10, to identify
  suspicious call traces to dbgcore.dll and dbghelp.dll associated with lsass.exe. This activity is significant as it often precedes the theft of sensitive login credentials, posing a high risk of unauthorized
  access to systems and data. If confirmed malicious, attackers could gain access to critical credentials, enabling further compromise and lateral movement within the network.
references:
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
tags:
- attack.t1003.001
date: '2019-12-11'
original_spl: |-
  `sysmon` EventCode=10 TargetImage=*lsass.exe CallTrace=*dbgcore.dll* OR CallTrace=*dbghelp.dll*
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY CallTrace EventID GrantedAccess
         Guid Opcode ProcessID
         SecurityID SourceImage SourceProcessGUID
         SourceProcessId TargetImage TargetProcessGUID
         TargetProcessId UserID dest
         granted_access parent_process_exec parent_process_guid
         parent_process_id parent_process_name parent_process_path
         process_exec process_guid process_id
         process_name process_path signature
         signature_id user_id vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `access_lsass_memory_for_dump_creation_filter`
splunk_rule_id: fb4c31b0-13e8-4155-8aa5-24de4b8d6717
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
    TargetImage|endswith: '*lsass.exe'
    CallTrace|contains: '*dbgcore.dll*'
  selection_1:
    CallTrace|contains: dbghelp.dll
  condition: selection_0 and selection_1
