title: Creation of lsass Dump with Taskmgr
id: b2fbe95a-9c62-4c12-8a29-24b97e84c0cd
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of an lsass.exe process dump using Windows Task Manager. It leverages Sysmon EventID 11 to identify file creation events where the target filename
  matches *lsass*.dmp. This activity is significant because creating an lsass dump can be a precursor to credential theft, as the dump file contains sensitive information such as user passwords. If confirmed
  malicious, an attacker could use the lsass dump to extract credentials and escalate privileges, potentially compromising the entire network.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md#atomic-test-5---dump-lsassexe-memory-using-windows-task-manager
- https://attack.mitre.org/techniques/T1003/001/
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
tags:
- attack.t1003.001
date: '2019-12-11'
original_spl: |-
  `sysmon` EventID=11 process_name=taskmgr.exe TargetFilename=*lsass*.dmp
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action dest file_name
         file_path process_guid process_id
         user_id vendor_product process_name
         TargetFilename
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `creation_of_lsass_dump_with_taskmgr_filter`
splunk_rule_id: b2fbe95a-9c62-4c12-8a29-24b97e84c0cd
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 11
  selection_1:
    process_name: taskmgr.exe
  selection_2:
    TargetFilename|endswith: lsass*.dmp
  condition: selection_0 and selection_1 and selection_2
