title: Create Remote Thread In Shell Application
id: 10399c1e-f51e-11eb-b920-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects suspicious process injection in command shell applications, specifically targeting `cmd.exe` and `powershell.exe`.
  It leverages Sysmon EventCode 8 to identify the creation of remote threads within these shell processes.
  This activity is significant because it is a common technique used by malware, such as IcedID, to inject malicious code and execute it within legitimate processes.
  If confirmed malicious, this behavior could allow an attacker to execute arbitrary code, escalate privileges, or maintain persistence within the environment, posing a severe threat to system security.
references:
- https://thedfirreport.com/2021/07/19/icedid-and-cobalt-strike-vs-antivirus/
tags:
- attack.t1055
date: '2021-08-05'
original_spl: |-
  `sysmon`
  EventCode=8
  TargetImage IN (
      "*\\cmd.exe",
      "*\\powershell_ise.exe",
      "*\\powershell.exe",
      "*\\pwsh.exe"
  )
  | stats count min(_time) as firstTime
                max(_time) as lastTime
                values(NewThreadId) as "NewThreadId"
                values(StartAddress) as "StartAddress"
    by dest signature_id signature
       SourceProcessGuid SourceProcessId SourceImage
       TargetProcessGuid TargetProcessId TargetImage
       StartModule StartFunction vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `create_remote_thread_in_shell_application_filter`
splunk_rule_id: 10399c1e-f51e-11eb-b920-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 8
  selection_1:
    TargetImage|endswith:
    - \cmd.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  condition: selection_0 and selection_1
