title: Detect Regsvcs with Network Connection
id: e3e7a1c0-f2b9-445c-8493-f30a63522d1a
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies instances of Regsvcs.exe establishing a network connection to a public IP address, excluding private IP ranges. This detection leverages Sysmon EventID 3 logs
  to monitor network connections initiated by Regsvcs.exe. This activity is significant as Regsvcs.exe, a legitimate Microsoft-signed binary, can be exploited to bypass application control mechanisms and
  establish remote Command and Control (C2) channels. If confirmed malicious, this behavior could allow an attacker to escalate privileges, persist in the environment, and exfiltrate sensitive data. Immediate
  investigation and remediation are recommended.
references:
- https://attack.mitre.org/techniques/T1218/009/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.009/T1218.009.md
- https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
tags:
- attack.t1218.009
date: '2021-02-16'
original_spl: |-
  `sysmon`
  EventID=3
  NOT dest_ip IN (
    "10.0.0.0/8", "172.16.0.0/12", "192.168.0.0/16", "100.64.0.0/10",
    "127.0.0.0/8", "169.254.0.0/16", "192.0.0.0/24", "192.0.0.0/29", "192.0.0.8/32",
    "192.0.0.9/32", "192.0.0.10/32", "192.0.0.170/32", "192.0.0.171/32", "192.0.2.0/24",
    "192.31.196.0/24", "192.52.193.0/24", "192.88.99.0/24", "224.0.0.0/4", "192.175.48.0/24",
    "198.18.0.0/15", "198.51.100.0/24", "203.0.113.0/24", "240.0.0.0/4"
  )
  process_name=regsvcs.exe
  | stats count min(_time) as firstTime max(_time) as lastTime
    by action app dest dest_ip dest_port direction dvc protocol protocol_version src
       src_ip src_port transport user vendor_product process_name process_exec process_guid
       process_id
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `detect_regsvcs_with_network_connection_filter`
splunk_rule_id: e3e7a1c0-f2b9-445c-8493-f30a63522d1a
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 3
  filter_1:
    dest_ip:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
  selection_2:
    process_name: regsvcs.exe
  condition: (selection_0 and selection_2) and not (filter_1)
