title: Drop IcedID License dat
id: b7a045fc-f14a-11eb-8e79-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the dropping of a suspicious file named "license.dat" in %appdata% or %programdata%. This behavior is associated with the IcedID malware, which uses this file
  to inject its core bot into other processes for banking credential theft. The detection leverages Sysmon EventCode 11 to monitor file creation events in these directories. This activity is significant
  as it indicates a potential malware infection aiming to steal sensitive banking information. If confirmed malicious, the attacker could gain unauthorized access to financial data, leading to significant
  financial loss and data breaches.
references:
- https://www.cisecurity.org/insights/white-papers/security-primer-icedid
tags:
- attack.t1204.002
date: '2021-08-05'
original_spl: '`sysmon` EventCode= 11  TargetFilename = "*\\license.dat" AND (TargetFilename="*\\appdata\\*" OR TargetFilename="*\\programdata\\*") |stats count min(_time) as firstTime max(_time) as lastTime
  by TargetFilename EventCode process_id  process_name dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `drop_icedid_license_dat_filter`'
splunk_rule_id: b7a045fc-f14a-11eb-8e79-acde48001122
splunk_rule_type: Hunting
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 11
  selection_1:
    TargetFilename|endswith: \license.dat
  condition: selection_0 and selection_1
