title: Powershell Remote Thread To Known Windows Process
id: ec102cb2-a0f5-11eb-9b38-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects suspicious PowerShell processes attempting to inject code into critical Windows processes using CreateRemoteThread.
  It leverages Sysmon EventCode 8 to identify instances where PowerShell spawns threads in processes like svchost.exe, csrss.exe, and others.
  This activity is significant as it is commonly used by malware such as TrickBot and offensive tools like Cobalt Strike to execute malicious payloads, establish reverse shells, or download additional malware.
  If confirmed malicious, this behavior could lead to unauthorized code execution, privilege escalation, and persistent access within the environment.
references:
- https://thedfirreport.com/2021/01/11/trickbot-still-alive-and-well/
tags:
- attack.t1055
date: '2021-04-26'
original_spl: |-
  `sysmon`
  EventCode=8
  SourceImage IN (
      "*\\powershell_ise.exe",
      "*\\powershell.exe",
      "*\\pwsh.exe"
  )
  TargetImage IN (
      "*\\csrss.exe",
      "*\\explorer.exe",
      "*\\gpupdate.exe",
      "*\\services.exe",
      "*\\smss.exe",
      "*\\spoolsv.exe",
      "*\\svchost.exe",
      "*\\taskhost.exe",
      "*\\userinit.exe",
      "*\\wininit.exe",
      "*\\winlogon.exe"
  )
  | stats count min(_time) as firstTime
                max(_time) as lastTime
                values(NewThreadId) as "NewThreadId"
                values(StartAddress) as "StartAddress"
    by dest signature_id signature
       SourceProcessGuid SourceProcessId SourceImage
       TargetProcessGuid TargetProcessId TargetImage
       StartModule StartFunction vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `powershell_remote_thread_to_known_windows_process_filter`
splunk_rule_id: ec102cb2-a0f5-11eb-9b38-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 8
  selection_1:
    SourceImage|endswith:
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
  selection_2:
    TargetImage|endswith:
    - \csrss.exe
    - \explorer.exe
    - \gpupdate.exe
    - \services.exe
    - \smss.exe
    - \spoolsv.exe
    - \svchost.exe
    - \taskhost.exe
    - \userinit.exe
    - \wininit.exe
    - \winlogon.exe
  condition: selection_0 and selection_1 and selection_2
