title: Ransomware Notes bulk creation
id: eff7919a-8330-11eb-83f8-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the bulk creation of ransomware notes (e.g., .txt, .html, .hta files) on an infected machine. It leverages Sysmon EventCode 11 to detect multiple instances
  of these file types being created within a short time frame. This activity is significant as it often indicates an active ransomware attack, where the attacker is notifying the victim of the encryption.
  If confirmed malicious, this behavior could lead to widespread data encryption, rendering critical files inaccessible and potentially causing significant operational disruption.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
- attack.t1486
date: '2021-03-19'
original_spl: |-
  `sysmon` EventCode=11 file_name IN ("*\.txt","*\.html","*\.hta")
    | bin _time span=10s
    | stats min(_time) as firstTime max(_time) as lastTime dc(TargetFilename) as unique_readme_path_count values(TargetFilename) as list_of_readme_path values(action) as action values(file_access_time) as file_access_time values(file_create_time) as file_create_time values(file_hash) as file_hash values(file_modify_time) as file_modify_time values(file_path) as file_path values(file_acl) as file_acl values(file_size) as file_size values(process_guid) as process_guid values(process_id) as process_id values(user) as user values(vendor_product) as vendor_product
      BY dest file_name
    | where unique_readme_path_count >= 15
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `ransomware_notes_bulk_creation_filter`
splunk_rule_id: eff7919a-8330-11eb-83f8-acde48001122
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 11
  selection_1:
    file_name|endswith:
    - \.txt
    - \.html
    - \.hta
  condition: selection_0 and selection_1
