title: Rundll32 Create Remote Thread To A Process
id: 2dbeee3a-f067-11eb-96c0-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the creation of a remote thread by rundll32.exe into another process. It leverages Sysmon EventCode 8 logs, specifically monitoring SourceImage and TargetImage fields.
  This activity is significant as it is a common technique used by malware, such as IcedID, to execute malicious code within legitimate processes, aiding in defense evasion and data theft.
  If confirmed malicious, this behavior could allow an attacker to execute arbitrary code, escalate privileges, and exfiltrate sensitive information from the compromised host.
references:
- https://www.joesandbox.com/analysis/380662/0/html
tags:
- attack.t1055
date: '2021-07-29'
original_spl: |-
  `sysmon`
  EventCode=8
  SourceImage="*\\rundll32.exe"
  TargetImage = "*.exe"
  | stats count min(_time) as firstTime
                max(_time) as lastTime
                values(NewThreadId) as "NewThreadId"
                values(StartAddress) as "StartAddress"
    by dest signature_id signature
       SourceProcessGuid SourceProcessId SourceImage
       TargetProcessGuid TargetProcessId TargetImage
       StartModule StartFunction vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `rundll32_create_remote_thread_to_a_process_filter`
splunk_rule_id: 2dbeee3a-f067-11eb-96c0-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 8
  selection_1:
    SourceImage|endswith: \rundll32.exe
  selection_2:
    TargetImage|endswith: .exe
  condition: selection_0 and selection_1 and selection_2
