title: Rundll32 CreateRemoteThread In Browser
id: f8a22586-ee2d-11eb-a193-acde48001122
status: deprecated
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the suspicious creation of a remote thread by rundll32.exe targeting browser processes such as firefox.exe, chrome.exe, iexplore.exe, and microsoftedgecp.exe.
  This detection leverages Sysmon EventCode 8, focusing on SourceImage and TargetImage fields to identify the behavior.
  This activity is significant as it is commonly associated with malware like IcedID, which hooks browsers to steal sensitive information such as banking details.
  If confirmed malicious, this could allow attackers to intercept and exfiltrate sensitive user data, leading to potential financial loss and privacy breaches.
references:
- https://www.joesandbox.com/analysis/380662/0/html
tags:
- attack.t1055
date: '2021-07-29'
original_spl: |-
  `sysmon`
  EventCode=8
  SourceImage="*\\rundll32.exe"
  TargetImage IN (
      "*\\chrome.exe",
      "*\\firefox.exe",
      "*\\iexplore.exe",
      "*\\microsoftedgecp.exe"
  )
  | stats count min(_time) as firstTime
                max(_time) as lastTime
                values(NewThreadId) as "NewThreadId"
                values(StartAddress) as "StartAddress"
    by dest signature_id signature
       SourceProcessGuid SourceProcessId SourceImage
       TargetProcessGuid TargetProcessId TargetImage
       StartModule StartFunction
       SourceUser TargetUser vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `rundll32_createremotethread_in_browser_filter`
splunk_rule_id: f8a22586-ee2d-11eb-a193-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 8
  selection_1:
    SourceImage|endswith: \rundll32.exe
  selection_2:
    TargetImage|endswith:
    - \chrome.exe
    - \firefox.exe
    - \iexplore.exe
    - \microsoftedgecp.exe
  condition: selection_0 and selection_1 and selection_2
