title: SchCache Change By App Connect And Create ADSI Object
id: 991eb510-0fc6-11ec-82d3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects an application attempting to connect and create an ADSI object to perform an LDAP query. It leverages Sysmon EventCode 11 to identify changes in the Active Directory
  Schema cache files located in %LOCALAPPDATA%\Microsoft\Windows\SchCache or %systemroot%\SchCache. This activity is significant as it can indicate the presence of suspicious applications, such as ransomware,
  using ADSI object APIs for LDAP queries. If confirmed malicious, this behavior could allow attackers to gather sensitive directory information, potentially leading to further exploitation or lateral movement
  within the network.
references:
- https://docs.microsoft.com/en-us/windows/win32/adsi/adsi-and-uac
- https://news.sophos.com/en-us/2021/08/09/blackmatter-ransomware-emerges-from-the-shadow-of-darkside/
tags:
- attack.t1087.002
date: '2021-09-08'
original_spl: |-
  `sysmon` EventCode=11 TargetFilename = "*\\Windows\\SchCache\\*" TargetFilename
      = "*.sch*" NOT (Image IN ("*\\Windows\\system32\\mmc.exe"))
  | stats count min(_time)
      as firstTime max(_time) as lastTime by action dest file_name file_path process_guid
      process_id user_id vendor_product process_name
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `schcache_change_by_app_connect_and_create_adsi_object_filter`
splunk_rule_id: 991eb510-0fc6-11ec-82d3-acde48001122
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 11
  selection_1:
    TargetFilename|contains: \Windows\SchCache\
  selection_2:
    TargetFilename|contains: .sch
  filter_3:
    Image: '*\Windows\system32\mmc.exe'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
