title: Wermgr Process Create Executable File
id: ab3bcce0-a105-11eb-973c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the wermgr.exe process creating an executable file. It leverages Sysmon EventCode 11 to identify instances where wermgr.exe generates a .exe file. This behavior
  is unusual because wermgr.exe is typically associated with error reporting, not file creation. Such activity is significant as it may indicate TrickBot malware, which injects code into wermgr.exe to execute
  malicious actions like downloading additional payloads. If confirmed malicious, this could lead to further malware infections, data exfiltration, or system compromise.
references:
- https://labs.vipre.com/trickbot-and-its-modules/
- https://whitehat.eu/incident-response-case-study-featuring-ryuk-and-trickbot-part-2/
tags:
- attack.t1027
date: '2021-04-26'
original_spl: |-
  `sysmon` EventCode=11 process_name = "wermgr.exe" TargetFilename = "*.exe"
    | stats  min(_time) as firstTime max(_time) as lastTime count
      BY action dest file_name
         file_path process_guid process_id
         user_id vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `wermgr_process_create_executable_file_filter`
splunk_rule_id: ab3bcce0-a105-11eb-973c-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 11
  selection_1:
    process_name: wermgr.exe
  selection_2:
    TargetFilename|endswith: .exe
  condition: selection_0 and selection_1 and selection_2
