title: Windows AI Platform DNS Query
id: 1ad89d24-c856-4a0e-8fdf-c20c7b9febe1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects DNS queries initiated by the Windows AI Platform to domains associated with Hugging Face, OpenAI, and other popular providers of machine learning models and services. Monitoring these DNS requests is important because it can reveal when systems are accessing external AI platforms, which may indicate the use of third-party AI resources or the transfer of sensitive data outside the organization’s environment. Detecting such activity enables organizations to enforce data governance policies, prevent unapproved use of external AI services, and maintain visibility into potential data exfiltration risks. Proactive monitoring provides better control over AI model usage and helps safeguard organizational data flows.
references:
- https://cert.gov.ua/article/6284730
- https://www.microsoft.com/en-us/security/blog/2025/11/03/sesameop-novel-backdoor-uses-openai-assistants-api-for-command-and-control/
tags:
- attack.t1071.004
date: '2025-08-28'
original_spl: |-
  `sysmon` EventCode=22 QueryName IN ("router.huggingface.co", "api.openai.com")
    | lookup update=true browser_app_list browser_process_name AS process_name OUTPUT isAllowed | search isAllowed!=true
    | rename dvc as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
    by answer answer_count dest process_exec process_guid process_name query query_count reply_code_id signature signature_id src user_id Image
    vendor_product QueryName QueryResults QueryStatus
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
  | `windows_ai_platform_dns_query_filter`
splunk_rule_id: 1ad89d24-c856-4a0e-8fdf-c20c7b9febe1
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 22
  selection_1:
    QueryName:
    - router.huggingface.co
    - api.openai.com
  condition: selection_0 and selection_1
