title: Windows Anonymous Pipe Activity
id: ee301e1e-cd81-4011-a911-e5f049b9e3d5
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation or connection of anonymous pipes for inter-process communication (IPC) within a Windows environment. Anonymous pipes are commonly used by legitimate
  system processes, services, and applications to transfer data between related processes. However, adversaries frequently abuse anonymous pipes to facilitate stealthy process injection, command-and-control
  (C2) communication, credential theft, or privilege escalation. This detection monitors for unusual anonymous pipe activity, particularly involving non-system processes, unsigned executables, or unexpected
  parent-child process relationships. While legitimate use cases exist—such as Windows services, software installers, or security tools—unusual or high-frequency anonymous pipe activity should be investigated
  for potential malware, persistence mechanisms, or lateral movement techniques.
references:
- https://www.trendmicro.com/en_nl/research/24/k/earth-estries.html
tags:
- attack.t1559
date: '2025-02-13'
original_spl: '`sysmon` EventCode IN (17,18) EventType IN ( "CreatePipe", "ConnectPipe") PipeName="*Anonymous Pipe*" NOT( Image IN ("C:\\Program Files*", "C:\\Windows\\system32\\*","C:\\Windows\\syswow64\\*"))
  | stats  min(_time) as firstTime max(_time) as lastTime count by dest EventCode PipeName ProcessGuid ProcessId Image EventType | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_anonymous_pipe_activity_filter`'
splunk_rule_id: ee301e1e-cd81-4011-a911-e5f049b9e3d5
splunk_rule_type: Hunting
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID:
    - 17
    - 18
  selection_1:
    EventType:
    - CreatePipe
    - ConnectPipe
  selection_2:
    PipeName|contains: Anonymous Pipe
  filter_3:
    Image:
    - C:\Program Files*
    - C:\Windows\system32\*
    - C:\Windows\syswow64\*
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
