title: Windows Gather Victim Network Info Through Ip Check Web Services
id: 70f7c952-0758-46d6-9148-d8969c4481d1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects processes attempting to connect to known IP check web services. This behavior is identified using Sysmon EventCode 22 logs, specifically monitoring DNS queries
  to services like "wtfismyip.com" and "ipinfo.io". This activity is significant as it is commonly used by malware, such as Trickbot, for reconnaissance to determine the infected machine's IP address. If
  confirmed malicious, this could allow attackers to gather network information, aiding in further attacks or lateral movement within the network.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
tags:
- attack.t1590.005
date: '2022-06-24'
original_spl: |-
  `sysmon` EventCode=22  QueryName IN ("*wtfismyip.com", "*checkip.*", "*ipecho.net", "*ipinfo.io", "*api.ipify.org", "*icanhazip.com", "*ip.anysrc.com","*api.ip.sb", "ident.me", "www.myexternalip.com", "*zen.spamhaus.org", "*cbl.abuseat.org", "*b.barracudacentral.org", "*dnsbl-1.uceprotect.net", "*spam.dnsbl.sorbs.net", "*iplogger.org*", "*ip-api.com*", "*geoip.*", "*icanhazip.*", "*ipwho.is*", "*ifconfig.me*", "*myip.com*", "*ipstack.com*", "*myexternalip.com*", "*ip-api.io*", "*trackip.net*", "*ipgeolocation.io*", "*ipfind.io*", "*freegeoip.app*", "*ipv4bot.whatismyipaddress.com*")
    | stats  min(_time) as firstTime max(_time) as lastTime count
      BY answer answer_count dvc
         process_exec process_guid process_name
         query query_count reply_code_id
         signature signature_id src
         user_id vendor_product QueryName
         QueryResults QueryStatus
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_gather_victim_network_info_through_ip_check_web_services_filter`
splunk_rule_id: 70f7c952-0758-46d6-9148-d8969c4481d1
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 22
  selection_1:
    QueryName:
    - '*wtfismyip.com'
    - '*checkip.*'
    - '*ipecho.net'
    - '*ipinfo.io'
    - '*api.ipify.org'
    - '*icanhazip.com'
    - '*ip.anysrc.com'
    - '*api.ip.sb'
    - ident.me
    - www.myexternalip.com
    - '*zen.spamhaus.org'
    - '*cbl.abuseat.org'
    - '*b.barracudacentral.org'
    - '*dnsbl-1.uceprotect.net'
    - '*spam.dnsbl.sorbs.net'
    - '*iplogger.org*'
    - '*ip-api.com*'
    - '*geoip.*'
    - '*icanhazip.*'
    - '*ipwho.is*'
    - '*ifconfig.me*'
    - '*myip.com*'
    - '*ipstack.com*'
    - '*myexternalip.com*'
    - '*ip-api.io*'
    - '*trackip.net*'
    - '*ipgeolocation.io*'
    - '*ipfind.io*'
    - '*freegeoip.app*'
    - '*ipv4bot.whatismyipaddress.com*'
  condition: selection_0 and selection_1
