title: Windows Devtunnels Image Loaded
id: 15bb8eb7-8e68-490b-9032-18f7adce53c7
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects image load events associated with Microsoft Devtunnels usage.
  Microsoft Devtunnels is a feature within Visual Studio that allows developers to expose their local development environment to the internet via secure, temporary tunnels, enabling external access for testing webhooks, APIs, and other services.
  While designed for legitimate development purposes, an attacker could exploit this feature to expose a compromised system or service to the internet, creating a covert communication channel that bypasses network security measures.
  By using Dev Tunnels, the attacker can establish a remote connection to the compromised environment, facilitate data exfiltration, or maintain command-and-control communications while avoiding detection by blending their activities with legitimate development traffic.
references:
- https://blueteamops.medium.com/detecting-dev-tunnels-16f0994dc3e2
tags:
- attack.t1090
date: '2026-05-05'
original_spl: |-
  `sysmon`
  EventID=7
  ImageLoaded="*\\AppData\\Local\\Temp\\.net\\devtunnel\\*"
  ImageLoaded="*devtunnel.dll"
  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by Computer ImageLoaded EventID loaded_file loaded_file_path process_exec process_guid
       process_hash process_id process_name process_path service_dll_signature_exists
       service_dll_signature_verified signature_id user_id vendor_product

  | rename Computer as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_devtunnels_image_loaded_filter`
splunk_rule_id: 15bb8eb7-8e68-490b-9032-18f7adce53c7
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains: \AppData\Local\Temp\.net\devtunnel\
  selection_2:
    ImageLoaded|endswith: devtunnel.dll
  condition: selection_0 and selection_1 and selection_2
