title: Windows Suspicious Defender Engine or Signature Files Created
id: 42e848eb-1d5f-4ffb-88c2-088c4a6fdfb3
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects Windows Defender engine (mpengine.dll) or signature database files (*.vdm) being created by any process that is not a Windows Defender component.
  BlueHammer extracts these files from the downloaded mpam-fe update package into a UUID-named subdirectory of %TEMP% as part of staging the TOCTOU privilege escalation.
references:
- https://github.com/Nightmare-Eclipse/BlueHammer
tags:
- attack.t1068
date: '2026-04-27'
original_spl: |-
  `sysmon` EventID="11"
  TargetFilename IN (
      "*\\mpasbase.vdm*",
      "*\\mpasdlta.vdm*",
      "*\\mpavbase.vdm*",
      "*\\mpavdlta.vdm*",
      "*\\mpengine.dll*"
  )
  NOT Image IN (
      "*:\\ProgramData\\Microsoft\\Windows Defender\\*",
      "*:\\Program Files\\Windows Defender\\*"
  )
  | fillnull
  | rename Computer as dest
  | stats count by dest TargetFilename Image EventID
                   action file_name file_path process_guid
                   process_id user vendor_product

  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_suspicious_defender_engine_or_signature_files_created_filter`
splunk_rule_id: 42e848eb-1d5f-4ffb-88c2-088c4a6fdfb3
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: '11'
  selection_1:
    TargetFilename|contains:
    - \mpasbase.vdm
    - \mpasdlta.vdm
    - \mpavbase.vdm
    - \mpavdlta.vdm
    - \mpengine.dll
  filter_2:
    Image:
    - '*:\ProgramData\Microsoft\Windows Defender\*'
    - '*:\Program Files\Windows Defender\*'
  condition: (selection_0 and selection_1) and not (filter_2)
