title: Windows Remote Image Load
id: 041aaae4-03de-465c-b9cb-9ed0d1e10454
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  The following analytic detects image load events where a process loads a file from a remote share path.
  This activity is significant because remote DLL or image loading can be abused for execution, defense evasion, or lateral movement while leaving the payload hosted on another system.
  If confirmed malicious, an attacker may be loading code into a local process from attacker-controlled infrastructure.
references:
- https://thehackernews.com/2024/08/microsoft-reveals-four-openvpn-flaws.html
- https://www.microsoft.com/en-us/security/blog/2024/08/08/chained-for-attack-openvpn-vulnerabilities-discovered-leading-to-rce-and-lpe/
tags:
- attack.t1129
- attack.t1059
- attack.t1068
- attack.t1203
date: '2026-05-05'
original_spl: |-
  `sysmon`
  EventID=7
  ImageLoaded="\\\\*"
  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by Computer ImageLoaded EventID dest loaded_file loaded_file_path process_exec
       process_guid process_hash process_id process_name process_path
       service_dll_signature_exists service_dll_signature_verified signature_id user_id
       vendor_product

  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_remote_image_load_filter`
splunk_rule_id: 041aaae4-03de-465c-b9cb-9ed0d1e10454
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|startswith: \\
  condition: selection_0 and selection_1
