title: Windows Abused Web Services
id: 01f0aef4-8591-4daa-a53d-0ed49823b681
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a suspicious process making DNS queries to known, abused web services such as text-paste sites, VoIP, secure tunneling, instant messaging, and digital distribution
  platforms. This detection leverages Sysmon logs with Event ID 22, focusing on specific query names. This activity is significant as it may indicate an adversary attempting to download malicious files,
  a common initial access technique. If confirmed malicious, this could lead to unauthorized code execution, data exfiltration, or further compromise of the target host.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
tags:
- attack.t1102
date: '2021-11-18'
original_spl: |-
  `sysmon`
  EventCode=22
  QueryName IN (
      "*//objects.githubusercontent.com*",
      "*anonfiles.com*",
      "*.argotunnel.com*",
      "*cdn.discordapp.com*",
      "*ddns.net*",
      "*dl.dropboxusercontent.com*",
      "*duckdns.org*",
      "*ghostbin.co*",
      "*glitch.me*",
      "*gofile.io*",
      "*hastebin.com*",
      "*mediafire.com*",
      "*mega.nz*",
      "*ngrok.io*",
      "*onrender.com*",
      "*pages.dev*",
      "*paste.ee*",
      "*pastebin.com*",
      "*pastebin.pl*",
      "*pasteio.com*",
      "*pastetext.net*",
      "*privatlab.com*",
      "*privatlab.net*",
      "*send.exploit.in*",
      "*sendspace.com*",
      "*storage.googleapis.com*",
      "*storjshare.io*",
      "*supabase.co*",
      "*temp.sh*",
      "*textbin*",
      "*transfer.sh*",
      "*trycloudflare.com*",
      "*ufile.io*",
      "*w3spaces.com*",
      "*workers.dev*"
  )
  | eval answer=coalesce(answer,"none")
  | eval answer_count=coalesce(answer_count,0)
  | rename dvc as dest
  | stats  min(_time) as firstTime max(_time) as lastTime count
      BY answer answer_count dest process_exec process_guid
         process_name query query_count reply_code_id signature
         signature_id src user_id vendor_product
         QueryName QueryResults QueryStatus
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_abused_web_services_filter`
splunk_rule_id: 01f0aef4-8591-4daa-a53d-0ed49823b681
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 22
  selection_1:
    QueryName|contains:
    - //objects.githubusercontent.com
    - anonfiles.com
    - .argotunnel.com
    - cdn.discordapp.com
    - ddns.net
    - dl.dropboxusercontent.com
    - duckdns.org
    - ghostbin.co
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.nz
    - ngrok.io
    - onrender.com
    - pages.dev
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pasteio.com
    - pastetext.net
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - textbin
    - transfer.sh
    - trycloudflare.com
    - ufile.io
    - w3spaces.com
    - workers.dev
  condition: selection_0 and selection_1
