title: Windows Non-System Process Querying Definition Update
id: 9d375cfd-c9a5-48ff-b875-9bcaf6b63265
status: stable
level: medium
author: Raven Tait, Splunk
description: Detects DNS queries to definitionupdates.microsoft.com or the go.microsoft.com fwlink redirect used for WD update downloads, when the querying process is not a Windows system component. BlueHammer
  utilizes these definition updates as part of its exploit chain.
references:
- https://github.com/Nightmare-Eclipse/BlueHammer
tags:
- attack.t1068
- attack.t1071.001
date: '2026-04-27'
original_spl: |-
  `sysmon`
  EventID="22"
  QueryName="*definitionupdates.microsoft.com*"
  NOT Image IN (
      "*:\\Program Files\\Microsoft Office\\*",
      "*:\\Program Files\\Windows Defender\\*",
      "*:\\ProgramData\\Microsoft\\Windows Defender\\*",
      "*:\\Windows\\System32\\*",
      "*:\\Windows\\SysWOW64\\*"
  )
  | stats count min(_time) as firstTime max(_time) as lastTime BY answer answer_count dvc Computer process_exec process_guid process_name query query_count reply_code_id signature signature_id src user_id vendor_product QueryName QueryResults QueryStatus
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | rename Computer as dest
  | `windows_non_system_process_querying_definition_update_filter`
splunk_rule_id: 9d375cfd-c9a5-48ff-b875-9bcaf6b63265
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: '22'
  selection_1:
    QueryName|contains: definitionupdates.microsoft.com
  filter_2:
    Image:
    - '*:\Program Files\Microsoft Office\*'
    - '*:\Program Files\Windows Defender\*'
    - '*:\ProgramData\Microsoft\Windows Defender\*'
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWOW64\*'
  condition: (selection_0 and selection_1) and not (filter_2)
