title: Windows File Transfer Protocol In Non-Common Process Path
id: 0f43758f-1fe9-470a-a9e4-780acc4d5407
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects FTP connections initiated by processes located in non-standard installation paths on Windows systems. It leverages Sysmon EventCode 3 to identify network connections
  where the process image path does not match common directories like "Program Files" or "Windows\System32". This activity is significant as FTP is often used by adversaries and malware, such as AgentTesla,
  for Command and Control (C2) communications to exfiltrate stolen data. If confirmed malicious, this could lead to unauthorized data transfer, exposing sensitive information and compromising the integrity
  of the affected host.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.agent_tesla
tags:
- attack.t1071.003
date: '2022-09-21'
original_spl: |-
  `sysmon`
  EventCode=3
  NOT Image IN(
    "C:\\Program Files \(x86\)\\*",
    "C:\\Program Files\\*",
    "C:\\Windows\\System32\\*",
    "C:\\Windows\\SysWOW64\\*"
  )
  (
    DestinationPortName="ftp"
    OR
    DestinationPort=21
  )
  | stats count min(_time) as firstTime
          max(_time) as lastTime

  by action app dest dest_ip dest_port direction dvc protocol protocol_version
     src src_ip src_port transport user vendor_product process_name
     process_exec process_guid process_id
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_file_transfer_protocol_in_non_common_process_path_filter`
splunk_rule_id: 0f43758f-1fe9-470a-a9e4-780acc4d5407
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 3
  filter_1:
    Image:
    - C:\Program Files \(x86\)\*
    - C:\Program Files\*
    - C:\Windows\System32\*
    - C:\Windows\SysWOW64\*
  selection_2:
    DestinationPortName: ftp
  selection_3:
    DestinationPort: 21
  condition: (selection_0 and selection_2 and selection_3) and not (filter_1)
