title: Windows Suspicious C2 Named Pipe
id: 90599d85-dc2a-4d4c-8c59-9485c3665828
status: stable
level: medium
author: Raven Tait, Splunk
description: |
  The following analytic detects the creation or connection to known suspicious C2 named pipes.
  It leverages Sysmon EventCodes 17 and 18 to identify known default pipe names used by C2 tools.
  If confirmed malicious, this could allow an attacker to abuse these to potentially gain persistence, command and control, or further system compromise.
references:
- https://attack.mitre.org/techniques/T1218/009/
- https://docs.microsoft.com/en-us/windows/win32/ipc/named-pipes
tags:
- attack.t1559
- attack.t1021.002
- attack.t1055
date: '2025-12-08'
original_spl: |-
  `sysmon`
  (EventCode=17 OR EventCode=18)
  NOT process_path IN (
    "*:\\Program Files \(x86\)\\Adobe*",
    "*:\\Program Files \(x86\)\\Google*",
    "*:\\Program Files \(x86\)\\Microsoft*",
    "*:\\Program Files\\Adobe*",
    "*:\\Program Files\\Google*",
    "*:\\Program Files\\Microsoft*",
    "*:\\Windows\\system32\\SearchIndexer.exe",
    "*:\\Windows\\System32\\svchost.exe",
    "*:\\Windows\\SystemApps\\Microsoft*",
    "*\\Amazon\\SSM\\Instance*",
    "*\\AppData\\Local\\Google*",
    "*\\AppData\\Local\\Kingsoft\\*",
    "*\\AppData\\Local\\Microsoft*",
    "System"
  )

  | stats  min(_time) as firstTime max(_time) as lastTime
  count by dest dvc process_exec process_guid process_id process_path signature signature_id
  vendor_product pipe_name user_id Image process_name

  | lookup suspicious_c2_named_pipes suspicious_pipe_name AS pipe_name OUTPUT tool, description
  | where isnotnull(tool)
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_suspicious_c2_named_pipe_filter`
splunk_rule_id: 90599d85-dc2a-4d4c-8c59-9485c3665828
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 17
  selection_1:
    EventID: 18
  filter_2:
    process_path:
    - '*:\Program Files \(x86\)\Adobe*'
    - '*:\Program Files \(x86\)\Google*'
    - '*:\Program Files \(x86\)\Microsoft*'
    - '*:\Program Files\Adobe*'
    - '*:\Program Files\Google*'
    - '*:\Program Files\Microsoft*'
    - '*:\Windows\system32\SearchIndexer.exe'
    - '*:\Windows\System32\svchost.exe'
    - '*:\Windows\SystemApps\Microsoft*'
    - '*\Amazon\SSM\Instance*'
    - '*\AppData\Local\Google*'
    - '*\AppData\Local\Kingsoft\*'
    - '*\AppData\Local\Microsoft*'
    - System
  condition: (selection_0 and selection_1) and not (filter_2)
