title: Windows Hunting System Account Targeting Lsass
id: 1c6abb08-73d1-11ec-9ca0-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies processes attempting to access Lsass.exe, which may indicate credential dumping or applications needing credential access. It leverages Sysmon EventCode 10
  to detect such activities by analyzing fields like TargetImage, GrantedAccess, and SourceImage. This behavior is significant as unauthorized access to Lsass.exe can lead to credential theft, posing a
  severe security risk. If confirmed malicious, attackers could gain access to sensitive credentials, potentially leading to privilege escalation and further compromise of the environment.
references:
- https://en.wikipedia.org/wiki/Local_Security_Authority_Subsystem_Service
- https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://raw.githubusercontent.com/PowerShellMafia/PowerSploit/master/Exfiltration/Invoke-Mimikatz.ps1
- https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights?redirectedfrom=MSDN
tags:
- attack.t1003.001
date: '2022-01-11'
original_spl: |-
  `sysmon` EventCode=10 TargetImage=*lsass.exe
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY CallTrace EventID GrantedAccess
         Guid Opcode ProcessID
         SecurityID SourceImage SourceProcessGUID
         SourceProcessId TargetImage TargetProcessGUID
         TargetProcessId UserID dest
         granted_access parent_process_exec parent_process_guid
         parent_process_id parent_process_name parent_process_path
         process_exec process_guid process_id
         process_name process_path signature
         signature_id user_id vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_hunting_system_account_targeting_lsass_filter`
splunk_rule_id: 1c6abb08-73d1-11ec-9ca0-acde48001122
splunk_rule_type: Hunting
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|endswith: lsass.exe
  condition: selection_0 and selection_1
