title: Windows Process Injection Remote Thread
id: 8a618ade-ca8f-4d04-b972-2d526ba59924
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects suspicious remote thread execution in processes such as Taskmgr.exe, calc.exe, and notepad.exe, which may indicate process injection by malware like Qakbot. This detection leverages Sysmon EventCode 8 to identify remote thread creation in specific target processes. This activity is significant as it often signifies an attempt by malware to inject malicious code into legitimate processes, potentially leading to unauthorized code execution. If confirmed malicious, this could allow attackers to execute arbitrary code, escalate privileges, or maintain persistence on the compromised host.
references:
- https://twitter.com/pr0xylife/status/1585612370441031680?s=46&t=Dc3CJi4AnM-8rNoacLbScg
- https://thedfirreport.com/2023/06/12/a-truly-graceful-wipe-out/
tags:
- attack.t1055.002
date: '2022-10-28'
original_spl: |-
  `sysmon`
  EventCode=8
  TargetImage IN (
      "*\\calc.exe",
      "*\\CalculatorApp.exe",
      "*\\cmd.exe",
      "*\\dxdiag.exe",
      "*\\explorer.exe",
      "*\\mobsync.exe",
      "*\\msra.exe",
      "*\\notepad.exe",
      "*\\OneDriveSetup.exe",
      "*\\ping.exe",
      "*\\powershell.exe",
      "*\\rdpclip.exe",
      "*\\Taskmgr.exe",
      "*\\wermgr.exe",
      "*\\win32calc.exe",
      "*\\xwizard.exe"
  )
  | stats count min(_time) as firstTime
                max(_time) as lastTime
                values(NewThreadId) as "NewThreadId"
                values(StartAddress) as "StartAddress"
    by dest signature_id signature
       SourceProcessGuid SourceProcessId SourceImage
       TargetProcessGuid TargetProcessId TargetImage
       StartModule StartFunction vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_process_injection_remote_thread_filter`
splunk_rule_id: 8a618ade-ca8f-4d04-b972-2d526ba59924
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 8
  selection_1:
    TargetImage|endswith:
    - \calc.exe
    - \CalculatorApp.exe
    - \cmd.exe
    - \dxdiag.exe
    - \explorer.exe
    - \mobsync.exe
    - \msra.exe
    - \notepad.exe
    - \OneDriveSetup.exe
    - \ping.exe
    - \powershell.exe
    - \rdpclip.exe
    - \Taskmgr.exe
    - \wermgr.exe
    - \win32calc.exe
    - \xwizard.exe
  condition: selection_0 and selection_1
