title: Windows ConsoleHost History File Deletion
id: a203040e-f8fd-49bb-8424-d2fabf277322
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the deletion of the ConsoleHost_history.txt file, which stores command history for PowerShell sessions. Attackers may attempt to remove this file to cover their
  tracks and evade detection during post-exploitation activities. This detection focuses on file deletion commands executed via PowerShell, Command Prompt, or scripting languages that specifically target
  ConsoleHost_history.txt, typically located at %APPDATA%\Microsoft\Windows\PowerShell\PSReadline\ConsoleHost_history.txt. Identifying such activity can help uncover potential anti-forensic behavior and
  suspicious administrative actions.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-071a
tags:
- attack.t1070.003
date: '2025-03-19'
original_spl: '`sysmon` EventCode IN ("23","26") TargetFilename = "*\\Microsoft\\Windows\\PowerShell\\PSReadline\\ConsoleHost_history.txt" | stats count min(_time) as firstTime, max(_time) as lastTime by
  action dest dvc file_path file_hash file_name file_modify_time process_name process_exec process_id process_path user_id vendor_product process_guid signature signature_id user | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_consolehost_history_file_deletion_filter`'
splunk_rule_id: a203040e-f8fd-49bb-8424-d2fabf277322
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID:
    - '23'
    - '26'
  selection_1:
    TargetFilename|endswith: \Microsoft\Windows\PowerShell\PSReadline\ConsoleHost_history.txt
  condition: selection_0 and selection_1
