title: Windows Terminating Lsass Process
id: 7ab3c319-a4e7-4211-9e8c-40a049d0dba6
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a suspicious process attempting to terminate the Lsass.exe process. It leverages Sysmon EventCode 10 logs to identify processes granted PROCESS_TERMINATE access
  to Lsass.exe. This activity is significant because Lsass.exe is a critical process responsible for enforcing security policies and handling user credentials. If confirmed malicious, this behavior could
  indicate an attempt to perform credential dumping, privilege escalation, or evasion of security policies, potentially leading to unauthorized access and persistence within the environment.
references:
- https://blog.talosintelligence.com/2022/03/threat-advisory-doublezero.html
tags:
- attack.t1685
date: '2022-03-28'
original_spl: |-
  `sysmon` EventCode=10 TargetImage=*lsass.exe GrantedAccess = 0x1
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY CallTrace EventID GrantedAccess
         Guid Opcode ProcessID
         SecurityID SourceImage SourceProcessGUID
         SourceProcessId TargetImage TargetProcessGUID
         TargetProcessId UserID dest
         granted_access parent_process_exec parent_process_guid
         parent_process_id parent_process_name parent_process_path
         process_exec process_guid process_id
         process_name process_path signature
         signature_id user_id vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_terminating_lsass_process_filter`
splunk_rule_id: 7ab3c319-a4e7-4211-9e8c-40a049d0dba6
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|endswith: lsass.exe
  selection_2:
    GrantedAccess: '0x1'
  condition: selection_0 and selection_1 and selection_2
