title: Windows Uncommon Remote Thread Creation In Browser Process
id: 634cce27-a3a6-4079-b0d6-3ced361a0aa9
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: |-
  The following analytic identifies the creation of a remote thread by a process such as wermgr.exe or rundll32.exe into a browser process such as firefox.exe, chrome.exe, and others.
  These processes do not typically create remote threads, in browser processes.
  It leverages Sysmon EventID 8 to detect this behavior by monitoring SourceImage and TargetImage fields.
  This activity is significant because it is commonly associated with malware like Qakbot and IcedID, which injects malicious code into legitimate processes to steal information.
  If confirmed malicious, this activity could allow attackers to execute arbitrary code, escalate privileges, and exfiltrate sensitive data from the compromised host.
references:
- https://news.sophos.com/en-us/2022/03/10/qakbot-decoded/
- https://www.trellix.com/en-us/about/newsroom/stories/research/demystifying-qbot-malware.html
- https://www.joesandbox.com/analysis/380662/0/html
tags:
- attack.t1055.001
date: '2026-06-29'
original_spl: |-
  `sysmon`
  EventCode=8
  SourceImage IN (
      "*\\rundll32.exe",
      "*\\wermgr.exe"
  )
  TargetImage IN (
      "*\\Sputnik.exe",
      "*\\ChromePlus.exe",
      "*\\QIP Surf.exe",
      "*\\BlackHawk.exe",
      "*\\7Star.exe",
      "*\\Sleipnir5.exe",
      "*\\Citrio.exe",
      "*\\Chrome SxS.exe",
      "*\\Chrome.exe",
      "*\\Coowon.exe",
      "*\\CocCocBrowser.exe",
      "*\\Uran.exe",
      "*\\QQBrowser.exe",
      "*\\Orbitum.exe",
      "*\\Slimjet.exe",
      "*\\Iridium.exe",
      "*\\Vivaldi.exe",
      "*\\Chromium.exe",
      "*\\GhostBrowser.exe",
      "*\\CentBrowser.exe",
      "*\\Xvast.exe",
      "*\\Chedot.exe",
      "*\\SuperBird.exe",
      "*\\360Browser.exe",
      "*\\360Chrome.exe",
      "*\\dragon.exe",
      "*\\brave.exe",
      "*\\torch.exe",
      "*\\UCBrowser.exe",
      "*\\BliskBrowser.exe",
      "*\\Epic Privacy Browser.exe",
      "*\\nichrome.exe",
      "*\\AmigoBrowser.exe",
      "*\\KometaBrowser.exe",
      "*\\XpomBrowser.exe",
      "*\\msedge.exe",
      "*\\LiebaoBrowser.exe",
      "*\\AvastBrowser.exe",
      "*\\Kinza.exe",
      "*\\seamonkey.exe",
      "*\\icedragon.exe",
      "*\\cyberfox.exe",
      "*\\SlimBrowser.exe",
      "*\\palemoon.exe",
      "*\\opera.exe",
      "*\\yandex.exe",
      "*\\atom.exe",
      "*\\Chromodo.exe",
      "*\\360chrome.exe",
      "*\\360se.exe",
      "*\\Maxthon.exe",
      "*\\k-meleon.exe",
      "*\\SLBrowser.exe",
      "*\\Go!.exe",
      "*\\Secure Browser.exe",
      "*\\Elements Browser.exe",
      "*\\Mustang.exe",
      "*\\Suhba.exe",
      "*\\TorBro.exe",
      "*\\RockMelt.exe",
      "*\\Bromium.exe",
      "*\\Twinkstar.exe",
      "*\\iTop Private Browser.exe",
      "*\\CCleaner Browser.exe",
      "*\\AcWebBrowser.exe",
      "*\\CoolNovo.exe",
      "*\\spark.exe",
      "*\\iron.exe",
      "*\\Titan Browser.exe",
      "*\\AVG Browser.exe",
      "*\\UR Browser.exe",
      "*\\Flock.exe",
      "*\\CryptoTab Browser.exe",
      "*\\Sidekick.exe",
      "*\\SwingBrowser.exe",
      "*\\SalamWeb.exe",
      "*\\NetboxBrowser.exe",
      "*\\GarenaPlus.exe",
      "*\\InsomniacBrowser.exe",
      "*\\Viasat Browser.exe",
      "*\\whale.exe",
      "*\\falkon.exe",
      "*\\SogouExplorer.exe",
      "*\\firefox.exe",
      "*\\waterfox.exe",
      "*\\thunderbird.exe",
      "*\\basilisk.exe",
      "*\\BitTubeBrowser.exe"
  )
  | stats count min(_time) as firstTime
                max(_time) as lastTime
                values(NewThreadId) as "NewThreadId"
                values(StartAddress) as "StartAddress"
    by dest signature_id signature
       SourceProcessGuid SourceProcessId SourceImage
       TargetProcessGuid TargetProcessId TargetImage
       StartModule StartFunction vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_uncommon_remote_thread_creation_in_browser_process_filter`
splunk_rule_id: 634cce27-a3a6-4079-b0d6-3ced361a0aa9
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 8
  selection_1:
    SourceImage|endswith:
    - \rundll32.exe
    - \wermgr.exe
  selection_2:
    TargetImage|endswith:
    - \Sputnik.exe
    - \ChromePlus.exe
    - \QIP Surf.exe
    - \BlackHawk.exe
    - \7Star.exe
    - \Sleipnir5.exe
    - \Citrio.exe
    - \Chrome SxS.exe
    - \Chrome.exe
    - \Coowon.exe
    - \CocCocBrowser.exe
    - \Uran.exe
    - \QQBrowser.exe
    - \Orbitum.exe
    - \Slimjet.exe
    - \Iridium.exe
    - \Vivaldi.exe
    - \Chromium.exe
    - \GhostBrowser.exe
    - \CentBrowser.exe
    - \Xvast.exe
    - \Chedot.exe
    - \SuperBird.exe
    - \360Browser.exe
    - \360Chrome.exe
    - \dragon.exe
    - \brave.exe
    - \torch.exe
    - \UCBrowser.exe
    - \BliskBrowser.exe
    - \Epic Privacy Browser.exe
    - \nichrome.exe
    - \AmigoBrowser.exe
    - \KometaBrowser.exe
    - \XpomBrowser.exe
    - \msedge.exe
    - \LiebaoBrowser.exe
    - \AvastBrowser.exe
    - \Kinza.exe
    - \seamonkey.exe
    - \icedragon.exe
    - \cyberfox.exe
    - \SlimBrowser.exe
    - \palemoon.exe
    - \opera.exe
    - \yandex.exe
    - \atom.exe
    - \Chromodo.exe
    - \360chrome.exe
    - \360se.exe
    - \Maxthon.exe
    - \k-meleon.exe
    - \SLBrowser.exe
    - \Go!.exe
    - \Secure Browser.exe
    - \Elements Browser.exe
    - \Mustang.exe
    - \Suhba.exe
    - \TorBro.exe
    - \RockMelt.exe
    - \Bromium.exe
    - \Twinkstar.exe
    - \iTop Private Browser.exe
    - \CCleaner Browser.exe
    - \AcWebBrowser.exe
    - \CoolNovo.exe
    - \spark.exe
    - \iron.exe
    - \Titan Browser.exe
    - \AVG Browser.exe
    - \UR Browser.exe
    - \Flock.exe
    - \CryptoTab Browser.exe
    - \Sidekick.exe
    - \SwingBrowser.exe
    - \SalamWeb.exe
    - \NetboxBrowser.exe
    - \GarenaPlus.exe
    - \InsomniacBrowser.exe
    - \Viasat Browser.exe
    - \whale.exe
    - \falkon.exe
    - \SogouExplorer.exe
    - \firefox.exe
    - \waterfox.exe
    - \thunderbird.exe
    - \basilisk.exe
    - \BitTubeBrowser.exe
  condition: selection_0 and selection_1 and selection_2
