title: Windows Unusual Process Load Mozilla NSS-Mozglue Module
id: 1a7e7650-b81d-492e-99d4-d5ab633afbdd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies processes loading Mozilla NSS-Mozglue libraries such as mozglue.dll and nss3.dll. It leverages Sysmon Event logs, specifically monitoring EventCode 7, which
  tracks image loaded events. This activity is significant because it can indicate unauthorized access or manipulation of these libraries, which are commonly used by Mozilla applications like Firefox and
  Thunderbird. If confirmed malicious, this could lead to data exfiltration, credential theft, or further compromise of the system.
references:
- https://www.trendmicro.com/vinfo/nz/threat-encyclopedia/malware/trojanspy.win32.vidar.yxdftz
tags:
- attack.t1218.003
date: '2021-05-13'
original_spl: '`sysmon` EventCode=7  ImageLoaded IN ("*\\mozglue.dll", "*\\nss3.dll") NOT(process_path IN("*:\\Program Files\Mozilla Firefox\\firefox.exe", "*:\\Program Files (x86)\Mozilla Firefox\\firefox.exe",
  "*:\\Program Files\\Mozilla Thunderbird\\thunderbird.exe", "*:\\Program Files (x86)\\Mozilla Thunderbird\\thunderbird.exe", "*\\Tor Browser\\Browser\\firefox.exe","*:\\Program Files\\Code42\\CrashPlan\\Code42Service.exe",
  "*:\\Program Files (x86)\\Code42\\CrashPlan\\Code42Service.exe", "*:\\Program Files\\Pale Moon\\palemoon.exe", "*:\\Program Files (x86)\\Pale Moon\\palemoon.exe", "*:\\Program Files\\Waterfox\\waterfox.exe","*:\\Program
  Files (x86)\\Waterfox\\waterfox.exe", "*:\\Program Files\\Cyberfox\cyberfox.exe", "*:\\Program Files (x86)\\Cyberfox\\cyberfox.exe", "*\\AppData\\Local\\slack\\slack.exe", "*:\\Program Files (x86)\\VMware\\VMware
  Horizon View Client\\vmware-view.exe", "*:\\Program Files (x86)\\Dropbox\\Client\\Dropbox.exe", "*:\\Program Files\\Google\\Google Earth Pro\\client\\googleearth.exe")) | fillnull | stats count min(_time)
  as firstTime max(_time) as lastTime by Image ImageLoaded dest loaded_file loaded_file_path original_file_name process_exec process_guid process_hash process_id process_name process_path service_dll_signature_exists
  service_dll_signature_verified signature signature_id user_id vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_unusual_process_load_mozilla_nss_mozglue_module_filter`'
splunk_rule_id: 1a7e7650-b81d-492e-99d4-d5ab633afbdd
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|endswith:
    - \mozglue.dll
    - \nss3.dll
  filter_2:
    process_path:
    - '*:\Program Files\Mozilla Firefox\firefox.exe'
    - '*:\Program Files (x86)\Mozilla Firefox\firefox.exe'
    - '*:\Program Files\Mozilla Thunderbird\thunderbird.exe'
    - '*:\Program Files (x86)\Mozilla Thunderbird\thunderbird.exe'
    - '*\Tor Browser\Browser\firefox.exe'
    - '*:\Program Files\Code42\CrashPlan\Code42Service.exe'
    - '*:\Program Files (x86)\Code42\CrashPlan\Code42Service.exe'
    - '*:\Program Files\Pale Moon\palemoon.exe'
    - '*:\Program Files (x86)\Pale Moon\palemoon.exe'
    - '*:\Program Files\Waterfox\waterfox.exe'
    - '*:\Program Files (x86)\Waterfox\waterfox.exe'
    - '*:\Program Files\Cyberfox\cyberfox.exe'
    - '*:\Program Files (x86)\Cyberfox\cyberfox.exe'
    - '*\AppData\Local\slack\slack.exe'
    - '*:\Program Files (x86)\VMware\VMware Horizon View Client\vmware-view.exe'
    - '*:\Program Files (x86)\Dropbox\Client\Dropbox.exe'
    - '*:\Program Files\Google\Google Earth Pro\client\googleearth.exe'
  condition: (selection_0 and selection_1) and not (filter_2)
