title: Windows Gather Victim Identity SAM Info
id: a18e85d7-8b98-4399-820c-d46a1ca3516f
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects processes loading the samlib.dll or samcli.dll modules, which are often abused to access Security Account Manager (SAM) objects or credentials on domain controllers.
  This detection leverages Sysmon EventCode 7 to identify these DLLs being loaded outside typical system directories. Monitoring this activity is crucial as it may indicate attempts to gather sensitive
  identity information. If confirmed malicious, this behavior could allow attackers to obtain credentials, escalate privileges, or further infiltrate the network.
references:
- https://redcanary.com/blog/active-breach-evading-defenses/
- https://strontic.github.io/xcyclopedia/library/samlib.dll-0BDF6351009F6EBA5BA7E886F23263B1.html
tags:
- attack.t1589.001
date: '2022-08-31'
original_spl: '`sysmon` EventCode=7  (ImageLoaded = "*\\samlib.dll" AND OriginalFileName = "samlib.dll") OR (ImageLoaded = "*\\samcli.dll" AND OriginalFileName = "SAMCLI.DLL") AND NOT (Image IN("C:\\Windows\\*",
  "C:\\Program File*", "%systemroot%\\*")) | fillnull | stats count min(_time) as firstTime max(_time) as lastTime by Image ImageLoaded dest loaded_file loaded_file_path original_file_name process_exec
  process_guid process_hash process_id process_name process_path service_dll_signature_exists service_dll_signature_verified signature signature_id user_id vendor_product | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_gather_victim_identity_sam_info_filter`'
splunk_rule_id: a18e85d7-8b98-4399-820c-d46a1ca3516f
splunk_rule_type: Hunting
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
    ImageLoaded|endswith: '*\samlib.dll'
    OriginalFileName: samlib.dll
  selection_1:
    ImageLoaded|endswith: '*\samcli.dll'
    OriginalFileName: SAMCLI.DLL
    Image:
    - C:\Windows\*
    - C:\Program File*
    - '%systemroot%\*'
  condition: selection_0 and selection_1
