title: Windows Wermgr Alternate Data Stream in Temp Dir
id: 65222e9b-9d0b-4bfe-8da1-199b98e1d44a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the wermgr.exe process creating an alternate stream in the temp directory. It leverages Sysmon EventID 15 to identify these actions.
  This activity is significant because wermgr.exe is typically associated with error reporting, not file creation. Such activity is significant as it may indicate RoguePlanet malware, which creates an alternate stream in the temp directory to execute malicious code.
  If confirmed malicious, this could lead to further malware infections, data exfiltration, or system compromise.
references:
- https://github.com/MSNightmare/RoguePlanet/tree/main
tags:
- attack.t1564.004
date: '2026-06-11'
original_spl: |-
  `sysmon`
  EventCode=15
  TargetFilename = "*\\Temp\\*"
  TargetFilename = "*\\wermgr.exe:*"

  | stats count min(_time) as firstTime
                max(_time) as lastTime
  by dest dvc file_hash file_name file_path process_exec
     process_guid process_id process_name process_path
     signature signature_id user_id vendor_product Contents Image

  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_wermgr_alternate_data_stream_in_temp_dir_filter`
splunk_rule_id: 65222e9b-9d0b-4bfe-8da1-199b98e1d44a
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 15
  selection_1:
    TargetFilename|contains: \Temp\
  selection_2:
    TargetFilename|contains: '\wermgr.exe:'
  condition: selection_0 and selection_1 and selection_2
