title: Windows Executable Masquerading as Benign File Types
id: 0470c8e7-dd8d-420f-8302-073e8a2b66f0
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects the presence of executable files masquerading as benign file types on Windows systems. Adversaries employ this technique to evade defenses and trick users into executing malicious code by renaming executables with extensions commonly associated with documents, images, or other non-executable formats (e.g., .pdf, .jpg, .doc, .png).
references:
- https://www.linkedin.com/posts/mauricefielenbach_cybersecurity-incidentresponse-dfir-activity-7394805779448418304-g0gZ?utm_source=share&utm_medium=member_desktop&rcm=ACoAAAuFTjIB5weY_kcyu4qp3kHbI4v49tO0zEk
- https://www.blackhillsinfosec.com/a-sysmon-event-id-breakdown/
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://www.esentire.com/blog/evalusion-campaign-delivers-amatera-stealer-and-netsupport-rat
tags:
- attack.t1036.008
date: '2025-11-21'
original_spl: |-
  `sysmon`
  EventCode=29
  NOT `executable_extensions`
  | stats count min(_time) as firstTime max(_time) as lastTime
    by Image file_name file_path process_guid file_hash process_id dest user EventCode
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_executable_masquerading_as_benign_file_types_filter`
splunk_rule_id: 0470c8e7-dd8d-420f-8302-073e8a2b66f0
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 29
  condition: selection_0
