title: Windows NetSupport RMM DLL Loaded By Uncommon Process
id: 125f96f9-6f34-418b-b868-c4a8d7fb865f
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects the loading of specific dynamic-link libraries (DLLs) associated with the NetSupport Remote Manager (RMM) tool by any process on a Windows system.
  Modules such as CryptPak.dll, HTCTL32.DLL, IPCTL32.DLL, keyshowhook.dll, pcicapi.DLL, PCICL32.DLL, and TCCTL32.DLL, are integral to NetSupport's functionality.
  This detection is particularly valuable when these modules are loaded by processes running from unusual directories (e.g., Downloads, ProgramData, or user-specific folders) rather than the legitimate Program Files installation path, or by executables that have been renamed but retain the internal "client32" identifier.
  This helps to identify instances where the legitimate NetSupport tool is being misused by adversaries as a Remote Access Trojan (RAT).
references:
- https://www.linkedin.com/posts/mauricefielenbach_cybersecurity-incidentresponse-dfir-activity-7394805779448418304-g0gZ?utm_source=share&utm_medium=member_desktop&rcm=ACoAAAuFTjIB5weY_kcyu4qp3kHbI4v49tO0zEk
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://www.esentire.com/blog/evalusion-campaign-delivers-amatera-stealer-and-netsupport-rat
tags:
- attack.t1036
date: '2025-11-21'
original_spl: |-
  `sysmon`
  EventCode=7
  ImageLoaded IN (
    "*\\CryptPak.dll",
    "*\\HTCTL32.DLL",
    "*\\pcicapi.dll",
    "*\\pcichek.dll",
    "*\\PCICL32.DLL",
    "*\\TCCTL32.DLL"
  )
  NOT Image IN ("C:\\Program Files\\*", "C:\\Program Files (x86)\\*")
  Signature = "NetSupport Ltd*"
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    by Image ImageLoaded dest loaded_file loaded_file_path original_file_name process_exec
       process_guid process_hash process_id process_name process_path service_dll_signature_exists
       service_dll_signature_verified signature signature_id user_id vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_netsupport_rmm_dll_loaded_by_uncommon_process_filter`
splunk_rule_id: 125f96f9-6f34-418b-b868-c4a8d7fb865f
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|endswith:
    - \CryptPak.dll
    - \HTCTL32.DLL
    - \pcicapi.dll
    - \pcichek.dll
    - \PCICL32.DLL
    - \TCCTL32.DLL
  filter_2:
    Image:
    - C:\Program Files\*
    - C:\Program Files (x86)\*
  selection_3:
    Signature|startswith: NetSupport Ltd
  condition: (selection_0 and selection_1 and selection_3) and not (filter_2)
