title: Windows Office Product Loaded MSHTML Module
id: 4cc015c9-687c-40d2-adcc-46350f66e10c
status: stable
level: medium
author: Michael Haag, Mauricio Velazco, Splunk
description: The following analytic detects the loading of the mshtml.dll module into an Office product, which is indicative of CVE-2021-40444 exploitation. It leverages Sysmon EventID 7 to monitor image
  loads by specific Office processes. This activity is significant because it can indicate an attempt to exploit a vulnerability in the MSHTML component via a malicious document. If confirmed malicious,
  this could allow an attacker to execute arbitrary code, potentially leading to system compromise, data exfiltration, or further network penetration.
references:
- https://app.any.run/tasks/36c14029-9df8-439c-bba0-45f2643b0c70/
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444
- https://strontic.github.io/xcyclopedia/index-dll
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
tags:
- attack.t1566.001
date: '2021-09-09'
original_spl: '`sysmon` EventID=7 process_name IN ("EQNEDT32.exe", "excel.exe", "Graph.exe", "msaccess.exe", "mspub.exe", "onenote.exe", "onenoteim.exe", "onenotem.exe", "outlook.exe", "powerpnt.exe", "visio.exe",
  "winproj.exe", "winword.exe", "wordpad.exe", "wordview.exe") loaded_file_path IN ("*\\mshtml.dll", "*\\Microsoft.mshtml.dll","*\\IE.Interop.MSHTML.dll","*\\MshtmlDac.dll","*\\MshtmlDed.dll","*\\MshtmlDer.dll")
  | fillnull | stats count min(_time) as firstTime max(_time) as lastTime by Image ImageLoaded dest loaded_file loaded_file_path original_file_name process_exec process_guid process_hash process_id process_name
  process_path service_dll_signature_exists service_dll_signature_verified signature signature_id user_id vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_office_product_loaded_mshtml_module_filter`'
splunk_rule_id: 4cc015c9-687c-40d2-adcc-46350f66e10c
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    process_name:
    - EQNEDT32.exe
    - excel.exe
    - Graph.exe
    - msaccess.exe
    - mspub.exe
    - onenote.exe
    - onenoteim.exe
    - onenotem.exe
    - outlook.exe
    - powerpnt.exe
    - visio.exe
    - winproj.exe
    - winword.exe
    - wordpad.exe
    - wordview.exe
  selection_2:
    loaded_file_path|endswith:
    - \mshtml.dll
    - \Microsoft.mshtml.dll
    - \IE.Interop.MSHTML.dll
    - \MshtmlDac.dll
    - \MshtmlDed.dll
    - \MshtmlDer.dll
  condition: selection_0 and selection_1 and selection_2
