title: Windows MsMpEng Writing to System32
id: dc615235-1241-411a-b170-b34a4c8924aa
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects MsMpEng.exe creating a file in C:\\Windows\\System32\\.
  This should never happen under normal operation Windows Defender does not install kernel drivers at runtime.
  In the BlueHammer exploit, the TOCTOU race causes MsMpEng (SYSTEM) to write the attacker's driver payload directly into the drivers directory.
references:
- https://github.com/Nightmare-Eclipse/BlueHammer
tags:
- attack.t1068
- attack.t1543.003
date: '2026-04-27'
original_spl: |-
  `sysmon`
  (EventID=15 OR EventID=11)
  Image="*\\MsMpEng.exe"
  TargetFilename="*:\\Windows\\System32\\*"
  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by Computer Image TargetFilename EventID dest dvc
       file_hash file_name file_path action process_exec
       process_guid process_id process_name process_path
       signature signature_id user_id vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_msmpeng_writing_to_system32_filter`
splunk_rule_id: dc615235-1241-411a-b170-b34a4c8924aa
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 15
  selection_1:
    EventID: 11
  selection_2:
    Image|endswith: \MsMpEng.exe
  selection_3:
    TargetFilename|contains: :\Windows\System32\
  condition: selection_0 and selection_1 and selection_2 and selection_3
