title: Windows Process Injection Of Wermgr to Known Browser
id: aec755a5-3a2c-4be0-ab34-6540e68644e9
status: deprecated
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the suspicious remote thread execution of the wermgr.exe process into known browsers such as firefox.exe, chrome.exe, and others. It leverages Sysmon EventCode
  8 logs to detect this behavior by monitoring SourceImage and TargetImage fields. This activity is significant because it is indicative of Qakbot malware, which injects malicious code into legitimate processes
  to steal information. If confirmed malicious, this activity could allow attackers to execute arbitrary code, escalate privileges, and exfiltrate sensitive data from the compromised host.
references:
- https://news.sophos.com/en-us/2022/03/10/qakbot-decoded/
- https://www.trellix.com/en-us/about/newsroom/stories/research/demystifying-qbot-malware.html
tags:
- attack.t1055.001
date: '2022-10-28'
original_spl: |-
  `sysmon`
  EventCode=8
  SourceImage="*\\wermgr.exe"
  TargetImage IN ("*\\firefox.exe", "*\\chrome.exe", "*\\iexplore.exe","*\\microsoftedgecp.exe")
  | stats count min(_time) as firstTime
                max(_time) as lastTime
                values(NewThreadId) as "NewThreadId"
                values(StartAddress) as "StartAddress"
    by dest signature_id signature
       SourceProcessGuid SourceProcessId SourceImage
       TargetProcessGuid TargetProcessId TargetImage
       StartModule StartFunction
       SourceUser TargetUser vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_process_injection_of_wermgr_to_known_browser_filter`
splunk_rule_id: aec755a5-3a2c-4be0-ab34-6540e68644e9
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 8
  selection_1:
    SourceImage|endswith: \wermgr.exe
  selection_2:
    TargetImage|endswith:
    - \firefox.exe
    - \chrome.exe
    - \iexplore.exe
    - \microsoftedgecp.exe
  condition: selection_0 and selection_1 and selection_2
