title: Windows InstallUtil Credential Theft
id: ccfeddec-43ec-11ec-b494-acde48001122
status: stable
level: medium
author: Michael Haag, Mauricio Velazo, Splunk
description: The following analytic detects instances where the Windows InstallUtil.exe binary loads `vaultcli.dll` and `Samlib.dll`. This detection leverages Sysmon EventCode 7 to identify these specific
  DLL loads. This activity is significant because it can indicate an attempt to execute code that bypasses application control and captures credentials using tools like Mimikatz. If confirmed malicious,
  this behavior could allow an attacker to steal credentials, potentially leading to unauthorized access and further compromise of the system.
references:
- https://gist.github.com/xorrior/bbac3919ca2aef8d924bdf3b16cce3d0
tags:
- attack.t1218.004
date: '2021-11-12'
original_spl: '`sysmon` EventCode=7 process_name=installutil.exe loaded_file_path IN ("*\\samlib.dll", "*\\vaultcli.dll") | fillnull | stats count min(_time) as firstTime max(_time) as lastTime by Image
  ImageLoaded dest loaded_file loaded_file_path original_file_name process_exec process_guid process_hash process_id process_name process_path service_dll_signature_exists service_dll_signature_verified
  signature signature_id user_id vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_installutil_credential_theft_filter`'
splunk_rule_id: ccfeddec-43ec-11ec-b494-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    process_name: installutil.exe
  selection_2:
    loaded_file_path|endswith:
    - \samlib.dll
    - \vaultcli.dll
  condition: selection_0 and selection_1 and selection_2
