title: Windows Known GraphicalProton Loaded Modules
id: bf471c94-0324-4b19-a113-d02749b969bc
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the loading of DLL modules associated with the GraphicalProton backdoor implant, commonly used by SVR in targeted attacks. It leverages Sysmon EventCode 7 to
  identify specific DLLs loaded by processes. This activity is significant as it may indicate the presence of a sophisticated backdoor, warranting immediate investigation. If confirmed malicious, the attacker
  could gain persistent access to the compromised host, potentially leading to further exploitation and data exfiltration.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
tags:
- attack.t1574.001
date: '2024-01-10'
original_spl: '`sysmon` EventCode=7 ImageLoaded IN ("*\\AclNumsInvertHost.dll", "*\\ModeBitmapNumericAnimate.dll", "*\\UnregisterAncestorAppendAuto.dll", "*\\DeregisterSeekUsers.dll", "*\\ScrollbarHandleGet.dll",
  "*\\PerformanceCaptionApi.dll", "*\\WowIcmpRemoveReg.dll", "*\\BlendMonitorStringBuild.dll", "*\\HandleFrequencyAll.dll", "*\\HardSwapColor.dll", "*\\LengthInMemoryActivate.dll", "*\\ParametersNamesPopup.dll",
  "*\\ModeFolderSignMove.dll", "*\\ChildPaletteConnected.dll", "*\\AddressResourcesSpec.dll") | fillnull | stats count min(_time) as firstTime max(_time) as lastTime by Image ImageLoaded dest loaded_file
  loaded_file_path original_file_name process_exec process_guid process_hash process_id process_name process_path service_dll_signature_exists service_dll_signature_verified signature signature_id user_id
  vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_known_graphicalproton_loaded_modules_filter`'
splunk_rule_id: bf471c94-0324-4b19-a113-d02749b969bc
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|endswith:
    - \AclNumsInvertHost.dll
    - \ModeBitmapNumericAnimate.dll
    - \UnregisterAncestorAppendAuto.dll
    - \DeregisterSeekUsers.dll
    - \ScrollbarHandleGet.dll
    - \PerformanceCaptionApi.dll
    - \WowIcmpRemoveReg.dll
    - \BlendMonitorStringBuild.dll
    - \HandleFrequencyAll.dll
    - \HardSwapColor.dll
    - \LengthInMemoryActivate.dll
    - \ParametersNamesPopup.dll
    - \ModeFolderSignMove.dll
    - \ChildPaletteConnected.dll
    - \AddressResourcesSpec.dll
  condition: selection_0 and selection_1
