title: Windows Cloud Files Filter Log Created by Non-System Process
id: 2e0042b9-8a75-49ca-b3a2-948f04b752bf
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects a non-system process causing creation of CldFlt0.etl under C:\Windows\System32\LogFiles\CloudFiles\.
  This path is initialised by the CldFlt driver when a process calls CfRegisterSyncRoot() or CfConnectSyncRoot().
  In the RedSun exploit this is a side-effect of the DoCloudStuff() function that registers a fake sync provider to create the cloud-tagged bait file.
  Legitimate cloud providers (OneDrive etc.) register sync roots from SYSTEM-level service processes, not from user-context executables.
references:
- https://github.com/Nightmare-Eclipse/RedSun
- https://www.huntress.com/blog/nightmare-eclipse-intrusion
tags:
- attack.t1068
date: '2026-05-01'
original_spl: |-
  `sysmon`
  EventCode=11
  TargetFilename = "*\\Windows\\System32\\LogFiles\\CloudFiles\\*"
  NOT Image IN (
      "*:\\Windows\\System32*",
      "*:\\Windows\\SysWOW64*",
      "*:\\Program Files\\WindowsApps\\*"
  )
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by action dest file_name file_path Image process_guid
       process_id user_id vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_cloud_files_filter_log_created_by_non_system_process_filter`
splunk_rule_id: 2e0042b9-8a75-49ca-b3a2-948f04b752bf
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 11
  selection_1:
    TargetFilename|contains: \Windows\System32\LogFiles\CloudFiles\
  filter_2:
    Image:
    - '*:\Windows\System32*'
    - '*:\Windows\SysWOW64*'
    - '*:\Program Files\WindowsApps\*'
  condition: (selection_0 and selection_1) and not (filter_2)
