title: WMI Permanent Event Subscription - Sysmon
id: ad05aae6-3b2a-4f73-af97-57bd26cee3b9
status: stable
level: medium
author: Rico Valdez, Michael Haag, Splunk
description: The following analytic identifies the creation of WMI permanent event subscriptions, which can be used to establish persistence or perform privilege escalation. It leverages Sysmon data, specifically
  EventCodes 19, 20, and 21, to detect the creation of WMI EventFilters, EventConsumers, and FilterToConsumerBindings. This activity is significant as it may indicate an attacker setting up mechanisms to
  execute code with elevated SYSTEM privileges when specific events occur. If confirmed malicious, this could allow the attacker to maintain persistence, escalate privileges, and execute arbitrary code,
  posing a severe threat to the environment.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1546.003/T1546.003.md
- https://www.eideon.com/2018-03-02-THL03-WMIBackdoors/
- https://github.com/trustedsec/SysmonCommunityGuide/blob/master/chapters/WMI-events.md
- https://in.security/2019/04/03/an-intro-into-abusing-and-identifying-wmi-event-subscriptions-for-persistence/
tags:
- attack.t1546.003
date: '2020-04-29'
original_spl: |-
  `sysmon` EventCode=21
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest dvc object
         object_attrs object_category object_path
         signature signature_id src
         status user user_id
         vendor_product Consumer ConsumerNoQuotes
         Filter FilterNoQuotes
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `wmi_permanent_event_subscription___sysmon_filter`
splunk_rule_id: ad05aae6-3b2a-4f73-af97-57bd26cee3b9
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 21
  condition: selection_0
