title: XMRIG Driver Loaded
id: 90080fa6-a8df-11eb-91e4-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the installation of the XMRIG coinminer driver on a system. It identifies the loading of the `WinRing0x64.sys` driver, commonly associated with XMRIG, by analyzing
  Sysmon EventCode 6 logs for specific signatures and image loads. This activity is significant because XMRIG is an open-source CPU miner frequently exploited by adversaries to mine cryptocurrency illicitly.
  If confirmed malicious, this activity could lead to unauthorized resource consumption, degraded system performance, and potential financial loss due to unauthorized cryptocurrency mining.
references:
- https://www.trendmicro.com/vinfo/hk/threat-encyclopedia/malware/trojan.ps1.powtran.a/
tags:
- attack.t1543.003
date: '2021-05-07'
original_spl: '`sysmon` EventCode=6 Signature="Noriyuki MIYAZAKI" OR ImageLoaded= "*\\WinRing0x64.sys" |  stats  min(_time) as firstTime max(_time) as lastTime count by ImageLoaded dest dvc process_hash
  process_path signature signature_id user_id vendor_product | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `xmrig_driver_loaded_filter`'
splunk_rule_id: 90080fa6-a8df-11eb-91e4-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 6
    Signature: Noriyuki MIYAZAKI
  selection_1:
    ImageLoaded|endswith: \WinRing0x64.sys
  condition: selection_0 and selection_1
