title: Okta Authentication Failed During MFA Challenge
id: e2b99e7d-d956-411a-a120-2b14adfdde93
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies failed authentication attempts during the Multi-Factor Authentication (MFA) challenge in an Okta tenant. It uses the Authentication datamodel to detect specific
  failed events where the authentication signature is `user.authentication.auth_via_mfa`. This activity is significant as it may indicate an adversary attempting to authenticate with compromised credentials
  on an account with MFA enabled. If confirmed malicious, this could suggest an ongoing attempt to bypass MFA protections, potentially leading to unauthorized access and further compromise of the affected
  account.
references:
- https://sec.okta.com/everythingisyes
- https://splunkbase.splunk.com/app/6553
tags:
- attack.t1078.004
- attack.t1586.003
- attack.t1621
date: '2024-04-17'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime  values(Authentication.app) as app values(Authentication.reason) as reason values(Authentication.signature) as signature  values(Authentication.method) as method FROM datamodel=Authentication
    WHERE Authentication.signature=user.authentication.auth_via_mfa Authentication.action = failure
    BY _time Authentication.src Authentication.user
       Authentication.dest Authentication.action
  | `drop_dm_object_name("Authentication")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | iplocation src
  | `okta_authentication_failed_during_mfa_challenge_filter`
splunk_rule_id: e2b99e7d-d956-411a-a120-2b14adfdde93
splunk_rule_type: TTP
logsource:
  category: authentication
  product: okta
detection:
  selection_0:
    Authentication.signature: user.authentication.auth_via_mfa
  selection_1:
    EventType: failure
  condition: selection_0 and selection_1
