title: Okta Phishing Detection with FastPass Origin Check
id: f4ca0057-cbf3-44f8-82ea-4e330ee901d3
status: experimental
level: medium
author: Okta, Inc, Michael Haag, Splunk
description: The following analytic identifies failed user authentication attempts in Okta due to FastPass declining a phishing attempt. It leverages Okta logs, specifically looking for events where multi-factor
  authentication (MFA) fails with the reason "FastPass declined phishing attempt." This activity is significant as it indicates that attackers are targeting users with real-time phishing proxies, attempting
  to capture credentials. If confirmed malicious, this could lead to unauthorized access to user accounts, potentially compromising sensitive information and furthering lateral movement within the organization.
references:
- https://sec.okta.com/fastpassphishingdetection
tags:
- attack.t1078.001
- attack.t1556
date: '2024-04-17'
original_spl: |-
  `okta` eventType="user.authentication.auth_via_mfa" AND result="FAILURE" AND outcome.reason="FastPass declined phishing attempt"
    | stats count min(_time) as firstTime max(_time) as lastTime values(displayMessage)
      BY user eventType client.userAgent.rawUserAgent
         client.userAgent.browser outcome.reason
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `okta_phishing_detection_with_fastpass_origin_check_filter`
splunk_rule_id: f4ca0057-cbf3-44f8-82ea-4e330ee901d3
splunk_rule_type: TTP
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    eventType: user.authentication.auth_via_mfa
  selection_1:
    result: FAILURE
  selection_2:
    outcome.reason: FastPass declined phishing attempt
  condition: selection_0 and selection_1 and selection_2
