title: Okta IDP Lifecycle Modifications
id: e0be2c83-5526-4219-a14f-c3db2e763d15
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies modifications to Okta Identity Provider (IDP) lifecycle events, including creation, activation, deactivation, and deletion of IDP configurations. It uses OktaIm2
  logs ingested via the Splunk Add-on for Okta Identity Cloud. Monitoring these events is crucial for maintaining the integrity and security of authentication mechanisms. Unauthorized or anomalous changes
  could indicate potential security breaches or misconfigurations. If confirmed malicious, attackers could manipulate authentication processes, potentially gaining unauthorized access or disrupting identity
  management systems.
references:
- https://www.obsidiansecurity.com/blog/behind-the-breach-cross-tenant-impersonation-in-okta/
- https://splunkbase.splunk.com/app/6553
tags:
- attack.t1087.004
date: '2024-04-17'
original_spl: |-
  `okta` eventType IN ("system.idp.lifecycle.activate","system.idp.lifecycle.create","system.idp.lifecycle.delete","system.idp.lifecycle.deactivate")
    | stats count  min(_time) as firstTime max(_time) as lastTime values(target{}.id) as target_id values(target{}.type) as target_modified
      BY src dest src_user_id
         user user_agent command
         description
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `okta_idp_lifecycle_modifications_filter`
splunk_rule_id: e0be2c83-5526-4219-a14f-c3db2e763d15
splunk_rule_type: Anomaly
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    eventType:
    - system.idp.lifecycle.activate
    - system.idp.lifecycle.create
    - system.idp.lifecycle.delete
    - system.idp.lifecycle.deactivate
  condition: selection_0
