title: Okta New API Token Created
id: c3d22720-35d3-4da4-bd0a-740d37192bd4
status: stable
level: medium
author: Michael Haag, Mauricio Velazco, Splunk
description: The following analytic detects the creation of a new API token within an Okta tenant. It uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity Cloud to identify events where the
  `system.api_token.create` command is executed. This activity is significant because creating a new API token can indicate potential account takeover attempts or unauthorized access, allowing an adversary
  to maintain persistence. If confirmed malicious, this could enable attackers to execute API calls, access sensitive data, and perform administrative actions within the Okta environment.
references:
- https://developer.okta.com/docs/reference/api/event-types/?q=security.threat.detected
- https://splunkbase.splunk.com/app/6553
tags:
- attack.t1078.001
date: '2022-12-19'
original_spl: |-
  | tstats `security_content_summariesonly` count max(_time) as lastTime, min(_time) as firstTime FROM datamodel=Change
    WHERE All_Changes.action=created
      AND
      All_Changes.command=system.api_token.create
    BY _time span=5m All_Changes.user
       All_Changes.result All_Changes.command sourcetype
       All_Changes.src All_Changes.action All_Changes.object_category
       All_Changes.dest
  | `drop_dm_object_name("All_Changes")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `okta_new_api_token_created_filter`
splunk_rule_id: c3d22720-35d3-4da4-bd0a-740d37192bd4
splunk_rule_type: TTP
logsource:
  category: change
  product: okta
detection:
  selection_0:
    All_Changes.action: created
  selection_1:
    CommandLine: system.api_token.create
  condition: selection_0 and selection_1
