title: Okta Suspicious Activity Reported
id: bfc840f5-c9c6-454c-aa13-b46fd0bf1e79
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies when an associate reports a login attempt as suspicious via an email from Okta. It leverages Okta Identity Management logs, specifically the `user.account.report_suspicious_activity_by_enduser`
  event type. This activity is significant as it indicates potential unauthorized access attempts, warranting immediate investigation to prevent possible security breaches. If confirmed malicious, the attacker
  could gain unauthorized access to sensitive systems and data, leading to data theft, privilege escalation, or further compromise of the environment.
references:
- https://help.okta.com/en-us/Content/Topics/Security/suspicious-activity-reporting.htm
tags:
- attack.t1078.001
date: '2022-12-19'
original_spl: |-
  `okta` eventType=user.account.report_suspicious_activity_by_enduser
    | stats count min(_time) as firstTime max(_time) as lastTime values(displayMessage)
      BY user dest src
         eventType client.userAgent.rawUserAgent client.userAgent.browser
         client.geographicalContext.city client.geographicalContext.country
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `okta_suspicious_activity_reported_filter`
splunk_rule_id: bfc840f5-c9c6-454c-aa13-b46fd0bf1e79
splunk_rule_type: TTP
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    eventType: user.account.report_suspicious_activity_by_enduser
  condition: selection_0
