title: Okta New Device Enrolled on Account
id: bb27cbce-d4de-432c-932f-2e206e9130fb
status: stable
level: medium
author: Michael Haag, Mauricio Velazco, Splunk
description: The following analytic identifies when a new device is enrolled on an Okta account. It uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity Cloud to detect the creation of new
  device enrollments. This activity is significant as it may indicate a legitimate user setting up a new device or an adversary adding a device to maintain unauthorized access. If confirmed malicious, this
  could lead to potential account takeover, unauthorized access, and persistent control over the compromised Okta account. Monitoring this behavior is crucial for detecting and mitigating unauthorized access
  attempts.
references:
- https://attack.mitre.org/techniques/T1098/005/
- https://developer.okta.com/docs/reference/api/event-types/?q=device.enrollment.create
tags:
- attack.T1098_005
date: '2022-12-19'
logsource:
  category: process_creation
  product: okta
detection:
  selection_0:
    action: created
  selection_1:
    CommandLine: device.enrollment.create
  condition: selection_0 and selection_1
