title: Okta New API Token Created
id: c3d22720-35d3-4da4-bd0a-740d37192bd4
status: stable
level: medium
author: Michael Haag, Mauricio Velazco, Splunk
description: The following analytic detects the creation of a new API token within an Okta tenant. It uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity Cloud to identify events where the
  `system.api_token.create` command is executed. This activity is significant because creating a new API token can indicate potential account takeover attempts or unauthorized access, allowing an adversary
  to maintain persistence. If confirmed malicious, this could enable attackers to execute API calls, access sensitive data, and perform administrative actions within the Okta environment.
references:
- https://developer.okta.com/docs/reference/api/event-types/?q=security.threat.detected
- https://splunkbase.splunk.com/app/6553
tags:
- attack.T1078_001
date: '2022-12-19'
logsource:
  category: process_creation
  product: okta
detection:
  selection_0:
    action: created
  selection_1:
    CommandLine: system.api_token.create
  condition: selection_0 and selection_1
