title: Okta MFA Exhaustion Hunt
id: 97e2fe57-3740-402c-988a-76b64ce04b8d
status: stable
level: medium
author: Michael Haag, Marissa Bower, Mauricio Velazco, Splunk
description: The following analytic detects patterns of successful and failed Okta MFA push attempts to identify potential MFA exhaustion attacks. It leverages Okta event logs, specifically focusing on
  push verification events, and uses statistical evaluations to determine suspicious activity. This activity is significant as it may indicate an attacker attempting to bypass MFA by overwhelming the user
  with push notifications. If confirmed malicious, this could lead to unauthorized access, compromising the security of the affected accounts and potentially the entire environment.
references:
- https://developer.okta.com/docs/reference/api/event-types/?q=user.acount.lock
- https://sec.okta.com/everythingisyes
- https://splunkbase.splunk.com/app/6553
tags:
- attack.T1110
date: '2022-12-19'
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    eventType: system.push.send_factor_verify_push
  selection_1:
    legacyEventType: core.user.factor.attempt_success
  selection_2:
    legacyEventType: core.user.factor.attempt_fail
  condition: selection_0 and selection_1 and selection_2
