title: Okta Multiple Failed MFA Requests For User
id: 826dbaae-a1e6-4c8c-b384-d16898956e73
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies multiple failed multi-factor authentication (MFA) requests for a single user within an Okta tenant. It triggers when more than 10 MFA attempts fail within
  5 minutes, using Okta event logs to detect this pattern. This activity is significant as it may indicate an adversary attempting to bypass MFA by bombarding the user with repeated authentication requests,
  a technique used by threat actors like Lapsus and APT29. If confirmed malicious, this could lead to unauthorized access, potentially compromising sensitive information and systems.
references:
- https://attack.mitre.org/techniques/T1621/
tags:
- attack.t1621
date: '2024-04-17'
original_spl: |-
  `okta` eventType=user.authentication.auth_via_mfa outcome.result=FAILURE debugContext.debugData.factor!=PASSWORD_AS_FACTOR
    | bucket _time span=5m
    | stats count min(_time) as firstTime max(_time) as lastTime values(displayMessage) values(src_ip) as src_ip values(debugContext.debugData.factor) values(dest) as dest
      BY _time src_user
    | where count >= 10
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `okta_multiple_failed_mfa_requests_for_user_filter`
splunk_rule_id: 826dbaae-a1e6-4c8c-b384-d16898956e73
splunk_rule_type: Anomaly
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    eventType: user.authentication.auth_via_mfa
  selection_1:
    outcome.result: FAILURE
  selection_2:
    debugContext.debugData.factor: PASSWORD_AS_FACTOR
  condition: selection_0 and selection_1 and selection_2
