title: Okta Mismatch Between Source and Response for Verify Push Request
id: 8085b79b-9b85-4e67-ad63-351c9e9a5e9a
status: stable
level: medium
author: John Murphy and Jordan Ruocco, Okta, Michael Haag, Bhavin Patel, Splunk
description: The following analytic identifies discrepancies between the source and response events for Okta Verify Push requests, indicating potential suspicious behavior. It leverages Okta System Log
  events, specifically `system.push.send_factor_verify_push` and `user.authentication.auth_via_mfa` with the factor "OKTA_VERIFY_PUSH." The detection groups events by SessionID, calculates the ratio of
  successful sign-ins to push requests, and checks for session roaming and new device/IP usage. This activity is significant as it may indicate push spam or unauthorized access attempts. If confirmed malicious,
  attackers could bypass MFA, leading to unauthorized access to sensitive systems.
references:
- https://attack.mitre.org/techniques/T1621
- https://splunkbase.splunk.com/app/6553
tags:
- attack.T1621
date: '2024-04-17'
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    eventType: system.push.send_factor_verify_push
  selection_1:
    eventType: user.authentication.auth_via_mfa
    debugData.factor: OKTA_VERIFY_PUSH
  condition: selection_0 and selection_1
