title: Okta MFA Exhaustion Hunt
id: 97e2fe57-3740-402c-988a-76b64ce04b8d
status: stable
level: medium
author: Michael Haag, Marissa Bower, Mauricio Velazco, Splunk
description: The following analytic detects patterns of successful and failed Okta MFA push attempts to identify potential MFA exhaustion attacks. It leverages Okta event logs, specifically focusing on
  push verification events, and uses statistical evaluations to determine suspicious activity. This activity is significant as it may indicate an attacker attempting to bypass MFA by overwhelming the user
  with push notifications. If confirmed malicious, this could lead to unauthorized access, compromising the security of the affected accounts and potentially the entire environment.
references:
- https://developer.okta.com/docs/reference/api/event-types/?q=user.acount.lock
- https://sec.okta.com/everythingisyes
- https://splunkbase.splunk.com/app/6553
tags:
- attack.t1110
date: '2022-12-19'
original_spl: |-
  `okta` eventType=system.push.send_factor_verify_push OR ((legacyEventType=core.user.factor.attempt_success) AND (debugContext.debugData.factor=OKTA_VERIFY_PUSH)) OR ((legacyEventType=core.user.factor.attempt_fail) AND (debugContext.debugData.factor=OKTA_VERIFY_PUSH))
    | stats count(eval(legacyEventType="core.user.factor.attempt_success"))  as successes count(eval(legacyEventType="core.user.factor.attempt_fail")) as failures count(eval(eventType="system.push.send_factor_verify_push")) as pushes
      BY user,_time
    | stats latest(_time) as lasttime earliest(_time) as firsttime sum(successes) as successes sum(failures) as failures sum(pushes) as pushes
      BY user
    | eval seconds=lasttime-firsttime
    | eval lasttime=strftime(lasttime, "%c")
    | search (pushes>1)
    | eval totalattempts=successes+failures
    | eval finding="Normal authentication pattern"
    | eval finding=if(failures==pushes AND pushes>1,"Authentication attempts not successful because multiple pushes denied",finding)
    | eval finding=if(totalattempts==0,"Multiple pushes sent and ignored",finding)
    | eval finding=if(successes>0 AND pushes>3,"Probably should investigate. Multiple pushes sent, eventual successful authentication!",finding)
    | `okta_mfa_exhaustion_hunt_filter`
splunk_rule_id: 97e2fe57-3740-402c-988a-76b64ce04b8d
splunk_rule_type: Hunting
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    eventType: system.push.send_factor_verify_push
  selection_1:
    legacyEventType: core.user.factor.attempt_success
  selection_2:
    legacyEventType: core.user.factor.attempt_fail
  condition: selection_0 and selection_1 and selection_2
