title: Okta ThreatInsight Threat Detected
id: 140504ae-5fe2-4d65-b2bc-a211813fbca6
status: stable
level: medium
author: Michael Haag, Mauricio Velazco, Splunk
description: The following analytic identifies threats detected by Okta ThreatInsight, such as password spraying, login failures, and high counts of unknown user login attempts. It leverages Okta Identity
  Management logs, specifically focusing on security.threat.detected events. This activity is significant for a SOC as it highlights potential unauthorized access attempts and credential-based attacks.
  If confirmed malicious, these activities could lead to unauthorized access, data breaches, and further exploitation of compromised accounts, posing a significant risk to the organization's security posture.
references:
- https://developer.okta.com/docs/reference/api/event-types/?q=security.threat.detected
tags:
- attack.t1078.004
date: '2022-12-19'
original_spl: |-
  `okta` eventType = security.threat.detected
    | rename client.geographicalContext.country as country, client.geographicalContext.state as state, client.geographicalContext.city as city
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY app src_ip dest
         signature eventType displayMessage
         client.device city state
         country user_agent outcome.reason
         outcome.result severity
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `okta_threatinsight_threat_detected_filter`
splunk_rule_id: 140504ae-5fe2-4d65-b2bc-a211813fbca6
splunk_rule_type: Anomaly
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    eventType: security.threat.detected
  condition: selection_0
