title: Okta New Device Enrolled on Account
id: bb27cbce-d4de-432c-932f-2e206e9130fb
status: stable
level: medium
author: Michael Haag, Mauricio Velazco, Splunk
description: The following analytic identifies when a new device is enrolled on an Okta account. It uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity Cloud to detect the creation of new
  device enrollments. This activity is significant as it may indicate a legitimate user setting up a new device or an adversary adding a device to maintain unauthorized access. If confirmed malicious, this
  could lead to potential account takeover, unauthorized access, and persistent control over the compromised Okta account. Monitoring this behavior is crucial for detecting and mitigating unauthorized access
  attempts.
references:
- https://attack.mitre.org/techniques/T1098/005/
- https://developer.okta.com/docs/reference/api/event-types/?q=device.enrollment.create
tags:
- attack.t1098.005
date: '2022-12-19'
original_spl: |-
  | tstats `security_content_summariesonly` count max(_time) as lastTime, min(_time) as firstTime FROM datamodel=Change
    WHERE All_Changes.action=created All_Changes.command=device.enrollment.create
    BY _time span=5m All_Changes.user
       All_Changes.result All_Changes.command sourcetype
       All_Changes.src All_Changes.action All_Changes.object_category
       All_Changes.dest
  | `drop_dm_object_name("All_Changes")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `okta_new_device_enrolled_on_account_filter`
splunk_rule_id: bb27cbce-d4de-432c-932f-2e206e9130fb
splunk_rule_type: TTP
logsource:
  category: change
  product: okta
detection:
  selection_0:
    All_Changes.action: created
  selection_1:
    CommandLine: device.enrollment.create
  condition: selection_0 and selection_1
