title: Okta Multiple Users Failing To Authenticate From Ip
id: de365ffa-42f5-46b5-b43f-fa72290b8218
status: stable
level: medium
author: Michael Haag, Mauricio Velazco, Splunk
description: The following analytic identifies instances where more than 10 unique user accounts have failed to authenticate from a single IP address within a 5-minute window in an Okta tenant. This detection
  uses OktaIm2 logs ingested via the Splunk Add-on for Okta Identity Cloud. Such activity is significant as it may indicate brute-force attacks or password spraying attempts. If confirmed malicious, this
  behavior suggests an external entity is attempting to compromise multiple user accounts, potentially leading to unauthorized access to organizational resources and data breaches.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://splunkbase.splunk.com/app/6553
tags:
- attack.t1110.003
date: '2024-04-17'
original_spl: |-
  | tstats `security_content_summariesonly` count max(_time) as lastTime, min(_time) as firstTime dc(Authentication.user) as unique_accounts values(Authentication.signature) as signature values(Authentication.user) as user values(Authentication.app) as app values(Authentication.authentication_method) as authentication_method values(Authentication.dest) as dest FROM datamodel=Authentication
    WHERE Authentication.action="failure"
      AND
      Authentication.signature=user.session.start
    BY _time span=5m Authentication.src
       sourcetype
  | where unique_accounts > 9
  | `drop_dm_object_name("Authentication")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `okta_multiple_users_failing_to_authenticate_from_ip_filter`
splunk_rule_id: de365ffa-42f5-46b5-b43f-fa72290b8218
splunk_rule_type: Anomaly
logsource:
  category: authentication
  product: okta
detection:
  selection_0:
    EventType: failure
  selection_1:
    Authentication.signature: user.session.start
  condition: selection_0 and selection_1
