title: Okta Multiple Failed Requests to Access Applications
id: 1c21fed1-7000-4a2e-9105-5aaafa437247
status: experimental
level: medium
author: John Murphy, Okta, Michael Haag, Splunk
description: The following analytic detects multiple failed attempts to access applications in Okta, potentially indicating the reuse of a stolen web session cookie. It leverages Okta logs to evaluate policy
  and SSO events, aggregating data by user, session, and IP. The detection triggers when more than half of the app sign-on attempts are unsuccessful across multiple applications. This activity is significant
  as it may indicate an attempt to bypass authentication mechanisms. If confirmed malicious, it could lead to unauthorized access to sensitive applications and data, posing a significant security risk.
references:
- https://attack.mitre.org/techniques/T1538
- https://attack.mitre.org/techniques/T1550/004
tags:
- attack.T1550_004
- attack.T1538
date: '2023-04-11'
logsource:
  product: okta
  service: okta
detection:
  selection_0:
    type: AppInstance
    eventType: policy.evaluate_sign_on
    result: CHALLENGE
  selection_1:
    eventType: user.authentication.sso
    result: SUCCESS
  condition: selection_0 and selection_1
