title: Okta Authentication Failed During MFA Challenge
id: e2b99e7d-d956-411a-a120-2b14adfdde93
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies failed authentication attempts during the Multi-Factor Authentication (MFA) challenge in an Okta tenant. It uses the Authentication datamodel to detect specific
  failed events where the authentication signature is `user.authentication.auth_via_mfa`. This activity is significant as it may indicate an adversary attempting to authenticate with compromised credentials
  on an account with MFA enabled. If confirmed malicious, this could suggest an ongoing attempt to bypass MFA protections, potentially leading to unauthorized access and further compromise of the affected
  account.
references:
- https://sec.okta.com/everythingisyes
- https://splunkbase.splunk.com/app/6553
tags:
- attack.T1078_004
- attack.T1586_003
- attack.T1621
date: '2024-04-17'
logsource:
  category: authentication
  product: okta
detection:
  selection_0:
    Signature: user.authentication.auth_via_mfa
  selection_1:
    EventType: failure
  condition: selection_0 and selection_1
