title: Detect Windows DNS SIGRed via Zeek
id: c5c622e4-d073-11ea-87d0-0242ac130003
status: experimental
level: medium
author: Shannon Davis, Splunk
description: The following analytic detects the presence of SIGRed, a critical DNS vulnerability, using Zeek DNS and Zeek Conn data. It identifies specific DNS query types (SIG and KEY) and checks for high
  data transfer within a flow. This detection is significant because SIGRed allows attackers to execute remote code on Windows DNS servers, potentially leading to unauthorized access and control. If confirmed
  malicious, this activity could result in data exfiltration, service disruption, or further network compromise. Immediate investigation and mitigation, such as patching or isolating the affected server,
  are crucial.
tags:
- attack.t1203
date: '2020-08-04'
original_spl: |-
  | tstats `security_content_summariesonly` count from datamodel=Network_Resolution where
    DNS.query_type IN (SIG,KEY) by DNS.flow_id
  | rename DNS.flow_id as flow_id
  | append [
    | tstats  `security_content_summariesonly` count
    from datamodel=Network_Traffic where
    All_Traffic.bytes_in>65000
    by All_Traffic.flow_id
    | rename All_Traffic.flow_id as flow_id
  ]
  | stats count by flow_id
  | where count>1
  | fields - count'
  | `detect_windows_dns_sigred_via_zeek_filter`
splunk_rule_id: c5c622e4-d073-11ea-87d0-0242ac130003
splunk_rule_type: TTP
logsource:
  category: network_connection
  product: windows
detection:
  selection_0:
    DNS.query_type:
    - SIG
    - KEY
  condition: selection_0
