title: Detect Software Download To Network Device
id: cc590c66-f65f-48f2-986a-4797244762f8
status: experimental
level: medium
author: Mikael Bjerkeland, Splunk
description: The following analytic identifies unauthorized software downloads to network devices via TFTP, FTP, or SSH/SCP. It detects this activity by analyzing network traffic events on specific ports
  (69, 21, 22) from devices categorized as network, router, or switch. This activity is significant because adversaries may exploit netbooting to load unauthorized operating systems, potentially compromising
  network integrity. If confirmed malicious, this could lead to unauthorized control over network devices, enabling further attacks, data exfiltration, or persistent access within the network.
tags:
- attack.T1542_005
date: '2020-10-28'
logsource:
  category: network_connection
  product: windows
detection:
  selection_0:
    transport: udp
    DestinationPort: 69
  selection_1:
    transport: tcp
    DestinationPort: 21
  selection_2:
    transport: tcp
    DestinationPort: 22
    dest_category!: common_software_repo_destination
    src_category: network
  selection_3:
    src_category: router
  selection_4:
    src_category: switch
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
