title: Detect Software Download To Network Device
id: cc590c66-f65f-48f2-986a-4797244762f8
status: experimental
level: medium
author: Mikael Bjerkeland, Splunk
description: The following analytic identifies unauthorized software downloads to network devices via TFTP, FTP, or SSH/SCP. It detects this activity by analyzing network traffic events on specific ports
  (69, 21, 22) from devices categorized as network, router, or switch. This activity is significant because adversaries may exploit netbooting to load unauthorized operating systems, potentially compromising
  network integrity. If confirmed malicious, this could lead to unauthorized control over network devices, enabling further attacks, data exfiltration, or persistent access within the network.
tags:
- attack.t1542.005
date: '2020-10-28'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Network_Traffic
    WHERE (
          All_Traffic.transport=udp
          AND
          All_Traffic.dest_port=69
      )
      OR (All_Traffic.transport=tcp AND All_Traffic.dest_port=21) OR (All_Traffic.transport=tcp AND All_Traffic.dest_port=22) AND All_Traffic.dest_category!=common_software_repo_destination AND All_Traffic.src_category=network OR All_Traffic.src_category=router OR All_Traffic.src_category=switch
    BY All_Traffic.src All_Traffic.dest All_Traffic.dest_port
  | `drop_dm_object_name("All_Traffic")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `detect_software_download_to_network_device_filter`
splunk_rule_id: cc590c66-f65f-48f2-986a-4797244762f8
splunk_rule_type: TTP
logsource:
  category: network_connection
  product: windows
detection:
  selection_0:
    All_Traffic.transport: udp
    All_Traffic.dest_port: 69
  selection_1:
    All_Traffic.transport: tcp
    All_Traffic.dest_port: 21
  selection_2:
    All_Traffic.transport: tcp
    All_Traffic.dest_port: 22
    All_Traffic.dest_category: common_software_repo_destination
    All_Traffic.src_category: network
  selection_3:
    All_Traffic.src_category: router
  selection_4:
    All_Traffic.src_category: switch
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
