title: Network Traffic to Active Directory Web Services Protocol
id: 68a0056c-34cb-455f-b03d-df935ea62c4f
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies network traffic directed to the Active Directory Web Services Protocol (ADWS) on port 9389. It leverages network traffic logs, focusing on source and destination
  IP addresses, application names, and destination ports. This activity is significant as ADWS is used to manage Active Directory, and unauthorized access could indicate malicious intent. If confirmed malicious,
  an attacker could manipulate Active Directory, potentially leading to privilege escalation, unauthorized access, or persistent control over the environment.
references:
- https://github.com/FalconForceTeam/SOAPHound
tags:
- attack.T1069_001
- attack.T1069_002
- attack.T1087_001
- attack.T1087_002
- attack.T1482
date: '2024-02-14'
logsource:
  category: network_connection
  product: windows
detection:
  selection_0:
    DestinationPort: 9389
  condition: selection_0
