title: Windows Remote Desktop Network Bruteforce Attempt
id: 908bf0d5-0983-4afd-b6a4-e9eb5d361a7d
status: stable
level: medium
author: Jose Hernandez, Bhavin Patel, Splunk
description: The following analytic identifies potential Remote Desktop Protocol (RDP) brute force attacks by monitoring network traffic for RDP application activity. This query detects potential RDP brute
  force attacks by identifying source IPs that have made more than 10 connection attempts to the same RDP port on a host within a one-hour window. The results are presented in a table that includes the
  source and destination IPs, destination port, number of attempts, and the times of the first and last connection attempts, helping to prioritize IPs based on the intensity of activity.
references:
- https://www.zscaler.com/blogs/security-research/ransomware-delivered-using-rdp-brute-force-attack
- https://www.reliaquest.com/blog/rdp-brute-force-attacks/
tags:
- attack.T1110_001
date: '2020-04-29'
logsource:
  category: network_connection
  product: windows
detection:
  selection_0:
    app: rdp
  selection_1:
    DestinationPort: 3389
  condition: selection_0 and selection_1
