title: Windows Defender ASR Audit Events
id: 0e4d46b1-22bd-4f0e-8337-ca6f60ad4bea
status: stable
level: medium
author: Michael Haag, Splunk
description: This detection searches for Windows Defender ASR audit events. ASR is a feature of Windows Defender Exploit Guard that prevents actions and apps that are typically used by exploit-seeking malware
  to infect machines. ASR rules are applied to processes and applications. When a process or application attempts to perform an action that is blocked by an ASR rule, an event is generated. This detection
  searches for ASR audit events that are generated when a process or application attempts to perform an action that would be blocked by an ASR rule, but is allowed to proceed for auditing purposes.
references:
- https://asrgen.streamlit.app/
tags:
- attack.t1059
- attack.t1566.001
- attack.t1566.002
date: '2023-12-06'
original_spl: |-
  `ms_defender` EventCode IN (1122, 1125, 1126, 1132, 1134)
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY host, Process_Name, Target_Commandline,
         Path, ID, EventCode
    | lookup asr_rules ID OUTPUT ASR_Rule
    | fillnull value=NULL
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | rename host as dest
    | `windows_defender_asr_audit_events_filter`
splunk_rule_id: 0e4d46b1-22bd-4f0e-8337-ca6f60ad4bea
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: defender
detection:
  selection_0:
    EventID:
    - 1122
    - 1125
    - 1126
    - 1132
    - 1134
  condition: selection_0
