title: Windows Defender ASR Block Events
id: 026f5f4e-e99f-4155-9e63-911ba587300b
status: stable
level: medium
author: Michael Haag, Splunk
description: This detection searches for Windows Defender ASR block events. ASR is a feature of Windows Defender Exploit Guard that prevents actions and apps that are typically used by exploit-seeking malware
  to infect machines. ASR rules are applied to processes and applications. When a process or application attempts to perform an action that is blocked by an ASR rule, an event is generated. This detection
  searches for ASR block events that are generated when a process or application attempts to perform an action that is blocked by an ASR rule. Typically, these will be enabled in block most after auditing
  and tuning the ASR rules themselves. Set to TTP once tuned.
references:
- https://asrgen.streamlit.app/
tags:
- attack.t1059
- attack.t1566.001
- attack.t1566.002
date: '2023-12-06'
original_spl: |-
  `ms_defender` EventCode IN (1121, 1126, 1129, 1131, 1133)
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY host, Path, Parent_Commandline,
         Process_Name, ID, EventCode
    | lookup asr_rules ID OUTPUT ASR_Rule
    | fillnull value=NULL
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | rename host as dest
    | `windows_defender_asr_block_events_filter`
splunk_rule_id: 026f5f4e-e99f-4155-9e63-911ba587300b
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: defender
detection:
  selection_0:
    EventID:
    - 1121
    - 1126
    - 1129
    - 1131
    - 1133
  condition: selection_0
