title: Detect Excessive Account Lockouts From Endpoint
id: c026e3dd-7e18-4abb-8f41-929e836efe74
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects endpoints causing a high number of account lockouts within a short period. It leverages the Windows security event logs ingested into the `Change` datamodel,
  specifically under the `Account_Management` node, to identify and count lockout events. This activity is significant as it may indicate a brute-force attack or misconfigured system causing repeated authentication
  failures. If confirmed malicious, this behavior could lead to account lockouts, disrupting user access and potentially indicating an ongoing attack attempting to compromise user credentials.
tags:
- attack.t1078.002
date: '2020-04-29'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime values(All_Changes.user) as user FROM datamodel=Change.All_Changes
    WHERE All_Changes.result="*lock*"
    BY All_Changes.dest All_Changes.result
  | `drop_dm_object_name("All_Changes")`
  | `drop_dm_object_name("Account_Management")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | search count > 5
  | `detect_excessive_account_lockouts_from_endpoint_filter`
splunk_rule_id: c026e3dd-7e18-4abb-8f41-929e836efe74
splunk_rule_type: Anomaly
logsource:
  category: process_creation
detection:
  selection_0:
    Result|contains: lock
  condition: selection_0
