title: Detect Excessive User Account Lockouts
id: 95a7f9a5-6096-437e-a19e-86f42ac609bd
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic identifies user accounts experiencing an excessive number of lockouts within a short timeframe. It leverages the 'Change' data model, specifically focusing on events
  where the result indicates a lockout. This activity is significant as it may indicate a brute-force attack or misconfiguration, both of which require immediate attention. If confirmed malicious, this
  behavior could lead to account compromise, unauthorized access, and potential lateral movement within the network.
tags:
- attack.t1078.003
date: '2020-04-29'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Change.All_Changes
    WHERE All_Changes.result="*lock*"
    BY All_Changes.user All_Changes.result
  | `drop_dm_object_name("All_Changes")`
  | `drop_dm_object_name("Account_Management")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | search count > 5
  | `detect_excessive_user_account_lockouts_filter`
splunk_rule_id: 95a7f9a5-6096-437e-a19e-86f42ac609bd
splunk_rule_type: Anomaly
logsource:
  category: process_creation
detection:
  selection_0:
    Result|contains: lock
  condition: selection_0
