title: Detect Zerologon via Zeek
id: bf7a06ec-f703-11ea-adc1-0242ac120002
status: experimental
level: medium
author: Shannon Davis, Splunk
description: 'The following analytic detects attempts to exploit the Zerologon CVE-2020-1472 vulnerability via Zeek RPC. It leverages Zeek DCE-RPC data to identify specific operations: NetrServerPasswordSet2,
  NetrServerReqChallenge, and NetrServerAuthenticate3. This activity is significant because it indicates an attempt to gain unauthorized access to a domain controller, potentially leading to a complete
  takeover of an organization''s IT infrastructure. If confirmed malicious, the impact could be severe, including data theft, ransomware deployment, or other devastating outcomes. Immediate investigation
  of the identified IP addresses and RPC operations is crucial.'
references:
- https://www.secura.com/blog/zero-logon
- https://github.com/SecuraBV/CVE-2020-1472
- https://msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2020-1472
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-319a
tags:
- attack.t1190
date: '2020-09-18'
original_spl: |-
  `zeek_rpc` operation IN (NetrServerPasswordSet2,NetrServerReqChallenge,NetrServerAuthenticate3)
    | bin span=5m _time
    | stats values(operation) dc(operation) as opscount count(eval(operation=="NetrServerReqChallenge")) as challenge count(eval(operation=="NetrServerAuthenticate3")) as authcount count(eval(operation=="NetrServerPasswordSet2")) as passcount count as totalcount
      BY _time,src_ip,dest_ip
    | search opscount=3 authcount>4 passcount>0
    | search `detect_zerologon_via_zeek_filter`
splunk_rule_id: bf7a06ec-f703-11ea-adc1-0242ac120002
splunk_rule_type: TTP
logsource:
  product: zeek
  service: rpc
detection:
  selection_0:
    operation:
    - NetrServerPasswordSet2
    - NetrServerReqChallenge
    - NetrServerAuthenticate3
  condition: selection_0
