title: Detect SNICat SNI Exfiltration
id: 82d06410-134c-11eb-adc1-0242ac120002
status: experimental
level: medium
author: Shannon Davis, Splunk
description: The following analytic identifies the use of SNICat tool commands within the TLS SNI field, indicating potential data exfiltration attempts. It leverages Zeek SSL data to detect specific SNICat
  commands such as LIST, LS, SIZE, LD, CB, EX, ALIVE, EXIT, WHERE, and finito in the server_name field. This activity is significant as SNICat is a known tool for covert data exfiltration using TLS. If
  confirmed malicious, this could allow attackers to exfiltrate sensitive data undetected, posing a severe threat to data confidentiality and integrity.
references:
- https://www.mnemonic.io/resources/blog/introducing-snicat/
- https://github.com/mnemonic-no/SNIcat
- https://attack.mitre.org/techniques/T1041/
tags:
- attack.T1041
date: '2020-11-05'
logsource:
  product: zeek
  service: ssl
detection:
  selection_0:
    count: 0
  condition: selection_0
