title: Detect Windows DNS SIGRed via Splunk Stream
id: babd8d10-d073-11ea-87d0-0242ac130003
status: experimental
level: medium
author: Shannon Davis, Splunk
description: The following analytic detects attempts to exploit the SIGRed vulnerability (CVE-2020-1350) in Windows DNS servers. It leverages Splunk Stream DNS and TCP data to identify DNS SIG and KEY records,
  as well as TCP payloads exceeding 65KB. This activity is significant because SIGRed is a critical wormable vulnerability that allows remote code execution. If confirmed malicious, an attacker could gain
  unauthorized access, execute arbitrary code, and potentially disrupt services, leading to severe data breaches and infrastructure compromise. Immediate investigation and remediation are crucial to mitigate
  these risks.
tags:
- attack.T1203
date: '2020-08-04'
logsource:
  product: zeek
  service: dns
detection:
  selection_0:
    '"query_type{}"|contains':
    - SIG
    - KEY
  condition: selection_0
