title: Web Spring4Shell HTTP Request Class Module
id: fcdfd69d-0ca3-4476-920e-9b633cb4593e
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects HTTP requests containing payloads related to the Spring4Shell vulnerability (CVE-2022-22965). It leverages Splunk Stream HTTP data to inspect the HTTP request
  body and form data for specific fields such as "class.module.classLoader.resources.context.parent.pipeline.first". This activity is significant as it indicates an attempt to exploit a critical vulnerability
  in Spring Framework, potentially leading to remote code execution. If confirmed malicious, this could allow attackers to gain unauthorized access, execute arbitrary code, and compromise the affected system.
references:
- https://github.com/DDuarte/springshell-rce-poc/blob/master/poc.py
tags:
- attack.t1190
- attack.t1133
date: '2022-04-06'
original_spl: |-
  `stream_http` http_method IN ("POST")
    | stats values(form_data) as http_request_body min(_time) as firstTime max(_time) as lastTime count
      BY src dest http_method
         http_user_agent uri_path url
         bytes_in bytes_out
    | search http_request_body IN ("*class.module.classLoader.resources.context.parent.pipeline.first.fileDateFormat=_*", "*class.module.classLoader.resources.context.parent.pipeline.first.pattern*","*suffix=.jsp*")
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `web_spring4shell_http_request_class_module_filter`
splunk_rule_id: fcdfd69d-0ca3-4476-920e-9b633cb4593e
splunk_rule_type: TTP
logsource:
  product: zeek
  service: http
detection:
  selection_0:
    http_method: POST
  condition: selection_0
