title: Web Spring4Shell HTTP Request Class Module
id: fcdfd69d-0ca3-4476-920e-9b633cb4593e
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects HTTP requests containing payloads related to the Spring4Shell vulnerability (CVE-2022-22965). It leverages Splunk Stream HTTP data to inspect the HTTP request
  body and form data for specific fields such as "class.module.classLoader.resources.context.parent.pipeline.first". This activity is significant as it indicates an attempt to exploit a critical vulnerability
  in Spring Framework, potentially leading to remote code execution. If confirmed malicious, this could allow attackers to gain unauthorized access, execute arbitrary code, and compromise the affected system.
references:
- https://github.com/DDuarte/springshell-rce-poc/blob/master/poc.py
tags:
- attack.T1190
- attack.T1133
date: '2022-04-06'
logsource:
  product: zeek
  service: http
detection:
  selection_0:
    cs-method|contains: POST
  condition: selection_0
