title: Detect Certify With PowerShell Script Block Logging
id: f533ca6c-9440-4686-80cb-7f294c07812a
status: stable
level: medium
author: Steven Dick
description: The following analytic detects the use of the Certify tool via an in-memory PowerShell function to enumerate Active Directory Certificate Services (AD CS) environments. It leverages PowerShell
  Script Block Logging (EventCode 4104) to identify specific command patterns associated with Certify's enumeration and exploitation functions. This activity is significant as it indicates potential reconnaissance
  or exploitation attempts against AD CS, which could lead to unauthorized certificate issuance. If confirmed malicious, attackers could leverage this to escalate privileges, persist in the environment,
  or access sensitive information by abusing AD CS.
references:
- https://github.com/GhostPack/Certify
- https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
tags:
- attack.t1059.001
- attack.t1649
date: '2023-07-28'
original_spl: |-
  `powershell` EventCode=4104 (ScriptBlockText IN ("*find *") AND ScriptBlockText IN ("* /vulnerable*","* -vulnerable*","* /enrolleeSuppliesSubject *","* /json /outfile*")) OR (ScriptBlockText IN (,"*auth *","*req *",) AND ScriptBlockText IN ("* -ca *","* -username *","* -u *")) OR (ScriptBlockText IN ("*request *","*download *") AND ScriptBlockText IN ("* /ca:*"))
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest signature signature_id
         user_id vendor_product EventID
         Guid Opcode Name
         Path ProcessID ScriptBlockId
         ScriptBlockText
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | eval file_name = case(isnotnull(file_name),file_name,true(),"unknown")
    | eval signature = substr(command,0,256)
    | `detect_certify_with_powershell_script_block_logging_filter`
splunk_rule_id: f533ca6c-9440-4686-80cb-7f294c07812a
splunk_rule_type: TTP
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
    ScriptBlockText:
    - '*find *'
    - '* /vulnerable*'
    - '* -vulnerable*'
    - '* /enrolleeSuppliesSubject *'
    - '* /json /outfile*'
  selection_1:
    ScriptBlockText:
    - '*auth *'
    - '*req *'
    - '* -ca *'
    - '* -username *'
    - '* -u *'
  selection_2:
    ScriptBlockText:
    - '*request *'
    - '*download *'
    - '* /ca:*'
  condition: selection_0 and selection_1 and selection_2
