title: Domain Group Discovery with Adsisearcher
id: 089c862f-5f83-49b5-b1c8-7e4ff66560c7
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the use of the `[Adsisearcher]` type accelerator in PowerShell to query Active Directory for domain groups. It leverages PowerShell Script Block Logging (EventCode=4104)
  to identify specific script blocks containing `[adsisearcher]` and group-related queries. This activity is significant as it may indicate an attempt by adversaries or Red Teams to enumerate domain groups
  for situational awareness and Active Directory discovery. If confirmed malicious, this behavior could lead to further reconnaissance, privilege escalation, or lateral movement within the network.
references:
- https://attack.mitre.org/techniques/T1069/002/
- https://devblogs.microsoft.com/scripting/use-the-powershell-adsisearcher-type-accelerator-to-search-active-directory/
tags:
- attack.t1069.002
date: '2021-08-27'
original_spl: |-
  `powershell` (ScriptBlockText = "*[adsisearcher]*" AND ScriptBlockText = "*(objectcategory=group)*" AND ScriptBlockText = "*findAll()*")
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest signature signature_id
         user_id vendor_product EventID
         Guid Opcode Name
         Path ProcessID ScriptBlockId
         ScriptBlockText
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `domain_group_discovery_with_adsisearcher_filter`
splunk_rule_id: 089c862f-5f83-49b5-b1c8-7e4ff66560c7
splunk_rule_type: TTP
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    ScriptBlockText|contains: '[adsisearcher]'
  selection_1:
    ScriptBlockText|contains: (objectcategory=group)
  selection_2:
    ScriptBlockText|contains: findAll()
  condition: selection_0 and selection_1 and selection_2
