title: PowerShell Loading DotNET into Memory via Reflection
id: 85bc3f30-ca28-11eb-bd21-acde48001122
status: stable
level: medium
author: Michael Haag, Teoderick Contreras Splunk
description: |-
  The following analytic detects the use of PowerShell scripts to load .NET assemblies into memory via reflection, a technique often used in malicious activities such as those by Empire and Cobalt Strike.
  It leverages PowerShell Script Block Logging (EventCode=4104) to capture and analyze the full command executed.
  This behavior is significant as it can indicate advanced attack techniques aiming to execute code in memory, bypassing traditional defenses.
  If confirmed malicious, this activity could lead to unauthorized code execution, privilege escalation, and persistent access within the environment.
references:
- https://docs.microsoft.com/en-us/dotnet/api/system.reflection.assembly?view=net-5.0
- https://help.splunk.com/en/security-offerings/splunk-user-behavior-analytics/get-data-in/5.4.1/add-other-data-to-splunk-uba/configure-powershell-logging-to-see-powershell-anomalies-in-splunk-uba.
- https://blog.palantir.com/tampering-with-windows-event-tracing-background-offense-and-defense-4be7ac62ac63
- https://static1.squarespace.com/static/552092d5e4b0661088167e5c/t/59c1814829f18782e24f1fe2/1505853768977/Windows+PowerShell+Logging+Cheat+Sheet+ver+Sept+2017+v2.1.pdf
- https://www.crowdstrike.com/blog/investigating-powershell-command-and-script-logging/
tags:
- attack.t1059.001
date: '2021-06-15'
original_spl: |-
  `powershell` EventCode=4104
  ScriptBlockText IN (
      "*.LoadFrom(*",
      "*.LoadModule(*",
      "*.LoadWithPartialName*",
      "*Reflection.Assembly.Load*",
      "*Reflection.Assembly]::('daoL'[-1..-4] -join '')*",
      "*Reflection.Assembly]::Load*",
      "*ReflectionOnlyLoad*",
      "*UnsafeLoadFrom*"
  )

  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by dest signature signature_id user_id
       vendor_product EventID Guid Opcode
       Name Path ProcessID
       ScriptBlockId ScriptBlockText

  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `powershell_loading_dotnet_into_memory_via_reflection_filter`
splunk_rule_id: 85bc3f30-ca28-11eb-bd21-acde48001122
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains:
    - .LoadFrom(
    - .LoadModule(
    - .LoadWithPartialName
    - Reflection.Assembly.Load
    - Reflection.Assembly]::('daoL'[-1..-4] -join '')
    - Reflection.Assembly]::Load
    - ReflectionOnlyLoad
    - UnsafeLoadFrom
  condition: selection_0 and selection_1
