title: Powershell Load Module in Meterpreter
id: d5905da5-d050-48db-9259-018d8f034fcf
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of suspicious PowerShell commands associated with Meterpreter modules, such as "MSF.Powershell" and "MSF.Powershell.Meterpreter". It leverages PowerShell
  Script Block Logging (EventCode=4104) to capture and analyze the full command sent to PowerShell. This activity is significant as it indicates potential post-exploitation actions, including credential
  dumping and persistence mechanisms. If confirmed malicious, an attacker could gain extensive control over the compromised system, escalate privileges, and maintain long-term access, posing a severe threat
  to the environment.
references:
- https://github.com/OJ/metasploit-payloads/blob/master/powershell/MSF.Powershell/Scripts.cs
tags:
- attack.t1059.001
date: '2022-11-22'
original_spl: |-
  `powershell` EventCode=4104 ScriptBlockText IN ("*MSF.Powershell*","*MSF.Powershell.Meterpreter*","*MSF.Powershell.Meterpreter.Kiwi*","*MSF.Powershell.Meterpreter.Transport*")
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest signature signature_id
         user_id vendor_product EventID
         Guid Opcode Name
         Path ProcessID ScriptBlockId
         ScriptBlockText
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `powershell_load_module_in_meterpreter_filter`
splunk_rule_id: d5905da5-d050-48db-9259-018d8f034fcf
splunk_rule_type: TTP
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains:
    - MSF.Powershell
    - MSF.Powershell.Meterpreter
    - MSF.Powershell.Meterpreter.Kiwi
    - MSF.Powershell.Meterpreter.Transport
  condition: selection_0 and selection_1
