title: Windows Azure PowerShell Module Installation Via PowerShell Script
id: 344bed10-9a8b-4398-8bf3-ec9114125260
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects the installation of Azure AD and cloud management modules via PowerShell Script Block Logging.
  Tools such as AADInternals, AzureAD, MSOnline, and Az.Resources provide deep access to Azure Active Directory objects, user accounts, service principals, and tenant configurations making them high-value targets for adversaries conducting reconnaissance, privilege escalation, or persistence operations post-compromise.
tags:
- attack.t1078
- attack.t1021.007
- attack.t1136.003
- attack.t1098
- attack.t1069.003
date: '2026-05-05'
original_spl: |-
  `powershell`
  EventID="4104"
  ScriptBlockText IN (
      "*Install-Module -Name AADInternals*",
      "*Install-Module -Name Az.Resources*",
      "*Install-Module -Name AzureAd*",
      "*Install-Module -Name MSOnline*",
      "*Install-Module AADInternals*",
      "*Install-Module Az.Resources*",
      "*Install-Module AzureAd*",
      "*Install-Module MSOnline*"
  )
  | fillnull
  | stats count min(_time) as firstTime
          max(_time) as lastTime
    by Computer EventID ScriptBlockText signature signature_id
       user_id vendor_product Guid Opcode
       Name Path ProcessID ScriptBlockId

  | rename Computer as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_azure_powershell_module_installation_via_powershell_script_filter`
splunk_rule_id: 344bed10-9a8b-4398-8bf3-ec9114125260
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains:
    - Install-Module -Name AADInternals
    - Install-Module -Name Az.Resources
    - Install-Module -Name AzureAd
    - Install-Module -Name MSOnline
    - Install-Module AADInternals
    - Install-Module Az.Resources
    - Install-Module AzureAd
    - Install-Module MSOnline
  condition: selection_0 and selection_1
