title: Windows PowerShell Invoke-RestMethod IP Information Collection
id: 8db47e12-9c3e-4f5a-b0d6-e42a1895cd4f
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of PowerShell's Invoke-RestMethod cmdlet to collect geolocation data from ipinfo.io or IP address information from api.ipify.org. This behavior leverages
  PowerShell Script Block Logging to identify scripts that gather external IP information and potential geolocation data. This activity is significant as it may indicate reconnaissance efforts, where threat
  actors are attempting to determine the geographical location or network details of a compromised system. While some legitimate software may use these services, this pattern is commonly observed in malware
  and post-exploitation toolkits like those used by Water Gamayun threat actors.
references:
- https://securityintelligence.com/posts/new-threat-actor-water-gamayun-targets-telecom-finance/
- https://www.ncsc.gov.uk/report/weekly-threat-report-12th-april-2024
tags:
- attack.t1082
- attack.t1016
- attack.t1059.001
date: '2025-04-17'
original_spl: |-
  `powershell` EventCode=4104 (ScriptBlockText="*Invoke-RestMethod*" AND (ScriptBlockText="*ipinfo.io*" OR ScriptBlockText="*api.ipify.org*"))
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest signature signature_id
         user_id vendor_product Guid
         Opcode Name Path
         ProcessID ScriptBlockId ScriptBlockText
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_powershell_invoke_restmethod_ip_information_collection_filter`
splunk_rule_id: 8db47e12-9c3e-4f5a-b0d6-e42a1895cd4f
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: Invoke-RestMethod
  condition: selection_0 and selection_1
