title: Windows Screen Capture Via Powershell
id: 5e0b1936-8f99-4399-8ee2-9edc5b32e170
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of a PowerShell script designed to capture screen images on a host. It leverages PowerShell Script Block Logging to identify specific script block
  text patterns associated with screen capture activities. This behavior is significant as it may indicate an attempt to exfiltrate sensitive information by capturing desktop screenshots. If confirmed malicious,
  this activity could allow an attacker to gather visual data from the compromised system, potentially leading to data breaches or further exploitation.
references:
- https://twitter.com/_CERT_UA/status/1620781684257091584
- https://cert.gov.ua/article/3761104
tags:
- attack.t1113
date: '2023-04-05'
original_spl: |-
  `powershell`
  EventCode=4104
  ScriptBlockText IN (
      "*[Drawing.Graphics]::FromImage*",
      "*Drawing.Bitmap*",
      "*Graphics.FromImage*"
  )
  ScriptBlockText = "*.CopyFromScreen*"
  | fillnull
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY dest signature signature_id
       user_id vendor_product EventID
       Guid Opcode Name
       Path ProcessID ScriptBlockId
       ScriptBlockText
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_screen_capture_via_powershell_filter`
splunk_rule_id: 5e0b1936-8f99-4399-8ee2-9edc5b32e170
splunk_rule_type: TTP
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains:
    - '[Drawing.Graphics]::FromImage'
    - Drawing.Bitmap
    - Graphics.FromImage
  selection_2:
    ScriptBlockText|contains: .CopyFromScreen
  condition: selection_0 and selection_1 and selection_2
