title: Windows Software Discovery Via PowerShell
id: 213b4187-1bb9-449e-9406-5bb686a53440
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the use of PowerShell based registry queries to pull installed software information from the Uninstall key.
  This will give an attacker version information on installed software which could be used to identify further vulnerabilities.
  False positives are unlikely as this is an unusual key to query with PowerShell.
tags:
- attack.t1518
- attack.t1059.001
- attack.t1012
date: '2026-05-05'
original_spl: |-
  `powershell`
  EventID="4104"
  ScriptBlockText="*Get-ItemProperty *"
  ScriptBlockText="*Windows\\CurrentVersion\\Uninstall*"
  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by Computer EventID ScriptBlockText signature signature_id user_id vendor_product Guid
       Opcode Name Path ProcessID ScriptBlockId

  | rename Computer as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_software_discovery_via_powershell_filter`
splunk_rule_id: 213b4187-1bb9-449e-9406-5bb686a53440
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains: 'Get-ItemProperty '
  selection_2:
    ScriptBlockText|contains: Windows\CurrentVersion\Uninstall
  condition: selection_0 and selection_1 and selection_2
