title: Windows ConvertTo-AADIntBackdoor Execution Via PowerShell Script
id: 59a8662f-f616-4494-8fa1-29ae77fc2018
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects the execution of the ConvertTo-AADIntBackdoor command via PowerShell Script Block Logging.
  The ConvertTo-AADIntBackdoor command is part of the AADInternals toolkit, which is used primarily for security testing and administrative tasks in Azure Active Directory (Azure AD) environments.
  This particular command is designed to create a "backdoor" in a federated Azure AD domain.
  When executed, ConvertTo-AADIntBackdoor modifies the federation settings of a domain by adding or changing the federation configuration to allow an attacker to control the authentication process.
  This manipulation enables the creation of security tokens that can impersonate any user within the Azure AD tenant.
  Consequently, this allows an attacker to bypass Multi-Factor Authentication (MFA), escalate privileges, and maintain persistent access to the Azure AD environment.
references:
- https://atomicredteam.io/privilege-escalation/T1484.002/#atomic-test-1---add-federation-to-azure-ad
tags:
- attack.t1482
- attack.t1078
- attack.t1212
- attack.t1071.001
date: '2026-05-05'
original_spl: |-
  `powershell`
  EventID="4104"
  ScriptBlockText="*ConvertTo-AADIntBackdoor*"
  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by Computer EventID ScriptBlockText signature signature_id user_id vendor_product Guid
       Opcode Name Path ProcessID ScriptBlockId

  | rename Computer as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_convertto_aadintbackdoor_execution_via_powershell_script_filter`
splunk_rule_id: 59a8662f-f616-4494-8fa1-29ae77fc2018
splunk_rule_type: TTP
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains: ConvertTo-AADIntBackdoor
  condition: selection_0 and selection_1
