title: Windows ClipBoard Data via Get-ClipBoard
id: ab73289e-2246-4de0-a14b-67006c72a893
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the execution of the PowerShell command 'Get-Clipboard' to retrieve clipboard data.
  It leverages PowerShell Script Block Logging (EventCode 4104) to identify instances where this command is used.
  This activity is significant because it can indicate an attempt to steal sensitive information such as usernames, passwords, or other confidential data copied to the clipboard.
  If confirmed malicious, this behavior could lead to unauthorized access to sensitive information, potentially compromising user accounts and other critical assets.
references:
- https://attack.mitre.org/techniques/T1115/
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
- attack.t1115
date: '2022-12-06'
original_spl: |-
  `powershell`
  EventCode=4104
  ScriptBlockText = "*Get-Clipboard*"
  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by dest signature signature_id
       user_id vendor_product EventID
       Guid Opcode Name
       Path ProcessID ScriptBlockId
       ScriptBlockText
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_clipboard_data_via_get_clipboard_filter`
splunk_rule_id: ab73289e-2246-4de0-a14b-67006c72a893
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: Get-Clipboard
  condition: selection_0 and selection_1
