title: Windows PowerShell Script TabExpansion Direct Call
id: d36a09b3-35ac-4d6f-964a-39fd337abc2f
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects specific indicators associated with the execution of the TabExpansion internal function in PowerShell.
  Calling this function directly is not normal and can be indicative of malicious activity such as TabShell.
  Due to the way PowerShell internals work it can be used in conjunction with directory transversal to load any PowerShell functions even in a sandboxed session.
  False positives could include legitimate usage of the TabExpansion function but calling it directly is very rare.
references:
- https://blog.viettelcybersecurity.com/tabshell-owassrf/
tags:
- attack.t1059.001
- attack.t1129
date: '2026-05-05'
original_spl: |-
  `powershell`
  EventID="4104"
  ScriptBlockText="*$lastWord*"
  ScriptBlockText="*$_val=' + $_expression*"
  ScriptBlockText="*function Write-Members*"
  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by Computer EventID ScriptBlockText signature signature_id user_id vendor_product Guid
       Opcode Name Path ProcessID ScriptBlockId

  | rename Computer as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_powershell_script_tabexpansion_direct_call_filter`
splunk_rule_id: d36a09b3-35ac-4d6f-964a-39fd337abc2f
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains: $lastWord
  selection_2:
    ScriptBlockText|contains: $_val=' + $_expression
  selection_3:
    ScriptBlockText|contains: function Write-Members
  condition: selection_0 and selection_1 and selection_2 and selection_3
