title: Windows LAPS Password Gathering Via PowerShell Script
id: 02b712b6-5996-4537-b72a-cad3cb1bb3b4
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects attempts to gather LAPS passwords via PowerShell and the ms-Mcs-AdmPwd property.
  Microsoft LAPS (Local Administrator Password Solution) is a Windows native tool used to manage local Administrator accounts within an AD domain.
  To keep things simple, instead of requiring an administrator to manually set, rotate, and store the local Administrator passwords, LAPS will do this automatically while providing an easy interface for authorized users to access passwords for recovery and/or other admin-related tasks.
  The benefits to an organization here are obvious: automate and protect a well-known critical security challenge and free up IT resources on your team.
  However, the fact that LAPS has so much information means that it provides a potential avenue of attack for malicious actors looking to further compromise an environment.
  If LAPS isn't properly locked down, an organization can inadvertently allow anybody to grab local Admin powers on a given machine.
tags:
- attack.t1552
- attack.t1003
date: '2026-05-05'
original_spl: |-
  `powershell`
  EventID="4104"
  ScriptBlockText="*Get-AdComputer*"
  ScriptBlockText="*ms-Mcs-AdmPwd*"
  | fillnull
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by Computer EventID ScriptBlockText signature signature_id user_id vendor_product Guid
       Opcode Name Path ProcessID ScriptBlockId

  | rename Computer as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_laps_password_gathering_via_powershell_script_filter`
splunk_rule_id: 02b712b6-5996-4537-b72a-cad3cb1bb3b4
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains: Get-AdComputer
  selection_2:
    ScriptBlockText|contains: ms-Mcs-AdmPwd
  condition: selection_0 and selection_1 and selection_2
