title: WMI Permanent Event Subscription
id: 71bfdb13-f200-4c6c-b2c9-a2e07adf437d
status: experimental
level: medium
author: Rico Valdez, Splunk
description: The following analytic detects the creation of permanent event subscriptions using Windows Management Instrumentation (WMI). It leverages Sysmon EventID 5 data to identify instances where the
  event consumers are not the expected "NTEventLogEventConsumer." This activity is significant because it suggests an attacker is attempting to achieve persistence by running malicious scripts or binaries
  in response to specific system events. If confirmed malicious, this could lead to severe impacts such as data theft, ransomware deployment, or other damaging outcomes. Investigate the associated scripts
  or binaries to identify the source of the attack.
tags:
- attack.t1047
date: '2020-04-29'
original_spl: |-
  `wmi`
  EventCode=5861
  Binding
  | rex field=Message "Consumer =\s+(?<consumer>[^;|^$]+)"
  | search consumer!="NTEventLogEventConsumer=\"SCM Event Log Consumer\""
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by ComputerName, consumer, Message
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | rename ComputerName as dest
  | `wmi_permanent_event_subscription_filter`
splunk_rule_id: 71bfdb13-f200-4c6c-b2c9-a2e07adf437d
splunk_rule_type: TTP
logsource:
  product: windows
  service: wmi
detection:
  selection_0:
    EventID: 5861
  condition: selection_0
