title: WMI Temporary Event Subscription
id: 38cbd42c-1098-41bb-99cf-9d6d2b296d83
status: experimental
level: medium
author: Rico Valdez, Splunk
description: The following analytic detects the creation of WMI temporary event subscriptions. It leverages Windows Event Logs, specifically EventCode 5860, to identify these activities. This detection
  is significant because attackers often use WMI to execute commands, gather information, or maintain persistence within a compromised system. If confirmed malicious, this activity could allow an attacker
  to execute arbitrary code, escalate privileges, or persist in the environment. Analysts should review the specific WMI queries and assess their intent, considering potential false positives from legitimate
  administrative tasks.
tags:
- attack.t1047
date: '2020-04-29'
original_spl: |-
  `wmi`
  EventCode=5860
  Temporary
  | rex field=Message "NotificationQuery =\s+(?<query>[^;|^$]+)"
  | search
      query!="FROM Win32_ProcessStartTrace WHERE ProcessName = 'wsmprovhost.exe'"
      AND
      query!="FROM __InstanceOperationEvent WHERE TargetInstance ISA 'AntiVirusProduct' OR TargetInstance ISA 'FirewallProduct' OR TargetInstance ISA 'AntiSpywareProduct'"
  | stats count min(_time) as firstTime
                max(_time) as lastTime
    by ComputerName, query
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `wmi_temporary_event_subscription_filter`
splunk_rule_id: 38cbd42c-1098-41bb-99cf-9d6d2b296d83
splunk_rule_type: TTP
logsource:
  product: windows
  service: wmi
detection:
  selection_0:
    EventID: 5860
  condition: selection_0
