title: Windows Create Local Account
id: 3fb2e8e3-7bc0-4567-9722-c5ab9f8595eb
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of a new local user account on a Windows system. It leverages Windows Security Audit logs, specifically event ID 4720, to identify this activity.
  Monitoring the creation of local accounts is crucial for a SOC as it can indicate unauthorized access or lateral movement within the network. If confirmed malicious, this activity could allow an attacker
  to establish persistence, escalate privileges, or gain unauthorized access to sensitive systems and data.
references:
- https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
tags:
- attack.t1136.001
date: '2022-10-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    values(All_Changes.result_id) as result_id
    count min(_time) as firstTime
          max(_time) as lastTime
  from datamodel=Change where
  All_Changes.result_id=4720
  by All_Changes.user All_Changes.dest All_Changes.result All_Changes.action
  | `drop_dm_object_name("All_Changes")`
  | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)`
  | `windows_create_local_account_filter`
splunk_rule_id: 3fb2e8e3-7bc0-4567-9722-c5ab9f8595eb
splunk_rule_type: Anomaly
logsource:
  category: change
  product: windows
detection:
  selection_0:
    All_Changes.result_id: 4720
  condition: selection_0
