title: GitHub Enterprise Disable Dependabot
id: 787dd1c1-eb3a-4a31-8e8c-2ad24b214bc8
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects when a user disables Dependabot security features within a GitHub repository. Dependabot helps automatically identify and fix security vulnerabilities in dependencies.
  The detection monitors GitHub Enterprise logs for configuration changes that disable Dependabot functionality. This behavior could indicate an attacker attempting to prevent the automatic detection of
  vulnerable dependencies, which would allow them to exploit known vulnerabilities that would otherwise be patched. For a SOC, identifying the disabling of security features like Dependabot is critical
  as it may be a precursor to supply chain attacks where attackers exploit vulnerable dependencies. The impact could be severe if vulnerabilities remain unpatched, potentially leading to code execution,
  data theft, or other compromises through the software supply chain.
references:
- https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
- https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
tags:
- attack.t1685
- attack.t1195
date: '2025-01-15'
original_spl: |-
  `github_enterprise` action=repository_vulnerability_alerts.disable
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor, actor_id, actor_ip,
         actor_is_bot, actor_location.country_code, business,
         business_id, org, org_id,
         repo, repo_id, user,
         user_agent, user_id, action
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `github_enterprise_disable_dependabot_filter`
splunk_rule_id: 787dd1c1-eb3a-4a31-8e8c-2ad24b214bc8
splunk_rule_type: Anomaly
logsource:
  product: github
  service: enterprise
detection:
  selection_0:
    action: repository_vulnerability_alerts.disable
  condition: selection_0
