title: GitHub Organizations Delete Branch Ruleset
id: 8e454f64-4bd6-45e6-8a94-1b482593d721
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects when branch rulesets are deleted in GitHub Organizations. The detection monitors GitHub Organizations audit logs for branch ruleset deletion events by tracking
  actor details, repository information, and associated metadata. For a SOC, identifying deleted branch rulesets is critical as it could indicate attempts to bypass code review requirements and security
  controls. Branch rulesets are essential security controls that enforce code review, prevent force pushes, and maintain code quality. Disabling these protections could allow malicious actors to directly
  push unauthorized code changes or backdoors to protected branches. The impact of disabled branch protection includes potential code tampering, bypass of security reviews, introduction of vulnerabilities
  or malicious code, and compromise of software supply chain integrity. This activity could be part of a larger attack chain where an adversary first disables security controls before attempting to inject
  malicious code.
references:
- https://splunk.github.io/splunk-add-on-for-github-audit-log-monitoring/Install/
- https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
tags:
- attack.t1685
- attack.t1195
date: '2025-01-15'
original_spl: |-
  `github_organizations` vendor_action=repository_ruleset.destroy
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor, actor_id, actor_ip,
         actor_is_bot, actor_location.country_code, business,
         business_id, org, org_id,
         repo, repo_id, user_agent,
         vendor_action, ruleset_name
    | eval user=actor
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `github_organizations_delete_branch_ruleset_filter`
splunk_rule_id: 8e454f64-4bd6-45e6-8a94-1b482593d721
splunk_rule_type: Anomaly
logsource:
  product: github
  service: audit
detection:
  selection_0:
    vendor_action: repository_ruleset.destroy
  condition: selection_0
