title: GitHub Enterprise Remove Organization
id: 94cb89aa-aec1-4585-91b1-affcdacf357e
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects when a user removes an organization from GitHub Enterprise. The detection monitors GitHub Enterprise audit logs for organization deletion events, which could
  indicate unauthorized removal of critical business resources. For a SOC, identifying organization removals is crucial as it may signal account compromise, insider threats, or malicious attempts to disrupt
  business operations by deleting entire organizational structures. The impact could be severe, potentially resulting in loss of source code, repositories, team structures, access controls, and other critical
  organizational assets. This disruption could halt development workflows, cause data loss, and require significant effort to restore from backups if available. Additionally, unauthorized organization removal
  could be part of a larger attack campaign aimed at destroying or compromising enterprise assets.
references:
- https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
- https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
tags:
- attack.t1485
- attack.t1195
date: '2025-01-15'
original_spl: |-
  `github_enterprise` action=business.remove_organization
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor, actor_id, actor_is_bot,
         actor_location.country_code, business, business_id,
         org, org_id, user_agent,
         action
    | eval user=actor
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `github_enterprise_remove_organization_filter`
splunk_rule_id: 94cb89aa-aec1-4585-91b1-affcdacf357e
splunk_rule_type: Anomaly
logsource:
  product: github
  service: enterprise
detection:
  selection_0:
    action: business.remove_organization
  condition: selection_0
