title: GitHub Organizations Disable 2FA Requirement
id: 3ed0d6ba-4791-4fa8-a1ef-403e438c7033
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects when two-factor authentication (2FA) requirements are disabled in GitHub Organizations. The detection monitors GitHub Organizations audit logs for 2FA requirement
  changes by tracking actor details, organization information, and associated metadata. For a SOC, identifying disabled 2FA requirements is critical as it could indicate attempts to weaken account security
  controls. Two-factor authentication is a fundamental security control that helps prevent unauthorized access even if passwords are compromised. Disabling 2FA requirements could allow attackers to more
  easily compromise accounts through password-based attacks. The impact of disabled 2FA includes increased risk of account takeover, potential access to sensitive code and intellectual property, and compromise
  of the software supply chain. This activity could be part of a larger attack chain where an adversary first disables security controls before attempting broader account compromises.
references:
- https://splunk.github.io/splunk-add-on-for-github-audit-log-monitoring/Install/
- https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
tags:
- attack.t1685
- attack.t1195
date: '2025-01-15'
original_spl: |-
  `github_organizations` vendor_action=org.disable_two_factor_requirement
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor, actor_id, actor_ip,
         actor_is_bot, actor_location.country_code, business,
         business_id, org, org_id,
         user_agent, vendor_action
    | eval user=actor
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `github_organizations_disable_2fa_requirement_filter`
splunk_rule_id: 3ed0d6ba-4791-4fa8-a1ef-403e438c7033
splunk_rule_type: Anomaly
logsource:
  product: github
  service: audit
detection:
  selection_0:
    vendor_action: org.disable_two_factor_requirement
  condition: selection_0
