title: GitHub Enterprise Disable Audit Log Event Stream
id: 7bc111cc-7f1b-4be7-99fa-50cf8d2e7564
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects when a user disables audit log event streaming in GitHub Enterprise. The detection monitors GitHub Enterprise audit logs for configuration changes that disable
  the audit log streaming functionality, which is used to send audit events to security monitoring platforms. This behavior could indicate an attacker attempting to prevent their malicious activities from
  being logged and detected by disabling the audit trail. For a SOC, identifying the disabling of audit logging is critical as it may be a precursor to other attacks where adversaries want to operate undetected.
  The impact could be severe as organizations lose visibility into user actions, configuration changes, and security events within their GitHub Enterprise environment, potentially allowing attackers to
  perform malicious activities without detection. This creates a significant blind spot in security monitoring and incident response capabilities.
references:
- https://www.googlecloudcommunity.com/gc/Community-Blog/Monitoring-for-Suspicious-GitHub-Activity-with-Google-Security/ba-p/763610
- https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-streaming-to-splunk
tags:
- attack.t1685.002
- attack.t1195
date: '2025-01-15'
original_spl: |-
  `github_enterprise` action=audit_log_streaming.destroy
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor, actor_id, actor_ip,
         actor_is_bot, actor_location.country_code, business,
         business_id, user_agent, action
    | eval user=actor
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `github_enterprise_disable_audit_log_event_stream_filter`
splunk_rule_id: 7bc111cc-7f1b-4be7-99fa-50cf8d2e7564
splunk_rule_type: Anomaly
logsource:
  product: github
  service: enterprise
detection:
  selection_0:
    action: audit_log_streaming.destroy
  condition: selection_0
