title: ESXi VM Exported via Remote Tool
id: 2e155547-aaac-49d3-b0ef-ceabc31fd364
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies the use of a remote tool to download virtual machine disk files from a datastore. The NFC protocol is used by management tools to transfer files to and from ESXi hosts,
  but it can also be abused by attackers or insiders to exfiltrate full virtual disk images
tags:
- attack.t1005
date: '2025-07-11'
original_spl: '`esxi_syslog` Message="*File download from path*" Message="*was initiated from*" | rex field=_raw "from path ''\[(?<Datastore>[^\]]+)\](?<VMPath>[^'']+)''" | rex field=_raw "initiated from
  ''(?<InitiatorTool>[^/]+)/(?<ToolVersion>[^@]+)@(?<InitiatorIP>\d{1,3}(?:\.\d{1,3}){3})''" | rex field=_raw "Z (?<dest>[\w\.]+)\s" | stats min(_time) as firstTime max(_time) as lastTime count by Datastore
  VMPath InitiatorTool ToolVersion InitiatorIP dest | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `esxi_vm_exported_via_remote_tool_filter`'
splunk_rule_id: 2e155547-aaac-49d3-b0ef-ceabc31fd364
splunk_rule_type: TTP
logsource:
  category: application
detection:
  selection_0:
    Message|contains: File download from path
  selection_1:
    Message|contains: was initiated from
  condition: selection_0 and selection_1
