title: ESXi System Clock Manipulation
id: 910df401-b215-4675-88c5-2ad7b06d82a5
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies a significant change to the system clock on an ESXi host, which may indicate an attempt to manipulate timestamps and evade detection or forensic analysis
tags:
- attack.t1070.006
date: '2025-07-11'
original_spl: '`esxi_syslog` Message="*NTPClock*" AND Message="*system clock stepped*" | rex field=_raw "stepped to (?<epoch_time>\d+\.\d+),.+delta\s(?<delta>\d+)\s" | rex field=_raw "Z (?<dest>[\w\.]+)\s"
  | eval epoch_time=tonumber(epoch_time) | eval delta=tonumber(delta) | eval event_time=round(_time, 0) | eval direction=if(epoch_time < event_time, "backward", "forward") | eval original_time=if(direction=="backward",
  epoch_time + delta, epoch_time - delta) | eval stepped_to_str=strftime(epoch_time, "%Y-%m-%d %H:%M:%S") | eval original_time_str=strftime(original_time, "%Y-%m-%d %H:%M:%S") | stats min(_time) as firstTime
  max(_time) as lastTime count by dest direction original_time_str stepped_to_str epoch_time delta | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `esxi_system_clock_manipulation_filter`'
splunk_rule_id: 910df401-b215-4675-88c5-2ad7b06d82a5
splunk_rule_type: TTP
logsource:
  category: application
detection:
  selection_0:
    Message|contains: NTPClock
  selection_1:
    Message|contains: system clock stepped
  condition: selection_0 and selection_1
