title: ESXi Lockdown Mode Disabled
id: 07c0d28a-9a9b-409f-8d4b-65355bd19ead
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies when Lockdown Mode is disabled on an ESXi host, which can indicate that a threat actor is attempting to weaken host security controls. Disabling Lockdown Mode allows
  broader remote access via SSH or the host client and may precede further malicious actions such as data exfiltration, lateral movement, or VM tampering.
tags:
- attack.T1685
date: '2025-07-11'
logsource:
  category: application
detection:
  selection_0:
    Message|contains:
    - '*lockdownmode.disabled*'
    - '*Administrator access to the host has been enabled*'
  condition: selection_0
