title: ESXi Shared or Stolen Root Account
id: 1bc8f235-5d7c-457c-95ca-5e92edcb52ea
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection monitors for signs of a shared or potentially compromised root account on ESXi hosts by tracking the number of unique IP addresses logging in as root within a short time window.
  Multiple logins from different IPs in a brief period may indicate credential misuse, lateral movement, or account compromise.
references:
- https://detect.fyi/detecting-and-responding-to-esxi-compromise-with-splunk-f33998ce7823
tags:
- attack.t1078
date: '2025-07-11'
original_spl: '`esxi_syslog` Message="*root*" Message="*logged in*" NOT Message="*root@127.0.0.1*" | rex field=_raw "root@(?<SrcIpAddr>\d{1,3}(?:\.\d{1,3}){3})" | rex field=_raw "Z (?<dest>[\w\.]+)\s" |
  bin _time span=15m | stats min(_time) as firstTime max(_time) as lastTime dc(SrcIpAddr) AS distinct_ip_count values(SrcIpAddr) AS SrcIps by dest | where distinct_ip_count > 1 | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `esxi_shared_or_stolen_root_account_filter`'
splunk_rule_id: 1bc8f235-5d7c-457c-95ca-5e92edcb52ea
splunk_rule_type: Anomaly
logsource:
  category: application
detection:
  selection_0:
    Message|contains: root
  selection_1:
    Message|contains: logged in
  filter_2:
    Message|contains: '*root@127.0.0.1*'
  condition: (selection_0 and selection_1) and not (filter_2)
