title: ESXi Firewall Disabled
id: e321804c-8eb5-42f2-a843-36b289a6c6b2
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies when the ESXi firewall is disabled or set to permissive mode, which can expose the host to unauthorized access and network-based attacks. Such changes are often a
  precursor to lateral movement, data exfiltration, or the installation of malicious software by a threat actor.
tags:
- attack.T1686
date: '2025-07-11'
logsource:
  category: application
detection:
  selection_0:
    Message|contains: '*network firewall set*'
  selection_1:
    Message|contains: '*enabled f*'
  condition: selection_0 and selection_1
