title: ESXi Sensitive Files Accessed
id: 6fa0073d-6ca0-4f93-913d-fb420c9de15b
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies access to sensitive system and configuration files on an ESXi host, including authentication data, service configurations, and VMware-specific management settings.
  Interaction with these files may indicate adversary reconnaissance, credential harvesting, or preparation for privilege escalation, lateral movement, or persistence.
tags:
- attack.t1003.008
- attack.t1005
date: '2025-07-11'
original_spl: '`esxi_syslog` Message="*shell[*" Message IN ("*/etc/shadow*","*/etc/vmware/hostd/hostd.xml*", "*/etc/vmware/vpxa/vpxa.cfg*","*/etc/sfcb/sfcb.cfg*","*/etc/security/*", "*/etc/likewise/krb5-affinity.conf*","*/etc/vmware-vpx/vcdb.properties*")
  | rex field=_raw "\]: \[(?<user>\w+)\]:(?<command>.+)" | rex field=_raw "Z (?<dest>[\w\.]+)\s" | stats min(_time) as firstTime max(_time) as lastTime count by dest user command | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `esxi_sensitive_files_accessed_filter`'
splunk_rule_id: 6fa0073d-6ca0-4f93-913d-fb420c9de15b
splunk_rule_type: TTP
logsource:
  category: application
detection:
  selection_0:
    Message|contains: shell[
  selection_1:
    Message|contains:
    - /etc/shadow
    - /etc/vmware/hostd/hostd.xml
    - /etc/vmware/vpxa/vpxa.cfg
    - /etc/sfcb/sfcb.cfg
    - /etc/security/
    - /etc/likewise/krb5-affinity.conf
    - /etc/vmware-vpx/vcdb.properties
  condition: selection_0 and selection_1
