title: ESXi SSH Enabled
id: b8003567-c5b6-445b-8966-ecdacc81c24d
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies SSH being enabled on ESXi hosts, which can be an early indicator of malicious activity. Threat actors often use SSH to gain persistent remote access after compromising
  credentials or exploiting vulnerabilities.
tags:
- attack.t1021.004
date: '2025-07-11'
original_spl: '`esxi_syslog` Message="*SSH access has been enabled" | rex field=_raw "Z (?<dest>[\w\.]+)\s" | stats min(_time) as firstTime max(_time) as lastTime count by dest Message | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `esxi_ssh_enabled_filter`'
splunk_rule_id: b8003567-c5b6-445b-8966-ecdacc81c24d
splunk_rule_type: TTP
logsource:
  category: application
detection:
  selection_0:
    Message|endswith: SSH access has been enabled
  condition: selection_0
