title: ESXi Shell Access Enabled
id: 15e79d0a-c659-42fd-9668-94108528f2ec
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies when the ESXi Shell is enabled on a host, which may indicate that a malicious actor is preparing to execute commands locally or establish persistent access. Enabling
  the shell outside of approved maintenance windows can be a sign of compromise or unauthorized administrative activity.
tags:
- attack.T1021
date: '2025-07-11'
logsource:
  category: application
detection:
  selection_0:
    Message|contains: '*ESXi Shell*'
  selection_1:
    Message|contains: '*has been enabled*'
  condition: selection_0 and selection_1
