title: ESXi SSH Enabled
id: b8003567-c5b6-445b-8966-ecdacc81c24d
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies SSH being enabled on ESXi hosts, which can be an early indicator of malicious activity. Threat actors often use SSH to gain persistent remote access after compromising
  credentials or exploiting vulnerabilities.
tags:
- attack.T1021_004
date: '2025-07-11'
logsource:
  category: application
detection:
  selection_0:
    Message|contains: '*SSH access has been enabled'
  condition: selection_0
