title: ESXi Reverse Shell Patterns
id: ee8b16a4-118e-4dd7-af4b-835530415610
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection looks for reverse shell string patterns on an ESXi host, which may indicate that a threat actor is attempting to establish remote control over the system.
tags:
- attack.t1059
date: '2025-07-11'
original_spl: '`esxi_syslog` Message IN ("*bash -i >&*","*/dev/tcp/*","*/dev/udp/*", "*/socat exec:*","*socket(S,PF_INET*") OR (Message="*python -c*" AND Message="*import socket*") | rex field=_raw "Z (?<dest>[\w\.]+)\s"
  | stats min(_time) as firstTime max(_time) as lastTime count by dest Message | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `esxi_reverse_shell_patterns_filter`'
splunk_rule_id: ee8b16a4-118e-4dd7-af4b-835530415610
splunk_rule_type: TTP
logsource:
  category: application
detection:
  selection_0:
    Message:
    - '*bash -i >&*'
    - '*/dev/tcp/*'
    - '*/dev/udp/*'
    - '*/socat exec:*'
    - '*socket(S,PF_INET*'
  selection_1:
    Message|contains: '*python -c*'
  condition: selection_0 and selection_1
