title: ESXi Sensitive Files Accessed
id: 6fa0073d-6ca0-4f93-913d-fb420c9de15b
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies access to sensitive system and configuration files on an ESXi host, including authentication data, service configurations, and VMware-specific management settings.
  Interaction with these files may indicate adversary reconnaissance, credential harvesting, or preparation for privilege escalation, lateral movement, or persistence.
tags:
- attack.T1003_008
- attack.T1005
date: '2025-07-11'
logsource:
  category: application
detection:
  selection_0:
    Message|contains: '*shell[*'
  selection_1:
    Message|contains:
    - '*/etc/shadow*'
    - '*/etc/vmware/hostd/hostd.xml*'
    - '*/etc/vmware/vpxa/vpxa.cfg*'
    - '*/etc/sfcb/sfcb.cfg*'
    - '*/etc/security/*'
    - '*/etc/likewise/krb5-affinity.conf*'
    - '*/etc/vmware-vpx/vcdb.properties*'
  condition: selection_0 and selection_1
