title: Ollama Abnormal Service Crash Availability Attack
id: 327fa152-9b56-4e4e-bc0b-2795d4068afa
status: experimental
level: medium
author: Rod Soto
description: Detects critical service crashes, fatal errors, and abnormal process terminations in Ollama that may indicate exploitation attempts, resource exhaustion attacks, malicious input triggering
  unhandled exceptions, or deliberate denial of service attacks designed to disrupt AI model availability and degrade system stability.
references:
- https://github.com/rosplk/ta-ollama
tags:
- attack.T1489
date: '2025-10-13'
logsource:
  category: application
detection:
  selection_0:
    level: ERROR
  selection_1:
    level: FATAL
  condition: selection_0 and selection_1
