title: Splunk Enterprise KV Store Incorrect Authorization
id: 8f0e8380-a835-4f2b-b749-9ce119364df0
status: deprecated
level: medium
author: Rod Soto, Eric McGinnis, Chase Franklin
description: The following analytic detects unauthorized attempts to reload Splunk KV Store collections via the REST API. It leverages internal index logs to identify POST requests to the `/servicesNS/nobody/search/admin/collections-conf/_reload`
  endpoint, focusing on status codes starting with '2'. This activity is significant as it may indicate improper permission handling, potentially leading to unauthorized deletion of KV Store collections.
  If confirmed malicious, this could result in data loss or unauthorized data manipulation, impacting the integrity and availability of critical Splunk data.
references:
- https://advisory.splunk.com/advisories/SVD-2024-0105
tags:
- attack.T1548
date: '2024-01-22'
logsource:
  category: application
detection:
  selection_0:
    cs-uri: /servicesNS/nobody/search/admin/collections-conf/_reload
  selection_1:
    sc-status: 2
  selection_2:
    method: POST
  selection_3:
    User|contains: '*'
  selection_4:
    file: _reload
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
