title: Splunk Path Traversal In Splunk App For Lookup File Edit
id: 8ed58987-738d-4917-9e44-b8ef6ab948a6
status: deprecated
level: medium
author: Rod Soto, Eric McGinnis
description: The following analytic identifies path traversal attempts in the Splunk App for Lookup File Editing. It detects specially crafted web requests targeting lookup files by analyzing the `uri_query`
  field in the `_internal` index. This activity is significant because it allows low-privilege users to read and write to restricted areas of the Splunk installation directory, potentially accessing sensitive
  files like password hashes. If confirmed malicious, this could lead to unauthorized access, data breaches, and further exploitation of the Splunk environment.
references:
- https://advisory.splunk.com/
tags:
- attack.T1083
date: '2023-06-01'
logsource:
  category: application
detection:
  selection_0:
    uri_query|contains: '*lookup_file*'
  condition: selection_0
