title: Zoom Rare Audio Devices
id: 9fdbf709-4c46-4819-9fb6-98b2d72059ed
status: experimental
level: medium
author: Marissa Bower, Raven Tait
description: Detects rare audio devices from Zoom logs. Actors performing Remote Employment Fraud (REF) typically use unusual device information compared to a majority of employees. Detecting this activity
  requires careful analysis, regular review, and a thorough understanding of the audio and video devices commonly used within your environment.
tags:
- attack.T1123
date: '2025-06-12'
logsource:
  category: application
detection:
  selection_0:
    speaker|contains: '*'
  condition: selection_0
