title: Windows AppLocker Block Events
id: e369afe8-cd35-47a3-9c1e-d813efc1f7dd
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects attempts to bypass application restrictions by identifying Windows AppLocker policy violations. It leverages Windows AppLocker event logs, specifically EventCodes
  8007, 8004, 8022, 8025, 8029, and 8040, to pinpoint blocked actions. This activity is significant for a SOC as it highlights potential unauthorized application executions, which could indicate malicious
  intent or policy circumvention. If confirmed malicious, this activity could allow an attacker to execute unauthorized applications, potentially leading to further system compromise or data exfiltration.
references:
- https://attack.mitre.org/techniques/T1218
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/applocker/using-event-viewer-with-applocker
- https://learn.microsoft.com/en-us/windows/security/application-security/application-control/windows-defender-application-control/operations/querying-application-control-events-centrally-using-advanced-hunting
tags:
- attack.t1218
date: '2024-04-17'
original_spl: |-
  `applocker`  EventCode IN (8007, 8004, 8022, 8025, 8029, 8040)
    | spath input=UserData_Xml
    | rename RuleAndFileData.* as *, TargetUser as user, Computer as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest, PolicyName, RuleId,
         user, TargetProcessId, FilePath,
         FullFilePath, EventCode
    | lookup applockereventcodes EventCode OUTPUT Description
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_applocker_block_events_filter`
splunk_rule_id: e369afe8-cd35-47a3-9c1e-d813efc1f7dd
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: applocker
detection:
  selection_0:
    EventID:
    - 8007
    - 8004
    - 8022
    - 8025
    - 8029
    - 8040
  condition: selection_0
