title: Batch File Write to System32
id: 503d17cb-9eab-4cf8-a20e-01d5c6987ae3
status: stable
level: medium
author: Steven Dick, Michael Haag, Rico Valdez, Splunk
description: The following analytic detects the creation of a batch file (.bat) within the Windows system directory tree, specifically in the System32 or SysWOW64 folders. It leverages data from the Endpoint
  datamodel, focusing on process and filesystem events to identify this behavior. This activity is significant because writing batch files to system directories can be indicative of malicious intent, such
  as persistence mechanisms or system manipulation. If confirmed malicious, this could allow an attacker to execute arbitrary commands with elevated privileges, potentially compromising the entire system.
tags:
- attack.T1204_002
date: '2020-04-29'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains:
    - '*\system32\*'
    - '*\syswow64\*'
  selection_1:
    Image|contains: '*.bat'
  condition: selection_0 and selection_1
