title: Detect RTLO In File Name
id: 468b7e11-d362-43b8-b6ec-7a2d3b246678
status: stable
level: medium
author: Steven Dick
description: |
  The following analytic identifies the use of the right-to-left override
  (RTLO) character in file names. It leverages data from the Endpoint.Filesystem datamodel,
  specifically focusing on file creation events and file names containing the RTLO
  character (U+202E). This activity is significant because adversaries use RTLO to
  disguise malicious files as benign by reversing the text that follows the character.
  If confirmed malicious, this technique can deceive users and security tools, leading
  to the execution of harmful files and potential system compromise.
references:
- https://attack.mitre.org/techniques/T1036/002/
- https://resources.infosecinstitute.com/topic/spoof-using-right-to-left-override-rtlo-technique-2/
- https://www.trendmicro.com/en_us/research/17/f/following-trail-blacktech-cyber-espionage-campaigns.html
tags:
- attack.T1036_002
date: '2023-05-01'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    file_name!: unknown
  condition: selection_0
