title: Detect Certipy File Modifications
id: 7e3df743-b1d8-4631-8fa8-bd5819688876
status: stable
level: medium
author: Steven Dick
description: The following analytic detects the use of the Certipy tool to enumerate Active Directory Certificate Services (AD CS) environments by identifying unique file modifications. It leverages endpoint
  process and filesystem data to spot the creation of files with specific names or extensions associated with Certipy's information gathering and exfiltration activities. This activity is significant as
  it indicates potential reconnaissance and data exfiltration efforts by an attacker. If confirmed malicious, this could lead to unauthorized access to sensitive AD CS information, enabling further attacks
  or privilege escalation within the network.
references:
- https://github.com/ly4k/Certipy
tags:
- attack.T1649
- attack.T1560
date: '2023-07-28'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - '*_certipy.zip'
    - '*_certipy.txt'
    - '*_certipy.json'
    - '*.ccache'
  condition: selection_0
