title: Detect AzureHound File Modifications
id: 1c34549e-c31b-11eb-996b-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of specific AzureHound-related files, such as `*-azurecollection.zip` and various `.json` files, on disk. It leverages data from the Endpoint.Filesystem
  datamodel, focusing on file creation events with specific filenames. This activity is significant because AzureHound is a tool used to gather information about Azure environments, similar to SharpHound
  for on-premises Active Directory. If confirmed malicious, this activity could indicate an attacker is collecting sensitive Azure environment data, potentially leading to further exploitation or privilege
  escalation within the cloud infrastructure.
references:
- https://posts.specterops.io/introducing-bloodhound-4-0-the-azure-update-9b2b26c5e350
- https://github.com/BloodHoundAD/Legacy-AzureHound.ps1/blob/master/AzureHound.ps1
tags:
- attack.T1069_001
- attack.T1069_002
- attack.T1087_001
- attack.T1087_002
- attack.T1482
date: '2021-06-03'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - '*-azurecollection.zip'
    - '*-azprivroleadminrights.json'
    - '*-azglobaladminrights.json'
    - '*-azcloudappadmins.json'
    - '*-azapplicationadmins.json'
  condition: selection_0
