title: Detect SharpHound File Modifications
id: 42b4b438-beed-11eb-ba1d-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of files typically associated with SharpHound, a reconnaissance tool used for gathering domain and trust data. It leverages file modification events
  from the Endpoint.Filesystem data model, focusing on default file naming patterns like `*_BloodHound.zip` and various JSON files. This activity is significant as it indicates potential domain enumeration,
  which is a precursor to more targeted attacks. If confirmed malicious, an attacker could gain detailed insights into the domain structure, facilitating lateral movement and privilege escalation.
references:
- https://attack.mitre.org/software/S0521/
- https://thedfirreport.com/?s=bloodhound
- https://github.com/BloodHoundAD/BloodHound/tree/master/Collectors
- https://github.com/BloodHoundAD/SharpHound3
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1059.001/T1059.001.md#atomic-test-2---run-bloodhound-from-local-disk
tags:
- attack.T1069_001
- attack.T1069_002
- attack.T1087_001
- attack.T1087_002
- attack.T1482
date: '2021-06-03'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - '*bloodhound.zip'
    - '*_computers.json'
    - '*_gpos.json'
    - '*_domains.json'
    - '*_users.json'
    - '*_groups.json'
    - '*_ous.json'
    - '*_containers.json'
  condition: selection_0
