title: Detect RTLO In File Name
id: 468b7e11-d362-43b8-b6ec-7a2d3b246678
status: stable
level: medium
author: Steven Dick
description: |
  The following analytic identifies the use of the right-to-left override
  (RTLO) character in file names. It leverages data from the Endpoint.Filesystem datamodel,
  specifically focusing on file creation events and file names containing the RTLO
  character (U+202E). This activity is significant because adversaries use RTLO to
  disguise malicious files as benign by reversing the text that follows the character.
  If confirmed malicious, this technique can deceive users and security tools, leading
  to the execution of harmful files and potential system compromise.
references:
- https://attack.mitre.org/techniques/T1036/002/
- https://resources.infosecinstitute.com/topic/spoof-using-right-to-left-override-rtlo-technique-2/
- https://www.trendmicro.com/en_us/research/17/f/following-trail-blacktech-cyber-espionage-campaigns.html
tags:
- attack.t1036.002
date: '2023-05-01'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
          values(Filesystem.file_create_time) as file_create_time

  from datamodel=Endpoint.Filesystem where Filesystem.file_name!=unknown

  by Filesystem.action Filesystem.dest Filesystem.file_access_time
     Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
     Filesystem.file_name Filesystem.file_path Filesystem.file_acl
     Filesystem.file_size Filesystem.process_guid Filesystem.process_id
     Filesystem.user Filesystem.vendor_product

  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | regex file_name = "\\x{202E}"
  | rex field=file_name "(?<RTLO_file_1>.+)(?<RTLO_exist_file>\\x{202E})(?<RTLO_file_2>.+)"
  | eval file_name_with_RTLO=file_name
  | eval file_name=RTLO_file_1.RTLO_file_2
  | fields - RTLO*
  | `detect_rtlo_in_file_name_filter`
splunk_rule_id: 468b7e11-d362-43b8-b6ec-7a2d3b246678
splunk_rule_type: TTP
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image: unknown
  condition: selection_0
