title: Executables Or Script Creation In Temp Path
id: e0422b71-2c05-4f32-8754-01fb415f49c9
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic identifies the creation of executables or scripts in temporary file paths on Windows systems. It leverages the Endpoint.Filesystem data set to detect files with specific extensions (e.g., .exe, .dll, .ps1) created in temporary directories (e.g., \windows\Temp\, \AppData\Local\Temp\).
  This activity can be significant as adversaries often use these paths to evade detection and maintain persistence.
  If confirmed malicious, this behavior could allow attackers to execute unauthorized code, escalate privileges, or persist within the environment, posing a significant security threat.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://twitter.com/pr0xylife/status/1590394227758104576
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
- attack.T1036
date: '2021-05-07'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    action: created
  selection_1:
    Image|contains:
    - '*.bat'
    - '*.cmd'
    - '*.com'
    - '*.dll'
    - '*.exe'
    - '*.js'
    - '*.msc'
    - '*.pif'
    - '*.ps1'
    - '*.sys'
    - '*.vbe'
    - '*.vbs'
  selection_2:
    TargetFilename|contains:
    - '*:\Temp\*'
    - '*:\Windows\Temp\*'
    - '*\AppData\Local\Temp\*'
  filter_3:
    TargetFilename: '*\__PSScriptPolicyTest_*'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
