title: Executables Or Script Creation In Suspicious Path
id: a7e3f0f0-ae42-11eb-b245-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the creation of executables or scripts in suspicious file paths on Windows systems. It leverages the Endpoint.Filesystem dataset to detect files with specific
  extensions (e.g., .exe, .dll, .ps1) created in uncommon directories (e.g., \windows\fonts\, \users\public\). This activity can be significant as adversaries often use these paths to evade detection and
  maintain persistence. If confirmed malicious, this behavior could allow attackers to execute unauthorized code, escalate privileges, or persist within the environment, posing a significant security threat.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://twitter.com/pr0xylife/status/1590394227758104576
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
- attack.t1036
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
  from datamodel=Endpoint.Filesystem where
  Filesystem.file_name IN (
      "*.bat",
      "*.cmd",
      "*.com",
      "*.dll",
      "*.exe",
      "*.js",
      "*.msc",
      "*.pif",
      "*.ps1",
      "*.sys",
      "*.vbe",
      "*.vbs"
  )
  Filesystem.file_path IN (
      "*:\\PerfLogs\\*",
      "*:\\Users\\Administrator\\Music\\*",
      "*:\\Users\\Default\\*",
      "*:\\Users\\Public\\*",
      "*:\\Windows\\debug\\*",
      "*:\\Windows\\fonts\\*",
      "*:\\Windows\\Media\\*",
      "*:\\Windows\\repair\\*",
      "*:\\Windows\\servicing\\*",
      "*\\inetpub\\*",
      "*\\Microsoft\\Windows\\Libraries\\*",
      "*Recycle.bin*"
  )
  by Filesystem.action Filesystem.dest Filesystem.file_access_time
     Filesystem.file_create_time Filesystem.file_hash
     Filesystem.file_modify_time Filesystem.file_name
     Filesystem.file_path Filesystem.file_acl Filesystem.file_size
     Filesystem.process_guid Filesystem.process_id Filesystem.user
     Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `executables_or_script_creation_in_suspicious_path_filter`
splunk_rule_id: a7e3f0f0-ae42-11eb-b245-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|endswith:
    - .bat
    - .cmd
    - .com
    - .dll
    - .exe
    - .js
    - .msc
    - .pif
    - .ps1
    - .sys
    - .vbe
    - .vbs
  selection_1:
    TargetFilename|contains:
    - :\PerfLogs\
    - :\Users\Administrator\Music\
    - :\Users\Default\
    - :\Users\Public\
    - :\Windows\debug\
    - :\Windows\fonts\
    - :\Windows\Media\
    - :\Windows\repair\
    - :\Windows\servicing\
    - \inetpub\
    - \Microsoft\Windows\Libraries\
    - Recycle.bin
  condition: selection_0 and selection_1
