title: File with Samsam Extension
id: 02c6cfc2-ae66-4735-bfc7-6291da834cbf
status: stable
level: medium
author: Rico Valdez, Splunk
description: |
  The following analytic detects file writes with extensions indicative of a SamSam ransomware attack.
  It leverages file-system activity data to identify file names ending in .stubbin, .berkshire, .satoshi, .sophos, or .keyxml.
  This activity is significant because SamSam ransomware is highly destructive, leading to file encryption and ransom demands.
  If confirmed malicious, the impact includes significant financial losses, operational disruptions, and reputational damage.
  Immediate actions should include isolating affected systems, restoring files from backups, and investigating the attack source to prevent further incidents.
date: '2020-04-29'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - '*.berkshire'
    - '*.keyxml'
    - '*.satoshi'
    - '*.sophos'
    - '*.stubbin'
  condition: selection_0
