title: IcedID Exfiltrated Archived File Creation
id: 0db4da70-f14b-11eb-8043-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of suspicious files named passff.tar and cookie.tar, which are indicative of archived stolen browser information such as history and cookies on a
  machine compromised with IcedID. It leverages Sysmon EventCode 11 to identify these specific filenames. This activity is significant because it suggests that sensitive browser data has been exfiltrated,
  which could lead to further exploitation or data breaches. If confirmed malicious, this could allow attackers to access personal information, conduct further phishing attacks, or escalate their presence
  within the network.
references:
- https://www.cisecurity.org/insights/white-papers/security-primer-icedid
tags:
- attack.T1560_001
date: '2021-08-05'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*\passff.tar'
  selection_1:
    TargetFilename|contains: '*\cookie.tar'
  condition: selection_0 and selection_1
