title: Msmpeng Application DLL Side Loading
id: 8bb3f280-dd9b-11eb-84d5-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Sanjay Govind
description: The following analytic detects the suspicious creation of msmpeng.exe or mpsvc.dll in non-default Windows Defender folders. It leverages the Endpoint.Filesystem datamodel to identify instances
  where these files are created outside their expected directories. This activity is significant because it is associated with the REvil ransomware, which uses DLL side-loading to execute malicious payloads.
  If confirmed malicious, this could lead to ransomware deployment, resulting in data encryption, system compromise, and potential data loss or extortion.
references:
- https://community.sophos.com/b/security-blog/posts/active-ransomware-attack-on-kaseya-customers
tags:
- attack.T1574_001
date: '2021-07-05'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image: msmpeng.exe
  selection_1:
    Image: mpsvc.dll
  filter_2:
    TargetFilename:
    - '*\Program Files\windows defender\*'
    - '*\WinSxS\*defender-service*'
    - '*\WinSxS\Temp\*defender-service*'
  condition: (selection_0 and selection_1) and not (filter_2)
