title: Overwriting Accessibility Binaries
id: 13c2f6c3-10c5-4deb-9ba1-7c4460ebe4ae
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects modifications to Windows accessibility binaries such as sethc.exe, utilman.exe, osk.exe, Magnify.exe, Narrator.exe, DisplaySwitch.exe, and AtBroker.exe. It leverages
  filesystem activity data from the Endpoint.Filesystem data model to identify changes to these specific files. This activity is significant because adversaries can exploit these binaries to gain unauthorized
  access or execute commands without logging in. If confirmed malicious, this could allow attackers to bypass authentication mechanisms, potentially leading to unauthorized system access and further compromise
  of the environment.
tags:
- attack.T1546_008
date: '2020-04-29'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*\Windows\System32\sethc.exe*'
  selection_1:
    TargetFilename|contains: '*\Windows\System32\utilman.exe*'
  selection_2:
    TargetFilename|contains: '*\Windows\System32\osk.exe*'
  selection_3:
    TargetFilename|contains: '*\Windows\System32\Magnify.exe*'
  selection_4:
    TargetFilename|contains: '*\Windows\System32\Narrator.exe*'
  selection_5:
    TargetFilename|contains: '*\Windows\System32\DisplaySwitch.exe*'
  selection_6:
    TargetFilename|contains: '*\Windows\System32\AtBroker.exe*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6
