title: Process Writing DynamicWrapperX
id: b0a078e4-2601-11ec-9aec-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects a process writing the dynwrapx.dll file to disk and registering it in the registry. It leverages data from the Endpoint datamodel, specifically monitoring process
  and filesystem events. This activity is significant because DynamicWrapperX is an ActiveX component often used in scripts to call Windows API functions, and its presence in non-standard locations is highly
  suspicious. If confirmed malicious, this could allow an attacker to execute arbitrary code, escalate privileges, or maintain persistence within the environment. Immediate investigation of parallel processes
  and registry modifications is recommended.
references:
- https://blog.f-secure.com/hunting-for-koadic-a-com-based-rootkit/
- https://www.script-coding.com/dynwrapx_eng.html
- https://bohops.com/2018/06/28/abusing-com-registry-structure-clsid-localserver32-inprocserver32/
- https://tria.ge/210929-ap75vsddan
- https://www.virustotal.com/gui/file/cb77b93150cb0f7fe65ce8a7e2a5781e727419451355a7736db84109fa215a89
tags:
- attack.t1059
- attack.t1559.001
date: '2021-10-05'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Filesystem
    WHERE Filesystem.file_name="dynwrapx.dll"
    BY Filesystem.action Filesystem.dest Filesystem.file_access_time
       Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
       Filesystem.file_name Filesystem.file_path Filesystem.file_acl
       Filesystem.file_size Filesystem.process_guid Filesystem.process_id
       Filesystem.user Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `process_writing_dynamicwrapperx_filter`
splunk_rule_id: b0a078e4-2601-11ec-9aec-acde48001122
splunk_rule_type: Hunting
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image: dynwrapx.dll
  condition: selection_0
