title: Ryuk Test Files Detected
id: 57d44d70-28d9-4ed1-acf5-1c80ae2bbce3
status: stable
level: medium
author: Rod Soto, Jose Hernandez, Splunk
description: The following analytic identifies the presence of files containing the keyword "Ryuk" in any folder on the C drive, indicative of Ryuk ransomware activity. It leverages the Endpoint Filesystem
  data model to detect file paths matching this pattern. This activity is significant as Ryuk ransomware is known for its destructive impact, encrypting critical files and demanding ransom. If confirmed
  malicious, this could lead to significant data loss, operational disruption, and financial damage due to ransom payments and recovery efforts. Immediate investigation and response are crucial to mitigate
  potential damage.
tags:
- attack.T1486
date: '2020-11-06'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    file_path"|contains: C:\*Ryuk*
  condition: selection_0
