title: Samsam Test File Write
id: 493a879d-519d-428f-8f57-a06a0fdc107e
status: stable
level: medium
author: Rico Valdez, Splunk
description: The following analytic detects the creation of a file named "test.txt" within the Windows system directory, indicative of Samsam ransomware propagation. It leverages file-system activity data
  from the Endpoint data model, specifically monitoring file paths within the Windows System32 directory. This activity is significant as it aligns with known Samsam ransomware behavior, which uses such
  files for propagation and execution. If confirmed malicious, this could lead to ransomware deployment, resulting in data encryption, system disruption, and potential data loss. Immediate investigation
  and remediation are crucial to prevent further damage.
tags:
- attack.T1486
date: '2019-10-16'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*\windows\system32\test.txt'
  condition: selection_0
