title: Shim Database File Creation
id: 6e4c4588-ba2f-42fa-97e6-9f6f548eaa33
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects the creation of shim database files (.sdb) in default directories using the sdbinst.exe application. It leverages filesystem activity data from the Endpoint.Filesystem
  data model to identify file writes to the Windows\AppPatch\Custom directory. This activity is significant because shims can intercept and alter API calls, potentially allowing attackers to bypass security
  controls or execute malicious code. If confirmed malicious, this could lead to unauthorized code execution, privilege escalation, or persistent access within the environment.
tags:
- attack.T1546_011
date: '2019-10-16'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*Windows\AppPatch\Custom*'
  condition: selection_0
