title: Windows Credentials from Password Stores Chrome Copied in TEMP Dir
id: 4d14c86d-fdee-4393-94da-238d2706902f
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the copying of Chrome's Local State and Login Data files into temporary folders, a tactic often used by the Braodo stealer malware. These files contain encrypted
  user credentials, including saved passwords and login session details. The detection monitors for suspicious copying activity involving these specific Chrome files, particularly in temp directories where
  malware typically processes the stolen data. Identifying this behavior enables security teams to act quickly, preventing attackers from decrypting and exfiltrating sensitive browser credentials and mitigating
  the risk of unauthorized access.
references:
- https://x.com/suyog41/status/1825869470323056748
- https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
tags:
- attack.T1555_003
date: '2024-10-18'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - Local State
    - Login Data
  selection_1:
    TargetFilename|contains: '*\temp\*'
  condition: selection_0 and selection_1
