title: Windows Potential Web Shell Creation For VMware Workspace ONE
id: 7d15f645-58cc-4cb7-a9bf-2dcf15bc4b28
status: stable
level: medium
author: Raven Tait, Splunk
description: This analytic looks for evidence of web shells being created in the VMware Workspace ONE path on Windows or Linux systems, which has been actively exploited by attackers via CVE-2022-22954.
references:
- https://unit42.paloaltonetworks.com/cve-2022-22954-vmware-vulnerabilities/
tags:
- attack.t1505.003
date: '2026-05-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Filesystem where

  Filesystem.file_path IN (
      "*/vmware/horizon/workspace/webapps/*",
      "*\\vmware\\horizon\\workspace\\webapps\\*"
  )
  Filesystem.file_path="*.jsp"

  by Filesystem.dest Filesystem.file_create_time Filesystem.process_path
     Filesystem.process_guid Filesystem.process_id Filesystem.file_path Filesystem.file_name
     Filesystem.user Filesystem.vendor_product Filesystem.action

  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_potential_web_shell_creation_for_vmware_workspace_one_filter`
splunk_rule_id: 7d15f645-58cc-4cb7-a9bf-2dcf15bc4b28
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains:
    - /vmware/horizon/workspace/webapps/
    - \vmware\horizon\workspace\webapps\
  selection_1:
    TargetFilename|endswith: .jsp
  condition: selection_0 and selection_1
