title: Windows XLL File Creation Outside of Typical Location
id: 7cdbe5e2-878d-4020-94f3-52938760155e
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the creation of an XLL file outside of typical locations.
  This can indicate an attempt to abuse Excel COM objects to load and execute a malicious XLL.
references:
- https://www.bleepingcomputer.com/news/security/new-specula-tool-uses-outlook-for-remote-code-execution-in-windows/
- https://github.com/trustedsec/specula/wiki
tags:
- attack.T1129
- attack.T1059
date: '2021-09-02'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*.xll'
  filter_1:
    TargetFilename:
    - '*:\Program Files\Microsoft Office\*'
    - '*\AppData\Roaming\Microsoft\AddIns\*'
  condition: (selection_0) and not (filter_1)
