title: Windows RDP Bitmap Cache File Creation
id: 5f8671b6-07a7-425d-b3da-c39a53f2a6ae
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This detection identifies the creation of Remote Desktop Protocol (RDP) bitmap cache files on a Windows system, typically located in the user’s profile under the Terminal Server Client cache
  directory. These files (*.bmc, cache*.bin) are generated when a user initiates an RDP session using the built-in mstsc.exe client. Their presence can indicate interactive remote access activity and may
  be useful in detecting lateral movement or unauthorized RDP usage. Monitoring this behavior is especially important, as attackers may attempt to delete or suppress these artifacts to evade forensic analysis.
references:
- https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
- https://thelocalh0st.github.io/posts/rdp/
tags:
- attack.T1021_001
date: '2025-08-06'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains:
    - '*\Terminal Server Client\Cache\*.bmc'
    - '*\Terminal Server Client\Cache\cache*.bin'
  condition: selection_0
