title: Windows .Key File Creation in Root Directory
id: 90e71722-8c0f-43b4-937a-6222325976c2
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the creation of a .key file in the root directory of the system drive.
  This activity was seen with various ransomware before performing encryption of files.
references:
- https://www.cisa.gov/uscert/ncas/alerts/aa22-321a
tags:
- attack.t1486
date: '2021-09-02'
original_spl: |-
  | tstats `security_content_summariesonly`
  count min(_time) as firstTime
        max(_time) as lastTime

  from datamodel=Endpoint.Filesystem where

  Filesystem.file_name="*.key"

  by Filesystem.dest Filesystem.file_create_time
     Filesystem.process_path Filesystem.process_guid
     Filesystem.process_id Filesystem.file_path
     Filesystem.action Filesystem.file_name
     Filesystem.user Filesystem.vendor_product

  | `drop_dm_object_name(Filesystem)`
  | where match(file_path, "^[A-Za-z]:\\\\[^\\\\]+\.key$")
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows__key_file_creation_in_root_directory_filter`
splunk_rule_id: 90e71722-8c0f-43b4-937a-6222325976c2
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|endswith: .key
  condition: selection_0
