title: Windows ISO LNK File Creation
id: d7c2c09b-9569-4a9e-a8b6-6a39a99c1d32
status: stable
level: medium
author: Michael Haag, Teoderick Contreras, Splunk
description: The following analytic detects the creation of .iso.lnk files in the %USER%\AppData\Local\Temp\<random folder name>\ path, indicating that an ISO file has been mounted and accessed. This detection
  leverages the Endpoint.Filesystem data model, specifically monitoring file creation events in the Windows Recent folder. This activity is significant as it may indicate the delivery and execution of potentially
  malicious payloads via ISO files. If confirmed malicious, this could lead to unauthorized code execution, data exfiltration, or further system compromise.
references:
- https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
- https://github.com/MHaggis/notes/blob/master/utilities/ISOBuilder.ps1
- https://isc.sans.edu/diary/Recent+AZORult+activity/25120
- https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
tags:
- attack.T1204_001
- attack.T1566_001
date: '2022-03-30'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*\Microsoft\Windows\Recent\*'
  selection_1:
    Image|contains:
    - '*.iso.lnk'
    - '*.img.lnk'
    - '*.vhd.lnk'
    - '*vhdx.lnk'
  condition: selection_0 and selection_1
