title: Windows Mock Trusted Directory MSC File Creation
id: de8cc077-2dba-4060-af78-c98b3cfc5407
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the creation of MSC files within a "C:\Windows \System32" directory.
  Due to how Windows parses paths, the space causes an execution flow hijack and a malicious file will be executed instead of the standard Windows Files.
references:
- https://www.fortinet.com/blog/threat-research/fickle-stealer-distributed-via-multiple-attack-chain
tags:
- attack.t1218.014
- attack.t1548.002
- attack.t1574
date: '2026-05-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Filesystem where

  Filesystem.file_path IN (
      "C:\\Windows \\System32\\*.msc",
      "C:\\Windows \\System32\\de-DE\\*.msc",
      "C:\\Windows \\System32\\en-US\\*.msc",
      "C:\\Windows \\System32\\es-ES\\*.msc",
      "C:\\Windows \\System32\\fr-FR\\*.msc",
      "C:\\Windows \\System32\\it-IT\\*.msc",
      "C:\\Windows \\System32\\ja-JP\\*.msc",
      "C:\\Windows \\System32\\ko-KR\\*.msc",
      "C:\\Windows \\System32\\zh-CN\\*.msc",
      "C:\\Windows \\System32\\zh-TW\\*.msc"
  )

  by Filesystem.dest Filesystem.file_create_time Filesystem.process_path
     Filesystem.process_guid Filesystem.process_id Filesystem.file_path Filesystem.file_name
     Filesystem.user Filesystem.vendor_product Filesystem.action

  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_mock_trusted_directory_msc_file_creation_filter`
splunk_rule_id: de8cc077-2dba-4060-af78-c98b3cfc5407
splunk_rule_type: TTP
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename:
    - C:\Windows \System32\*.msc
    - C:\Windows \System32\de-DE\*.msc
    - C:\Windows \System32\en-US\*.msc
    - C:\Windows \System32\es-ES\*.msc
    - C:\Windows \System32\fr-FR\*.msc
    - C:\Windows \System32\it-IT\*.msc
    - C:\Windows \System32\ja-JP\*.msc
    - C:\Windows \System32\ko-KR\*.msc
    - C:\Windows \System32\zh-CN\*.msc
    - C:\Windows \System32\zh-TW\*.msc
  condition: selection_0
