title: Windows Suspicious File in EFI Volume
id: 4000d728-faaf-44d4-969b-12216f2879e1
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects data files in the EFI volume.
  This is sometimes indicative of an actor attempting to bypass secure boot through vulnerabilities such as CVE-2024-7344.
  These use vulnerable boot loaders to run malicious system firmware code.
references:
- https://www.welivesecurity.com/en/eset-research/under-cloak-uefi-secure-boot-introducing-cve-2024-7344/
- https://www.bleepingcomputer.com/news/security/new-hybridpetya-ransomware-can-bypass-uefi-secure-boot/
tags:
- attack.t1542.001
- attack.t1490
date: '2026-05-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Filesystem where

  Filesystem.file_path="*\\EFI\\Boot\\*"
  Filesystem.file_path="*.dat"

  by Filesystem.dest Filesystem.file_create_time Filesystem.process_path
     Filesystem.process_guid Filesystem.process_id Filesystem.file_path Filesystem.file_name
     Filesystem.action Filesystem.user Filesystem.vendor_product

  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_suspicious_file_in_efi_volume_filter`
splunk_rule_id: 4000d728-faaf-44d4-969b-12216f2879e1
splunk_rule_type: TTP
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: \EFI\Boot\
  selection_1:
    TargetFilename|endswith: .dat
  condition: selection_0 and selection_1
