title: Windows Credentials from Web Browsers Saved in TEMP Folder
id: b36b23ea-763c-417b-bd4a-6a378dabad1a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of files containing passwords, cookies, and saved login account information by the Braodo stealer malware in temporary folders. Braodo often collects
  these credentials from browsers and applications, storing them in temp directories before exfiltration. This detection focuses on monitoring for the creation of files with patterns or formats commonly
  associated with stolen credentials. By identifying these activities, security teams can take needed action to prevent sensitive login data from being leaked, reducing the risk of unauthorized access to
  user accounts and systems.
references:
- https://x.com/suyog41/status/1825869470323056748
- https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
tags:
- attack.T1555_003
date: '2024-10-18'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - login*
    - pass*
    - cookie*
    - master_key*
  selection_1:
    TargetFilename|contains: '*\temp\*'
  condition: selection_0 and selection_1
