title: Windows User Execution Malicious URL Shortcut File
id: 5c7ee6ad-baf4-44fb-b2f0-0cfeddf82dbc
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: The following analytic detects the creation URL shortcut files, often used by malware like CHAOS ransomware. It leverages the Endpoint.Filesystem datamodel to identify ".url" files created
  outside common directories, such as "Program Files". This activity can be significant as ".URL" files can be used as mean to trick the user into visiting certain websites unknowingly, or when placed in
  certain locations such as "\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\", it may allow the execution of malicious code upon system reboot. If confirmed malicious, this could
  allow an attacker to achieve persistence and execute harmful payloads, potentially leading to further system compromise and data loss.
references:
- https://attack.mitre.org/techniques/T1204/002/
- https://www.fortinet.com/blog/threat-research/chaos-ransomware-variant-sides-with-russia
tags:
- attack.T1204_002
date: '2023-01-16'
logsource:
  category: file_event
  product: windows
detection:
  filter_0:
    TargetFilename:
    - '*:\Program Files\*'
    - '*:\Program Files (x86)\*'
    - '*\AppData\Roaming\Microsoft\Office\Recent\*'
    - '*:\Windows\WinSxS\*'
  selection_1:
    Image|contains: '*.url'
  condition: (selection_1) and not (filter_0)
