title: Windows MOVEit Transfer Writing ASPX
id: c0ed2aca-5666-45b3-813f-ddfac3f3eda0
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of new ASPX files in the MOVEit Transfer application's "wwwroot" directory. It leverages endpoint data on process and filesystem activity to identify
  processes responsible for creating these files. This activity is significant as it may indicate exploitation of a critical zero-day vulnerability in MOVEit Transfer, used by threat actors to install malicious
  ASPX files. If confirmed malicious, this could lead to exfiltration of sensitive data, including user credentials and file metadata, posing a severe risk to the organization's security.
references:
- https://community.progress.com/s/article/MOVEit-Transfer-Critical-Vulnerability-31May2023
- https://www.reddit.com/r/sysadmin/comments/13wxuej/critical_vulnerability_moveit_file_transfer/
- https://www.bleepingcomputer.com/news/security/new-moveit-transfer-zero-day-mass-exploited-in-data-theft-attacks/
- https://www.reddit.com/r/sysadmin/comments/13wxuej/critical_vulnerability_moveit_file_transfer/
- https://www.mandiant.com/resources/blog/zero-day-moveit-data-theft
tags:
- attack.T1190
- attack.T1133
date: '2023-06-01'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*\MOVEitTransfer\wwwroot\*'
  selection_1:
    Image|contains:
    - '*.ashx'
    - '*.asp*'
  condition: selection_0 and selection_1
