title: Windows Universal Data Link File Creation
id: aac9ade1-dc8b-4f15-9586-4665d01b8645
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the creation of Universal Data Link (UDL) files.
  This could indicate a phishing technique that exploits UDL files, which are typically used in Windows for database connections.
  Attackers might leverage UDL files to bypass email filters and capture user credentials by tricking victims into testing a connection to a malicious server.
references:
- https://trustedsec.com/blog/oops-i-udld-it-again
tags:
- attack.T1204_002
- attack.T1566_001
date: '2021-09-02'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains: '*.udl'
  selection_1:
    action: created
  condition: selection_0 and selection_1
