title: Windows System File on Disk
id: 993ce99d-9cdd-42c7-a2cf-733d5954e5a6
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of new .sys files on disk. It leverages the Endpoint.Filesystem data model to identify and log instances where .sys files are written to the filesystem.
  This activity is significant because .sys files are often used as kernel mode drivers, and their unauthorized creation can indicate malicious activity such as rootkit installation. If confirmed malicious,
  this could allow an attacker to gain kernel-level access, leading to full system compromise, persistent control, and the ability to bypass security mechanisms.
references:
- https://redcanary.com/blog/tracking-driver-inventory-to-expose-rootkits/
tags:
- attack.T1068
date: '2022-05-16'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains: '*.sys*'
  condition: selection_0
