title: Windows Known Abused DLL Created
id: ea91651a-772a-4b02-ac3d-985b364a5f07
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies the creation of Dynamic Link Libraries (DLLs) with a known history of exploitation in atypical locations. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process and filesystem events. This activity is significant as it may indicate DLL search order hijacking or sideloading, techniques used by attackers to execute arbitrary code,
  maintain persistence, or escalate privileges. If confirmed malicious, this activity could allow attackers to blend in with legitimate operations, posing a severe threat to system integrity and security.
references:
- https://attack.mitre.org/techniques/T1574/002/
- https://hijacklibs.net/api/
- https://wietze.github.io/blog/hijacking-dlls-in-windows
- https://github.com/olafhartong/sysmon-modular/pull/195/files
tags:
- attack.T1574_001
date: '2024-03-20'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains:
    - '*\users\*'
    - '*\Windows\Temp\*'
    - '*\programdata\*'
  selection_1:
    Image|contains: '*.dll'
  condition: selection_0 and selection_1
