title: Windows File Without Extension In Critical Folder
id: 0dbcac64-963c-11ec-bf04-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Bhavin Patel, Splunk
description: This analytic detects the creation of files without extensions in critical Windows system and driver-related directories, including but not limited to System32\Drivers, Windows\WinSxS, and
  other known Windows driver storage and loading paths. The detection has been expanded to comprehensively cover all commonly abused and legitimate Windows driver folder locations, increasing visibility
  into attempts to stage or deploy kernel-mode components. The analytic leverages telemetry from the Endpoint.Filesystem data model, with a focus on file creation events and file path analysis. File creation
  activity in these directories—particularly involving extensionless files—is highly suspicious, as it may indicate the presence of destructive or stealthy malware. This behavior is consistent with malware
  families such as HermeticWiper, which deploy kernel driver components into trusted Windows driver directories to obtain low-level access and execute destructive payloads. If confirmed malicious, this
  activity can result in severe system compromise, including the deployment of malicious drivers, boot-sector or filesystem destruction, and ultimately system inoperability and irreversible data loss.
references:
- https://blog.talosintelligence.com/2022/02/threat-advisory-hermeticwiper.html
- https://www.splunk.com/en_us/blog/security/detecting-hermeticwiper.html
- https://learn.microsoft.com/en-us/answers/questions/2184241/where-does-windows-installation-search-for-drivers
tags:
- attack.t1485
date: '2022-02-25'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Filesystem
  where Filesystem.file_path IN("*\\System32\\drivers\\*", "*\\syswow64\\drivers\\*", "*\\WINDOWS\\inf\\*","*\\Program Files*", "*\\WINDOWS\\System32\\DriverStore\\*","*:\\Windows\\WinSxS\\*","*\\ProgramData\\Microsoft\\Windows Defender\\Definition Updates\\*","*\\ProgramData\\Microsoft\\Windows Defender\\Platform\\*","*\\Windows\\servicing\\*", "*\\Windows\\ELAMBKUP\\*","*\\Windows\\Boot\\*","*\\System32\\Boot\\*","*\\System32\\Recovery\\*", "C:\\AMD\\*", "C:\\OEM\\*")
  by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time
  Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path
  Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id
  Filesystem.user Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | rex field="file_name" "\.(?<extension>[^\.]*$)"
  | where isnull(extension)
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_file_without_extension_in_critical_folder_filter`
splunk_rule_id: 0dbcac64-963c-11ec-bf04-acde48001122
splunk_rule_type: TTP
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename:
    - '*\System32\drivers\*'
    - '*\syswow64\drivers\*'
    - '*\WINDOWS\inf\*'
    - '*\Program Files*'
    - '*\WINDOWS\System32\DriverStore\*'
    - '*:\Windows\WinSxS\*'
    - '*\ProgramData\Microsoft\Windows Defender\Definition Updates\*'
    - '*\ProgramData\Microsoft\Windows Defender\Platform\*'
    - '*\Windows\servicing\*'
    - '*\Windows\ELAMBKUP\*'
    - '*\Windows\Boot\*'
    - '*\System32\Boot\*'
    - '*\System32\Recovery\*'
    - C:\AMD\*
    - C:\OEM\*
  condition: selection_0
