title: Windows System File on Disk
id: 993ce99d-9cdd-42c7-a2cf-733d5954e5a6
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of new .sys files on disk. It leverages the Endpoint.Filesystem data model to identify and log instances where .sys files are written to the filesystem.
  This activity is significant because .sys files are often used as kernel mode drivers, and their unauthorized creation can indicate malicious activity such as rootkit installation. If confirmed malicious,
  this could allow an attacker to gain kernel-level access, leading to full system compromise, persistent control, and the ability to bypass security mechanisms.
references:
- https://redcanary.com/blog/tracking-driver-inventory-to-expose-rootkits/
tags:
- attack.t1068
date: '2022-05-16'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
    WHERE Filesystem.file_name="*.sys*"
    BY Filesystem.action Filesystem.dest Filesystem.file_access_time
       Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
       Filesystem.file_name Filesystem.file_path Filesystem.file_acl
       Filesystem.file_size Filesystem.process_guid Filesystem.process_id
       Filesystem.user Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_system_file_on_disk_filter`
splunk_rule_id: 993ce99d-9cdd-42c7-a2cf-733d5954e5a6
splunk_rule_type: Hunting
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains: .sys
  condition: selection_0
