title: Windows Outlook Macro Created by Suspicious Process
id: 3ec347e3-a94a-4a8b-a918-8306ea403182
status: stable
level: medium
author: Raven Tait, Splunk
description: The following analytic detects the creation of an Outlook Macro (VbaProject.OTM) by a suspicious process. This file is normally created when you create a macro from within Outlook. If this
  file is created by a process other than Outlook.exe it may be maliciously created. This detection leverages data from the Filesystem datamodel, specifically looking for the file creation event for VbaProject.OTM.
  This activity is significant as it is commonly associated with some malware infections, indicating potential malicious intent to harvest email information.
references:
- https://lab52.io/blog/analyzing-notdoor-inside-apt28s-expanding-arsenal/
- https://hackread.com/russian-apt28-notdoor-backdoor-microsoft-outlook/
tags:
- attack.T1137
- attack.T1059_005
date: '2023-05-01'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*Appdata\Roaming\Microsoft\Outlook\VbaProject.OTM'
  condition: selection_0
