title: Windows ISO LNK File Creation
id: d7c2c09b-9569-4a9e-a8b6-6a39a99c1d32
status: stable
level: medium
author: Michael Haag, Teoderick Contreras, Splunk
description: The following analytic detects the creation of .iso.lnk files in the %USER%\AppData\Local\Temp\<random folder name>\ path, indicating that an ISO file has been mounted and accessed. This detection
  leverages the Endpoint.Filesystem data model, specifically monitoring file creation events in the Windows Recent folder. This activity is significant as it may indicate the delivery and execution of potentially
  malicious payloads via ISO files. If confirmed malicious, this could lead to unauthorized code execution, data exfiltration, or further system compromise.
references:
- https://www.microsoft.com/security/blog/2021/05/27/new-sophisticated-email-based-attack-from-nobelium/
- https://github.com/MHaggis/notes/blob/master/utilities/ISOBuilder.ps1
- https://isc.sans.edu/diary/Recent+AZORult+activity/25120
- https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
tags:
- attack.t1204.001
- attack.t1566.001
date: '2022-03-30'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_path IN ("*\\Microsoft\\Windows\\Recent\\*")
  Filesystem.file_name IN ("*.iso.lnk", "*.img.lnk", "*.vhd.lnk", "*vhdx.lnk") by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
  Filesystem.file_name Filesystem.file_path Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id Filesystem.user Filesystem.vendor_product | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_iso_lnk_file_creation_filter`'
splunk_rule_id: d7c2c09b-9569-4a9e-a8b6-6a39a99c1d32
splunk_rule_type: Hunting
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: \Microsoft\Windows\Recent\
  selection_1:
    Image|endswith:
    - .iso.lnk
    - .img.lnk
    - .vhd.lnk
    - vhdx.lnk
  condition: selection_0 and selection_1
