title: Windows Potential Web Shell Creation For VMware Workspace ONE
id: 7d15f645-58cc-4cb7-a9bf-2dcf15bc4b28
status: stable
level: medium
author: Raven Tait, Splunk
description: This analytic looks for evidence of web shells being created in the VMware Workspace ONE path on Windows or Linux systems, which has been actively exploited by attackers via CVE-2022-22954.
references:
- https://unit42.paloaltonetworks.com/cve-2022-22954-vmware-vulnerabilities/
tags:
- attack.T1505_003
date: '2026-05-05'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains:
    - '*/vmware/horizon/workspace/webapps/*'
    - '*\vmware\horizon\workspace\webapps\*'
  selection_1:
    TargetFilename|contains: '*.jsp'
  condition: selection_0 and selection_1
