title: Windows SharePoint Spinstall0 Webshell File Creation
id: 7a0dda67-4cc7-4113-b3bd-b3f1489a98bf
status: stable
level: medium
author: Michael Haag, Splunk
description: This detection identifies the creation or modification of the "spinstall0.aspx" webshell file in Microsoft SharePoint directories. This file is a known indicator of compromise associated with
  the exploitation of CVE-2025-53770 (ToolShell vulnerability). Attackers exploit the vulnerability to drop webshells that provide persistent access to compromised SharePoint servers, allowing them to execute
  arbitrary commands, access sensitive data, and move laterally within the network.
references:
- https://research.eye.security/sharepoint-under-siege/
- https://www.cisa.gov/news-events/alerts/2025/07/20/microsoft-releases-guidance-exploitation-sharepoint-vulnerability-cve-2025-53770
- https://msrc.microsoft.com/blog/2025/07/customer-guidance-for-sharepoint-vulnerability-cve-2025-53770/
tags:
- attack.T1190
- attack.T1505_003
date: '2025-07-21'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image: spinstall0.aspx
  condition: selection_0
