title: Windows Unusual File Creation in Confluence Directory
id: aa9d80d9-ed47-44da-aceb-2909ca4dc19e
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects executable file formats being created within the Confluence main directory.
  This can be indicative of exploitation of the Confluence web services to stage malware.
  This won't catch adversaries who modify the output location outside the Confluence directory when exploiting.
tags:
- attack.T1190
- attack.T1608_001
- attack.T1608_002
date: '2021-09-02'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*\Atlassian\Confluence\*'
  selection_1:
    TargetFilename|contains:
    - '*.bat'
    - '*.cmd'
    - '*.dat'
    - '*.dll'
    - '*.exe'
    - '*.msc'
    - '*.ps1'
    - '*.vbe'
    - '*.vbs'
  condition: selection_0 and selection_1
