title: Windows Theme File Creation in Unusual Location
id: a11f5f36-2c32-4323-8cb0-0fec84b3188d
status: stable
level: medium
author: Raven Tait, Splunk
description: Detects theme files being created in unusual locations. These files, used to customize desktop appearances, have been used for remote code execution and NTLM coercion attacks.
references:
- https://www.darkreading.com/vulnerabilities-threats/recurring-windows-flaw-could-expose-user-credentials
tags:
- attack.T1187
- attack.T1557_001
- attack.T1021_002
date: '2021-09-02'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains:
    - '*\Desktop\*'
    - '*\Documents\*'
    - '*\Downloads\*'
    - '*\Temp\*'
  selection_1:
    Image|contains: '*.theme'
  selection_2:
    action: created
  condition: selection_0 and selection_1 and selection_2
