title: Windows Archived Collected Data In TEMP Folder
id: cb56a1ea-e0b1-46d5-913f-e024cba40cbe
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of archived files in a temporary folder, which may contain collected data. This behavior is often associated with malicious activity, where attackers
  compress sensitive information before exfiltration. The detection focuses on monitoring specific directories, such as temp folders, for the presence of newly created archive files (e.g., .zip, .rar, .tar).
  By identifying this pattern, security teams can quickly respond to potential data collection and exfiltration attempts, minimizing the risk of data breaches and improving overall threat detection.
references:
- https://x.com/suyog41/status/1825869470323056748
- https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
tags:
- attack.T1560
date: '2024-10-18'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - '*.zip'
    - '*.rar'
    - '*.tar'
    - '*.7z'
  selection_1:
    TargetFilename|contains:
    - '*\AppData\Local\Temp\*'
    - '*\Windows\Temp\*'
  condition: selection_0 and selection_1
