title: Windows File Without Extension In Critical Folder
id: 0dbcac64-963c-11ec-bf04-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Bhavin Patel, Splunk
description: This analytic detects the creation of files without extensions in critical Windows system and driver-related directories, including but not limited to System32\Drivers, Windows\WinSxS, and
  other known Windows driver storage and loading paths. The detection has been expanded to comprehensively cover all commonly abused and legitimate Windows driver folder locations, increasing visibility
  into attempts to stage or deploy kernel-mode components. The analytic leverages telemetry from the Endpoint.Filesystem data model, with a focus on file creation events and file path analysis. File creation
  activity in these directories—particularly involving extensionless files—is highly suspicious, as it may indicate the presence of destructive or stealthy malware. This behavior is consistent with malware
  families such as HermeticWiper, which deploy kernel driver components into trusted Windows driver directories to obtain low-level access and execute destructive payloads. If confirmed malicious, this
  activity can result in severe system compromise, including the deployment of malicious drivers, boot-sector or filesystem destruction, and ultimately system inoperability and irreversible data loss.
references:
- https://blog.talosintelligence.com/2022/02/threat-advisory-hermeticwiper.html
- https://www.splunk.com/en_us/blog/security/detecting-hermeticwiper.html
- https://learn.microsoft.com/en-us/answers/questions/2184241/where-does-windows-installation-search-for-drivers
tags:
- attack.T1485
date: '2022-02-25'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains:
    - '*\System32\drivers\*'
    - '*\syswow64\drivers\*'
    - '*\WINDOWS\inf\*'
    - '*\Program Files*'
    - '*\WINDOWS\System32\DriverStore\*'
    - '*:\Windows\WinSxS\*'
    - '*\ProgramData\Microsoft\Windows Defender\Definition Updates\*'
    - '*\ProgramData\Microsoft\Windows Defender\Platform\*'
    - '*\Windows\servicing\*'
    - '*\Windows\ELAMBKUP\*'
    - '*\Windows\Boot\*'
    - '*\System32\Boot\*'
    - '*\System32\Recovery\*'
    - C:\AMD\*
    - C:\OEM\*
  condition: selection_0
