title: Windows User Execution Malicious URL Shortcut File
id: 5c7ee6ad-baf4-44fb-b2f0-0cfeddf82dbc
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: The following analytic detects the creation URL shortcut files, often used by malware like CHAOS ransomware. It leverages the Endpoint.Filesystem datamodel to identify ".url" files created
  outside common directories, such as "Program Files". This activity can be significant as ".URL" files can be used as mean to trick the user into visiting certain websites unknowingly, or when placed in
  certain locations such as "\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\", it may allow the execution of malicious code upon system reboot. If confirmed malicious, this could
  allow an attacker to achieve persistence and execute harmful payloads, potentially leading to further system compromise and data loss.
references:
- https://attack.mitre.org/techniques/T1204/002/
- https://www.fortinet.com/blog/threat-research/chaos-ransomware-variant-sides-with-russia
tags:
- attack.t1204.002
date: '2023-01-16'
original_spl: '|tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Filesystem where NOT Filesystem.file_path IN ("*:\\Program Files\\*",
  "*:\\Program Files (x86)\\*", "*\\AppData\\Roaming\\Microsoft\\Office\\Recent\\*", "*:\\Windows\\WinSxS\\*") Filesystem.file_name=*.url by Filesystem.action Filesystem.dest Filesystem.file_access_time
  Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id
  Filesystem.user Filesystem.vendor_product | `drop_dm_object_name(Filesystem)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_user_execution_malicious_url_shortcut_file_filter`'
splunk_rule_id: 5c7ee6ad-baf4-44fb-b2f0-0cfeddf82dbc
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: windows
detection:
  filter_0:
    TargetFilename:
    - '*:\Program Files\*'
    - '*:\Program Files (x86)\*'
    - '*\AppData\Roaming\Microsoft\Office\Recent\*'
    - '*:\Windows\WinSxS\*'
  selection_1:
    Image|endswith: .url
  condition: (selection_1) and not (filter_0)
