title: Windows NirSoft Tool Bundle File Created
id: a2c8e8f8-18d6-4ad4-acf4-f58903bebe41
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects the creation of files associated with the NirSoft
  tool bundles on Windows endpoints.
  NirSoft is a well-known provider of free, portable utilities that can be used for various system and network tasks. However, threat actors often leverage these tools for malicious purposes, such as credential harvesting, network reconnaissance, and data exfiltration.
  The detection focuses on the creation of specific NirSoft tool bundle files, which may indicate that an attacker is preparing to use these utilities on a compromised system.
  Security teams should investigate any instances of these files being created, especially if they are found in unexpected locations or on systems that should not be using such tools.
references:
- https://thedfirreport.com/2020/04/04/gogoogle-ransomware/
- https://asec.ahnlab.com/en/48940/
- https://www.trendmicro.com/en_gb/research/23/c/emotet-returns-now-adopts-binary-padding-for-evasion.html
- https://www.welivesecurity.com/2022/06/16/how-emotet-is-changing-tactics-microsoft-tightening-office-macro-security/
tags:
- attack.T1588_002
date: '2025-10-24'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - brtools.zip
    - mailpv.zip
    - networktools.zip
    - passreccommandline.zip
    - passrecenc.zip
    - progtools.zip
    - rdpv.zip
    - systools.zip
    - webbrowserpassview.zip
  condition: selection_0
