title: Windows CAB File on Disk
id: 622f08d0-69ef-42c2-8139-66088bc25acd
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects .cab files being written to disk. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on events where the file name is '*.cab' and the
  action is 'write'. This activity is significant as .cab files can be used to deliver malicious payloads, including embedded .url files that execute harmful code. If confirmed malicious, this behavior
  could lead to unauthorized code execution and potential system compromise. Analysts should review the file path and associated artifacts for further investigation.
references:
- https://github.com/PaloAltoNetworks/Unit42-timely-threat-intel/blob/main/2023-10-25-IOCs-from-DarkGate-activity.txt
tags:
- attack.T1566_001
date: '2023-11-16'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains: '*.cab'
  condition: selection_0
