title: Windows TeamCity Plugin Installed
id: 2fd33fb6-8c72-4e88-869f-b3b516f9f37e
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the creation of a plugin zip file under the TeamCity data structure.
  This indicates a new plugin has been installed and can potentially indicate attempts to gain code execution on the TeamCity server if the plugin installation was unexpected.
references:
- https://thehackernews.com/2024/03/critical-jetbrains-teamcity-on-premises.html
- https://www.rapid7.com/blog/post/2024/03/04/etr-cve-2024-27198-and-cve-2024-27199-jetbrains-teamcity-multiple-authentication-bypass-vulnerabilities-fixed/
tags:
- attack.T1505_003
- attack.T1059
- attack.T1190
date: '2021-09-02'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*:\ProgramData\JetBrains\TeamCity\plugins\*'
  selection_1:
    Image|contains: '*.zip'
  selection_2:
    action: created
  condition: selection_0 and selection_1 and selection_2
