title: Windows EFI Bootloader File Modification
id: 28e1dbcd-9fd2-4de0-a637-f2b30db5dbb9
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects where a process writes to critical EFI bootloader files (bootmgfw.efi or bootx64.efi) within the \EFI\Boot\ directory.
  These files are responsible for initializing the Windows Boot Manager during system startup.
  Modification or replacement of these files is highly unusual in normal operations and may indicate an attempt to install a bootkit, persist malicious code at the firmware level, or otherwise tamper with the system boot process.
references:
- https://www.bleepingcomputer.com/news/security/new-hybridpetya-ransomware-can-bypass-uefi-secure-boot/
- https://www.welivesecurity.com/en/eset-research/under-cloak-uefi-secure-boot-introducing-cve-2024-7344/
tags:
- attack.t1542.003
date: '2026-05-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Filesystem where

  Filesystem.file_path IN (
      "*\\EFI\\Boot\\bootmgfw.efi",
      "*\\EFI\\Boot\\bootx64.efi"
  )

  by Filesystem.dest Filesystem.file_create_time Filesystem.process_path
     Filesystem.process_guid Filesystem.process_id Filesystem.file_path Filesystem.file_name
     Filesystem.user Filesystem.vendor_product Filesystem.action

  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_efi_bootloader_file_modification_filter`
splunk_rule_id: 28e1dbcd-9fd2-4de0-a637-f2b30db5dbb9
splunk_rule_type: TTP
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|endswith:
    - \EFI\Boot\bootmgfw.efi
    - \EFI\Boot\bootx64.efi
  condition: selection_0
