title: Windows Replication Through Removable Media
id: 60df805d-4605-41c8-bbba-57baa6a4eb97
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation or dropping of executable or script files in the root directory of a removable drive. It leverages data from the Endpoint.Filesystem datamodel, focusing
  on specific file types and their creation paths. This activity is significant as it may indicate an attempt to spread malware, such as ransomware, via removable media. If confirmed malicious, this behavior
  could lead to unauthorized code execution, lateral movement, or persistence within the network, potentially compromising sensitive data and systems.
references:
- https://attack.mitre.org/techniques/T1204/002/
- https://www.fortinet.com/blog/threat-research/chaos-ransomware-variant-sides-with-russia
tags:
- attack.T1091
date: '2023-01-18'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image|contains:
    - '*.exe'
    - '*.dll'
    - '*.sys'
    - '*.com'
    - '*.vbs'
    - '*.vbe'
    - '*.js'
    - '*.bat'
    - '*.cmd'
    - '*.pif'
    - '*.lnk'
    - '*.url'
  condition: selection_0
