title: Windows PowerShell Module File Created
id: ef018634-8999-4854-9344-bde9593468e7
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the creation of a DLL within the various PowerShell module directories.
  This can indicate a new module being installed, attempts at ScriptBlock smuggling, or other malicious PowerShell activity utilizing modules.
  False positives could include installation of legitimate modules.
references:
- https://bc-security.org/scriptblock-smuggling/
- https://github.com/BC-SECURITY/ScriptBlock-Smuggling
tags:
- attack.T1129
- attack.T1059_001
- attack.T1574
date: '2021-09-02'
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    action: created
  selection_1:
    TargetFilename|contains: '*\WindowsPowerShell\Modules\*.dll'
  selection_2:
    Image|contains: '*.dll'
  condition: selection_0 and selection_1 and selection_2
