title: Windows TeamCity Plugin Installed
id: 2fd33fb6-8c72-4e88-869f-b3b516f9f37e
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the creation of a plugin zip file under the TeamCity data structure.
  This indicates a new plugin has been installed and can potentially indicate attempts to gain code execution on the TeamCity server if the plugin installation was unexpected.
references:
- https://thehackernews.com/2024/03/critical-jetbrains-teamcity-on-premises.html
- https://www.rapid7.com/blog/post/2024/03/04/etr-cve-2024-27198-and-cve-2024-27199-jetbrains-teamcity-multiple-authentication-bypass-vulnerabilities-fixed/
tags:
- attack.t1505.003
- attack.t1059
- attack.t1190
date: '2021-09-02'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Filesystem where

  Filesystem.file_path="*:\\ProgramData\\JetBrains\\TeamCity\\plugins\\*"
  Filesystem.file_name="*.zip"
  Filesystem.action="created"

  by Filesystem.dest Filesystem.action Filesystem.file_name Filesystem.user
     Filesystem.vendor_product Filesystem.file_create_time Filesystem.process_path
     Filesystem.process_guid Filesystem.process_id Filesystem.file_path

  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_teamcity_plugin_installed_filter`
splunk_rule_id: 2fd33fb6-8c72-4e88-869f-b3b516f9f37e
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    TargetFilename|contains: :\ProgramData\JetBrains\TeamCity\plugins\
  selection_1:
    Image|endswith: .zip
  selection_2:
    Filesystem.action: created
  condition: selection_0 and selection_1 and selection_2
