title: Windows Screen Capture in TEMP folder
id: 00524d1f-a032-46f5-9108-e7d9f01bfb3c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of screen capture files by the Braodo stealer malware. This stealer is known to capture screenshots of the victim's desktop as part of its data theft
  activities. The detection focuses on identifying unusual screen capture activity, especially when images are saved in directories often used by malware, such as temporary or hidden folders. Monitoring
  for these files helps to quickly identify malicious screen capture attempts, allowing security teams to respond and mitigate potential information exposure before sensitive data is compromised.
references:
- https://x.com/suyog41/status/1825869470323056748
- https://g0njxa.medium.com/from-vietnam-to-united-states-malware-fraud-and-dropshipping-98b7a7b2c36d
tags:
- attack.t1113
date: '2024-10-18'
original_spl: '|tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem where Filesystem.file_name IN ("screenshot.png", "screenshot.jpg","screenshot.bmp")
  Filesystem.file_path = "*\\temp\\*" by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path
  Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id Filesystem.user Filesystem.vendor_product | `drop_dm_object_name(Filesystem)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `windows_screen_capture_in_temp_folder_filter`'
splunk_rule_id: 00524d1f-a032-46f5-9108-e7d9f01bfb3c
splunk_rule_type: TTP
logsource:
  category: file_event
  product: windows
detection:
  selection_0:
    Image:
    - screenshot.png
    - screenshot.jpg
    - screenshot.bmp
  selection_1:
    TargetFilename|contains: \temp\
  condition: selection_0 and selection_1
