title: ASL AWS Defense Evasion Impair Security Services
id: 5029b681-0462-47b7-82e7-f7e3d37f5a2d
status: stable
level: medium
author: Patrick Bareiss, Bhavin Patel, Gowthamaraj Rajendran, Splunk
description: The following analytic detects the deletion of critical AWS Security Services configurations, such as CloudWatch alarms, GuardDuty detectors, and Web Application Firewall rules. It leverages
  Amazon Security Lake logs to identify specific API calls like "DeleteLogStream" and "DeleteDetector." This activity is significant because adversaries often use these actions to disable security monitoring
  and evade detection. If confirmed malicious, this could allow attackers to operate undetected, leading to potential data breaches, unauthorized access, and prolonged persistence within the AWS environment.
references:
- https://docs.aws.amazon.com/cli/latest/reference/guardduty/index.html
- https://docs.aws.amazon.com/cli/latest/reference/waf/index.html
- https://www.elastic.co/guide/en/security/current/prebuilt-rules.html
tags:
- attack.t1685.002
date: '2022-07-26'
original_spl: |-
  `amazon_security_lake` api.operation IN ("DeleteLogStream","DeleteDetector","DeleteIPSet","DeleteWebACL","DeleteRule","DeleteRuleGroup","DeleteLoggingConfiguration","DeleteAlarms")
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor.user.uid api.operation api.service.name
         http_request.user_agent src_endpoint.ip actor.user.account.uid
         cloud.provider cloud.region
    | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `asl_aws_defense_evasion_impair_security_services_filter`
splunk_rule_id: 5029b681-0462-47b7-82e7-f7e3d37f5a2d
splunk_rule_type: Hunting
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    api.operation:
    - DeleteLogStream
    - DeleteDetector
    - DeleteIPSet
    - DeleteWebACL
    - DeleteRule
    - DeleteRuleGroup
    - DeleteLoggingConfiguration
    - DeleteAlarms
  condition: selection_0
