title: ASL AWS ECR Container Upload Unknown User
id: 886a8f46-d7e2-4439-b9ba-aec238e31732
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects unauthorized container uploads to AWS Elastic Container Service (ECR) by monitoring AWS CloudTrail events. It identifies instances where a new container is uploaded
  by a user not previously recognized as authorized. This detection is crucial for a SOC as it can indicate a potential compromise or misuse of AWS ECR, which could lead to unauthorized access to sensitive
  data or the deployment of malicious containers. By identifying and investigating these events, organizations can mitigate the risk of data breaches or other security incidents resulting from unauthorized
  container uploads. The impact of such an attack could be significant, compromising the integrity and security of the organization's cloud environment.
references:
- https://attack.mitre.org/techniques/T1204/003/
tags:
- attack.t1204.003
date: '2024-05-22'
original_spl: |-
  `amazon_security_lake` api.operation=PutImage NOT `aws_ecr_users_asl`
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor.user.uid api.operation api.service.name
         http_request.user_agent src_endpoint.ip actor.user.account.uid
         cloud.provider cloud.region
    | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `asl_aws_ecr_container_upload_unknown_user_filter`
splunk_rule_id: 886a8f46-d7e2-4439-b9ba-aec238e31732
splunk_rule_type: Anomaly
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    api.operation: PutImage
  condition: selection_0
