title: ASL AWS Credential Access RDS Password reset
id: d15e9bd9-ef64-4d84-bc04-f62955a9fee8
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the resetting of the master user password for an Amazon RDS DB instance. It leverages AWS CloudTrail logs from Amazon Security Lake to identify events where the
  `ModifyDBInstance` API call includes a new `masterUserPassword` parameter. This activity is significant because unauthorized password resets can grant attackers access to sensitive data stored in production
  databases, such as credit card information, PII, and healthcare data. If confirmed malicious, this could lead to data breaches, regulatory non-compliance, and significant reputational damage. Immediate
  investigation is required to determine the legitimacy of the password reset.
references:
- https://aws.amazon.com/premiumsupport/knowledge-center/reset-master-user-password-rds
tags:
- attack.t1110
- attack.t1586.003
date: '2022-08-07'
original_spl: |-
  `amazon_security_lake` api.operation=ModifyDBInstance OR api.operation=ModifyDBCluster
    | spath input=api.request.data
    | search masterUserPassword=*
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor.user.uid api.operation api.service.name
         http_request.user_agent src_endpoint.ip actor.user.account.uid
         cloud.provider cloud.region api.request.data
    | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `asl_aws_credential_access_rds_password_reset_filter`
splunk_rule_id: d15e9bd9-ef64-4d84-bc04-f62955a9fee8
splunk_rule_type: TTP
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    api.operation: ModifyDBInstance
  selection_1:
    api.operation: ModifyDBCluster
  condition: selection_0 and selection_1
