title: ASL AWS Network Access Control List Created with All Open Ports
id: a2625034-c2de-44fc-b45c-7bac9c4a7974
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation of AWS Network Access Control Lists (ACLs) with all ports open to a specified CIDR. It leverages AWS CloudTrail events, specifically monitoring for
  `CreateNetworkAclEntry` or `ReplaceNetworkAclEntry` actions with rules allowing all traffic. This activity is significant because it can expose the network to unauthorized access, increasing the risk
  of data breaches and other malicious activities. If confirmed malicious, an attacker could exploit this misconfiguration to gain unrestricted access to the network, potentially leading to data exfiltration,
  service disruption, or further compromise of the AWS environment.
tags:
- attack.T1686_001
date: '2020-10-27'
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    operation: CreateNetworkAclEntry
  selection_1:
    operation: ReplaceNetworkAclEntry
    sc-status: Success
  condition: selection_0 and selection_1
