title: ASL AWS Defense Evasion Stop Logging Cloudtrail
id: 0b78a8f9-1d31-4d23-85c8-56ad13d5b4c1
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects `StopLogging` events within AWS CloudTrail logs, a critical action that adversaries may use to evade detection. By halting the logging of their malicious activities,
  attackers aim to operate undetected within a compromised AWS environment. This detection is achieved by monitoring for specific CloudTrail log entries that indicate the cessation of logging activities.
  Identifying such behavior is crucial for a Security Operations Center (SOC), as it signals an attempt to undermine the integrity of logging mechanisms, potentially allowing malicious activities to proceed
  without observation. The impact of this evasion tactic is significant, as it can severely hamper incident response and forensic investigations by obscuring the attacker's actions.
references:
- https://attack.mitre.org/techniques/T1562/008/
tags:
- attack.T1685_002
date: '2024-05-22'
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    operation: StopLogging
  condition: selection_0
