title: ASL AWS ECR Container Upload Unknown User
id: 886a8f46-d7e2-4439-b9ba-aec238e31732
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects unauthorized container uploads to AWS Elastic Container Service (ECR) by monitoring AWS CloudTrail events. It identifies instances where a new container is uploaded
  by a user not previously recognized as authorized. This detection is crucial for a SOC as it can indicate a potential compromise or misuse of AWS ECR, which could lead to unauthorized access to sensitive
  data or the deployment of malicious containers. By identifying and investigating these events, organizations can mitigate the risk of data breaches or other security incidents resulting from unauthorized
  container uploads. The impact of such an attack could be significant, compromising the integrity and security of the organization's cloud environment.
references:
- https://attack.mitre.org/techniques/T1204/003/
tags:
- attack.T1204_003
date: '2024-05-22'
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    operation: PutImage
  condition: selection_0
