title: ASL AWS IAM AccessDenied Discovery Events
id: a4f39755-b1e2-40bb-b2dc-4449c45b0bf2
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies excessive AccessDenied events within an hour timeframe for IAM users in AWS. It leverages AWS CloudTrail logs to detect multiple failed access attempts from
  the same source IP and user identity. This activity is significant as it may indicate that an access key has been compromised and is being misused for unauthorized discovery actions. If confirmed malicious,
  this could allow attackers to gather information about the AWS environment, potentially leading to further exploitation or privilege escalation.
references:
- https://aws.amazon.com/premiumsupport/knowledge-center/troubleshoot-iam-permission-errors/
tags:
- attack.T1580
date: '2022-10-04'
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    response.error: AccessDenied
  selection_1:
    response.error: OperationNotPermittedException
  selection_2:
    response.error|contains: '*Unauthorized*'
    user.type: IAMUser
  condition: selection_0 and selection_1 and selection_2
