title: ASL AWS Defense Evasion PutBucketLifecycle
id: 986565a2-7707-48ea-9590-37929cebc938
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects `PutBucketLifecycle` events in AWS CloudTrail logs where a user sets a lifecycle rule for an S3 bucket with an expiration period of fewer than three days. This
  detection leverages CloudTrail logs to identify suspicious lifecycle configurations. This activity is significant because attackers may use it to delete CloudTrail logs quickly, thereby evading detection
  and impairing forensic investigations. If confirmed malicious, this could allow attackers to cover their tracks, making it difficult to trace their actions and respond to the breach effectively.
references:
- https://stratus-red-team.cloud/attack-techniques/AWS/aws.defense-evasion.cloudtrail-lifecycle-rule/
tags:
- attack.t1485.001
- attack.t1685.002
date: '2022-07-25'
original_spl: |-
  `amazon_security_lake` api.operation=PutBucketLifecycle
    | spath input=api.request.data path=LifecycleConfiguration.Rule.NoncurrentVersionExpiration.NoncurrentDays output=NoncurrentDays
    | where NoncurrentDays < 3
    | spath input=api.request.data
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor.user.uid api.operation api.service.name
         http_request.user_agent src_endpoint.ip actor.user.account.uid
         cloud.provider cloud.region NoncurrentDays
         bucketName
    | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `asl_aws_defense_evasion_putbucketlifecycle_filter`
splunk_rule_id: 986565a2-7707-48ea-9590-37929cebc938
splunk_rule_type: Hunting
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    api.operation: PutBucketLifecycle
  condition: selection_0
