title: ASL AWS ECR Container Upload Outside Business Hours
id: 739ed682-27e9-4ba0-80e5-a91b97698213
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the upload of new containers to AWS Elastic Container Service (ECR) outside of standard business hours through AWS CloudTrail events. It identifies this behavior
  by monitoring for `PutImage` events occurring before 8 AM or after 8 PM, as well as any uploads on weekends. This activity is significant for a SOC to investigate as it may indicate unauthorized access
  or malicious deployments, potentially leading to compromised services or data breaches. Identifying and addressing such uploads promptly can mitigate the risk of security incidents and their associated
  impacts.
references:
- https://attack.mitre.org/techniques/T1204/003/
tags:
- attack.t1204.003
date: '2024-05-22'
original_spl: |-
  `amazon_security_lake` api.operation=PutImage
    | eval hour=strftime(time/pow(10,3), "%H"), weekday=strftime(time/pow(10,3), "%A")
    | where hour >= 20 OR hour < 8 OR weekday=Saturday OR weekday=Sunday
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor.user.uid api.operation api.service.name
         http_request.user_agent src_endpoint.ip actor.user.account.uid
         cloud.provider cloud.region api.request.data
         bucketName
    | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `asl_aws_ecr_container_upload_outside_business_hours_filter`
splunk_rule_id: 739ed682-27e9-4ba0-80e5-a91b97698213
splunk_rule_type: Anomaly
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    api.operation: PutImage
  condition: selection_0
