title: ASL AWS IAM Delete Policy
id: 609ced68-d420-4ff7-8164-ae98b4b4018c
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies when a policy is deleted in AWS. It leverages Amazon Security Lake logs to detect the DeletePolicy API operation. Monitoring policy deletions is crucial as
  it can indicate unauthorized attempts to weaken security controls. If confirmed malicious, this activity could allow an attacker to remove critical security policies, potentially leading to privilege
  escalation or unauthorized access to sensitive resources.
references:
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeletePolicy.html
- https://docs.aws.amazon.com/cli/latest/reference/iam/delete-policy.html
tags:
- attack.T1098
date: '2021-04-06'
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    operation: DeletePolicy
  condition: selection_0
