title: ASL AWS Defense Evasion Delete Cloudtrail
id: 1f0b47e5-0134-43eb-851c-e3258638945e
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects AWS `DeleteTrail` events within CloudTrail logs. It leverages Amazon Security Lake logs parsed in the Open Cybersecurity Schema Framework (OCSF) format to identify
  when a CloudTrail is deleted. This activity is significant because adversaries may delete CloudTrail logs to evade detection and operate with stealth. If confirmed malicious, this action could allow attackers
  to cover their tracks, making it difficult to trace their activities and investigate other potential compromises within the AWS environment.
references:
- https://attack.mitre.org/techniques/T1562/008/
tags:
- attack.T1685_002
date: '2022-07-12'
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    operation: DeleteTrail
  condition: selection_0
