title: ASL AWS IAM Successful Group Deletion
id: 1bbe54f1-93d7-4764-8a01-ddaa12ece7ac
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the successful deletion of a group within AWS IAM, leveraging CloudTrail IAM events. This action, while not inherently malicious, can serve as a precursor to
  more sinister activities, such as unauthorized access or privilege escalation attempts. By monitoring for such deletions, the analytic aids in identifying potential preparatory steps towards an attack,
  allowing for early detection and mitigation. The identification of this behavior is crucial for a SOC to prevent the potential impact of an attack, which could include unauthorized access to sensitive
  resources or disruption of AWS environment operations.
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/iam/delete-group.html
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeleteGroup.html
tags:
- attack.t1069.003
- attack.t1098
date: '2024-05-22'
original_spl: |-
  `amazon_security_lake` api.operation=DeleteGroup status=Success
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor.user.uid api.operation api.service.name
         http_request.user_agent src_endpoint.ip actor.user.account.uid
         cloud.provider cloud.region
    | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `asl_aws_iam_successful_group_deletion_filter`
splunk_rule_id: 1bbe54f1-93d7-4764-8a01-ddaa12ece7ac
splunk_rule_type: Hunting
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    api.operation: DeleteGroup
  selection_1:
    status: Success
  condition: selection_0 and selection_1
