title: ASL AWS ECR Container Upload Outside Business Hours
id: 739ed682-27e9-4ba0-80e5-a91b97698213
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the upload of new containers to AWS Elastic Container Service (ECR) outside of standard business hours through AWS CloudTrail events. It identifies this behavior
  by monitoring for `PutImage` events occurring before 8 AM or after 8 PM, as well as any uploads on weekends. This activity is significant for a SOC to investigate as it may indicate unauthorized access
  or malicious deployments, potentially leading to compromised services or data breaches. Identifying and addressing such uploads promptly can mitigate the risk of security incidents and their associated
  impacts.
references:
- https://attack.mitre.org/techniques/T1204/003/
tags:
- attack.T1204_003
date: '2024-05-22'
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    operation: PutImage
  condition: selection_0
