title: ASL AWS IAM Delete Policy
id: 609ced68-d420-4ff7-8164-ae98b4b4018c
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies when a policy is deleted in AWS. It leverages Amazon Security Lake logs to detect the DeletePolicy API operation. Monitoring policy deletions is crucial as
  it can indicate unauthorized attempts to weaken security controls. If confirmed malicious, this activity could allow an attacker to remove critical security policies, potentially leading to privilege
  escalation or unauthorized access to sensitive resources.
references:
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeletePolicy.html
- https://docs.aws.amazon.com/cli/latest/reference/iam/delete-policy.html
tags:
- attack.t1098
date: '2021-04-06'
original_spl: |-
  `amazon_security_lake` api.operation=DeletePolicy
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY actor.user.uid api.operation api.service.name
         http_request.user_agent src_endpoint.ip actor.user.account.uid
         cloud.provider cloud.region
    | rename actor.user.uid as user api.operation as action api.service.name as dest http_request.user_agent as user_agent src_endpoint.ip as src actor.user.account.uid as vendor_account cloud.provider as vendor_product cloud.region as vendor_region
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `asl_aws_iam_delete_policy_filter`
splunk_rule_id: 609ced68-d420-4ff7-8164-ae98b4b4018c
splunk_rule_type: Hunting
logsource:
  product: aws
  service: securitylake
detection:
  selection_0:
    api.operation: DeletePolicy
  condition: selection_0
