title: Detect Password Spray Attack Behavior From Source
id: b6391b15-e913-4c2c-8949-9eecc06efacc
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies one source failing to authenticate with 10 or more unique users. This behavior could represent an adversary performing a Password Spraying attack to obtain
  initial access or elevate privileges. This logic can be used for real time security monitoring as well as threat hunting exercises and works well against any number of data sources ingested into the CIM
  datamodel. Environments can be very different depending on the organization. Test and customize this detections thresholds if needed.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://www.microsoft.com/en-us/security/blog/2020/04/23/protecting-organization-password-spray-attacks/
- https://github.com/MarkoH17/Spray365
tags:
- attack.T1110_003
date: '2023-11-11'
logsource:
  category: authentication
detection:
  selection_0:
    user_dc: 10
  selection_1:
    '25': (
  condition: selection_0 and selection_1
