title: Detect Password Spray Attack Behavior On User
id: a7539705-7183-4a12-9b6a-b6eef645a6d7
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies any user failing to authenticate from 10 or more unique sources. This behavior could represent an adversary performing a Password Spraying attack to obtain
  initial access or elevate privileges. This logic can be used for real time security monitoring as well as threat hunting exercises. Environments can be very different depending on the organization. Test
  and customize this detections thresholds as needed
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://www.microsoft.com/en-us/security/blog/2020/04/23/protecting-organization-password-spray-attacks/
- https://github.com/MarkoH17/Spray365
tags:
- attack.T1110_003
date: '2023-11-11'
logsource:
  category: authentication
detection:
  selection_0:
    src_dc: 10
  selection_1:
    '25': (
  condition: selection_0 and selection_1
