title: Detect Password Spray Attack Behavior From Source
id: b6391b15-e913-4c2c-8949-9eecc06efacc
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies one source failing to authenticate with 10 or more unique users. This behavior could represent an adversary performing a Password Spraying attack to obtain
  initial access or elevate privileges. This logic can be used for real time security monitoring as well as threat hunting exercises and works well against any number of data sources ingested into the CIM
  datamodel. Environments can be very different depending on the organization. Test and customize this detections thresholds if needed.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://www.microsoft.com/en-us/security/blog/2020/04/23/protecting-organization-password-spray-attacks/
- https://github.com/MarkoH17/Spray365
tags:
- attack.t1110.003
date: '2023-11-11'
original_spl: |-
  | tstats `security_content_summariesonly` max(_time) as lastTime, min(_time) as firstTime, values(Authentication.user_category) as user_category values(Authentication.src_category) as src_category values(Authentication.app) as app count FROM datamodel=Authentication.Authentication
    BY Authentication.action Authentication.app Authentication.authentication_method
       Authentication.dest Authentication.signature Authentication.signature_id
       Authentication.src Authentication.user
  | `drop_dm_object_name("Authentication")`
  | eval user=case((match(upper(user),"[a-zA-Z0-9]{3}")),upper(user),true(),null), src=upper(src), success=if(action="success",count,0),success_user=if(action="success",user,null),failure=if(action="failure",count,0), failed_user=if(action="failure",user,null)
  | stats count min(firstTime) as firstTime max(lastTime) as lastTime values(app) as app values(src_category) as src_category values(success_user) as user values(failed_user) as failed_user dc(success_user) as success_dc dc(failed_user) as failed_dc dc(user) as user_dc ,sum(failure) as failure,sum(success) as success
    BY src
  | fields - _time
  | where user_dc >= 10 AND .25 > (success/failure) AND failed_dc > success_dc
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `detect_password_spray_attack_behavior_from_source_filter`
splunk_rule_id: b6391b15-e913-4c2c-8949-9eecc06efacc
splunk_rule_type: TTP
logsource:
  category: authentication
detection:
  selection_0:
    user_dc: 10
  selection_1:
    '.25': (
  condition: selection_0 and selection_1
