title: DLLHost with no Command Line Arguments with Network
id: f1c07594-a141-11eb-8407-acde48001122
status: stable
level: medium
author: Steven Dick, Michael Haag, Splunk
description: |
  The following analytic detects instances of DLLHost.exe running without
  command line arguments while establishing a network connection.
  This behavior is identified using Endpoint Detection and Response (EDR) telemetry,
  focusing on process execution and network activity data.
  It is significant because DLLHost.exe typically runs with specific arguments,
  and its absence can indicate malicious activity, such as Cobalt Strike usage.
  If confirmed malicious, this activity could allow attackers to execute code,
  move laterally, or exfiltrate data, posing a severe threat to the network's security.
references:
- https://raw.githubusercontent.com/threatexpress/malleable-c2/c3385e481159a759f79b8acfe11acf240893b830/jquery-c2.4.2.profile
- https://www.cobaltstrike.com/blog/learn-pipe-fitting-for-all-of-your-offense-projects/
tags:
- attack.T1055
date: '2021-04-19'
logsource:
  category: all_traffic
detection:
  selection_0:
    Image: dllhost.exe
  selection_1:
    OriginalFileName: dllhost.exe
  selection_2:
    CommandLine|contains:
    - '*dllhost'
    - '*dllhost.exe'
    - '*dllhost.exe\"'
  condition: selection_0 and selection_1 and selection_2
