title: Internal Horizontal Port Scan NMAP Top 20
id: 3141a041-4f57-4277-9faa-9305ca1f8e5b
status: stable
level: medium
author: Dean Luxton
description: This analytic identifies instances where an internal host has attempted to communicate with 250 or more destination IP addresses using on of the NMAP top 20 ports. Horizontal port scans from
  internal hosts can indicate reconnaissance or scanning activities, potentially signaling malicious intent or misconfiguration. By monitoring network traffic logs, this detection helps detect and respond
  to such behavior promptly, enhancing network security and preventing potential threats.
tags:
- attack.T1046
date: '2024-07-01'
logsource:
  category: network_connection
detection:
  selection_0:
    SourceIp|contains:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
  condition: selection_0
