title: Internal Horizontal Port Scan
id: 1ff9eb9a-7d72-4993-a55e-59a839e607f1
status: stable
level: medium
author: Dean Luxton
description: This analytic identifies instances where an internal host has attempted to communicate with 250 or more destination IP addresses using the same port and protocol. Horizontal port scans from
  internal hosts can indicate reconnaissance or scanning activities, potentially signaling malicious intent or misconfiguration. By monitoring network traffic logs, this detection helps detect and respond
  to such behavior promptly, enhancing network security and preventing potential threats.
tags:
- attack.t1046
date: '2024-07-01'
original_spl: |-
  | tstats `security_content_summariesonly` values(All_Traffic.action) as action values(All_Traffic.src_category) as src_category values(All_Traffic.dest_zone) as dest_zone values(All_Traffic.src_zone) as src_zone values(All_Traffic.src_port) as src_port count FROM datamodel=Network_Traffic
    WHERE All_Traffic.src_ip IN ("10.0.0.0/8","172.16.0.0/12","192.168.0.0/16")
    BY All_Traffic.src_ip All_Traffic.dest_port All_Traffic.dest_ip
       All_Traffic.transport All_Traffic.rule span=1s
       _time
  | `drop_dm_object_name("All_Traffic")`
  | eval gtime=_time
  | bin span=1h gtime
  | stats min(_time) as _time values(action) as action dc(dest_ip) as totalDestIPCount values(src_category) as src_category values(dest_zone) as dest_zone values(src_zone) as src_zone
    BY src_ip dest_port gtime
       transport
  | where totalDestIPCount>=250
  | eval dest_port=transport + "/" + dest_port
  | stats min(_time) as _time values(action) as action sum(totalDestIPCount) as totalDestIPCount values(src_category) as src_category values(dest_port) as dest_ports values(dest_zone) as dest_zone values(src_zone) as src_zone
    BY src_ip gtime
  | fields - gtime
  | `internal_horizontal_port_scan_filter`
splunk_rule_id: 1ff9eb9a-7d72-4993-a55e-59a839e607f1
splunk_rule_type: TTP
logsource:
  category: network_connection
detection:
  selection_0:
    All_Traffic.src_ip:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
  condition: selection_0
