title: Internal Horizontal Port Scan NMAP Top 20
id: 3141a041-4f57-4277-9faa-9305ca1f8e5b
status: stable
level: medium
author: Dean Luxton
description: This analytic identifies instances where an internal host has attempted to communicate with 250 or more destination IP addresses using on of the NMAP top 20 ports. Horizontal port scans from
  internal hosts can indicate reconnaissance or scanning activities, potentially signaling malicious intent or misconfiguration. By monitoring network traffic logs, this detection helps detect and respond
  to such behavior promptly, enhancing network security and preventing potential threats.
tags:
- attack.t1046
date: '2024-07-01'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
          dc(All_Traffic.dest_ip) as totalDestIPCount
          values(All_Traffic.action) as action
          values(All_Traffic.dest_zone) as dest_zone
          values(All_Traffic.rule) as rule
          values(All_Traffic.src_category) as src_category
          values(All_Traffic.src_port) as src_port
          values(All_Traffic.src_zone) as src_zone

  from datamodel=Network_Traffic where

  All_Traffic.src_ip IN (
    "10.0.0.0/8", "172.16.0.0/12", "192.168.0.0/16", "100.64.0.0/10",
    "127.0.0.0/8", "169.254.0.0/16", "192.0.0.0/24", "192.0.0.0/29", "192.0.0.8/32",
    "192.0.0.9/32", "192.0.0.10/32", "192.0.0.170/32", "192.0.0.171/32", "192.0.2.0/24",
    "192.31.196.0/24", "192.52.193.0/24", "192.88.99.0/24", "224.0.0.0/4", "192.175.48.0/24",
    "198.18.0.0/15", "198.51.100.0/24", "203.0.113.0/24", "240.0.0.0/4"
  )
  All_Traffic.dest_port IN (
    21, 22, 23, 25, 53, 80, 110, 111,
    135, 139, 143, 443, 445, 993, 995,
    1723, 3306, 3389, 5900, 8080
  )

  by span=1h _time
     All_Traffic.src_ip All_Traffic.dest_port
     All_Traffic.transport

  | `drop_dm_object_name("All_Traffic")`
  | where totalDestIPCount>=250
  | eval dest_port=transport + "/" + dest_port
  | stats min(firstTime) as firstTime
          max(lastTime) as lastTime
          dc(dest_port) as num_ports_scanned
          sum(totalDestIPCount) as totalDestIPCount
          values(action) as action
          values(dest_port) as dest_ports
          values(dest_zone) as dest_zone
          values(rule) as rule
          values(src_category) as src_category
          values(src_zone) as src_zone
    by _time src_ip
  | fields - _time
  | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)`
  | `internal_horizontal_port_scan_nmap_top_20_filter`
splunk_rule_id: 3141a041-4f57-4277-9faa-9305ca1f8e5b
splunk_rule_type: TTP
logsource:
  category: network_connection
detection:
  selection_0:
    All_Traffic.src_ip:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
  selection_1:
    All_Traffic.dest_port:
    - 21
    - 22
    - 23
    - 25
    - 53
    - 80
    - 110
    - 111
    - 135
    - 139
    - 143
    - 443
    - 445
    - 993
    - 995
    - 1723
    - 3306
    - 3389
    - 5900
    - 8080
  condition: selection_0 and selection_1
