title: Internal Vertical Port Scan
id: 40d2dc41-9bbf-421a-a34b-8611271a6770
status: stable
level: medium
author: Dean Luxton, Splunk
description: This analytic detects instances where an internal host attempts to communicate with over 500 ports on a single destination IP address. It includes filtering criteria to exclude applications
  performing scans over ephemeral port ranges, focusing on potential reconnaissance or scanning activities. Monitoring network traffic logs allows for timely detection and response to such behavior, enhancing
  network security by identifying and mitigating potential threats promptly.
tags:
- attack.t1046
date: '2020-01-19'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
          values(All_Traffic.action) as action
          values(All_Traffic.src_category) as src_category
          values(All_Traffic.dest_zone) as dest_zone
          values(All_Traffic.src_zone) as src_zone

  from datamodel=Network_Traffic where

  All_Traffic.src_ip IN (
    "10.0.0.0/8", "172.16.0.0/12", "192.168.0.0/16", "100.64.0.0/10",
    "127.0.0.0/8", "169.254.0.0/16", "192.0.0.0/24", "192.0.0.0/29", "192.0.0.8/32",
    "192.0.0.9/32", "192.0.0.10/32", "192.0.0.170/32", "192.0.0.171/32", "192.0.2.0/24",
    "192.31.196.0/24", "192.52.193.0/24", "192.88.99.0/24", "224.0.0.0/4", "192.175.48.0/24",
    "198.18.0.0/15", "198.51.100.0/24", "203.0.113.0/24", "240.0.0.0/4"
  )

  by span=1s _time
     All_Traffic.src_ip All_Traffic.dest_port
     All_Traffic.dest_ip All_Traffic.transport
     All_Traffic.rule

  | `drop_dm_object_name("All_Traffic")`
  | eval gtime=_time
  | bin span=1h gtime

  | stats min(_time) as _time
          values(action) as action
          dc(eval(if(dest_port<1024 AND transport="tcp",dest_port,null))) as privilegedDestTcpPortCount
          dc(eval(if(transport="tcp",dest_port,null))) as totalDestTcpPortCount
          dc(eval(if(dest_port<1024 AND transport="udp",dest_port,null))) as privilegedDestUdpPortCount
          dc(eval(if(transport="udp",dest_port,null))) as totalDestUdpPortCount
          values(src_category) as src_category
          values(dest_zone) as dest_zone
          values(src_zone) as src_zone
    by src_ip dest_ip transport gtime
  | eval totalDestPortCount=totalDestUdpPortCount+totalDestTcpPortCount,
         privilegedDestPortCount=privilegedDestTcpPortCount+privilegedDestUdpPortCount
  | where (totalDestPortCount>=500 AND privilegedDestPortCount>=20)
  | fields - gtime
  | `internal_vertical_port_scan_filter`
splunk_rule_id: 40d2dc41-9bbf-421a-a34b-8611271a6770
splunk_rule_type: TTP
logsource:
  category: network_connection
detection:
  selection_0:
    All_Traffic.src_ip:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
  condition: selection_0
