title: Outbound Network Connection from Java Using Default Ports
id: d2c14d28-5c47-11ec-9892-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Lou Stella, Splunk
description: |
  The following analytic detects outbound network connections from Java processes to default ports used by LDAP and RMI protocols, which may indicate exploitation of the CVE-2021-44228-Log4j vulnerability.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and network traffic logs.
  Monitoring this activity is crucial as it can signify an attacker's attempt to perform JNDI lookups and retrieve malicious payloads.
  If confirmed malicious, this activity could lead to remote code execution and further compromise of the affected server.
references:
- https://www.lunasec.io/docs/blog/log4j-zero-day/
- https://www.govcert.admin.ch/blog/zero-day-exploit-targeting-popular-java-library-log4j/
tags:
- attack.T1190
- attack.T1133
date: '2021-12-13'
logsource:
  category: all_traffic
detection:
  selection_0:
    Image|contains:
    - java.exe
    - javaw.exe
  condition: selection_0
