title: Protocols passing authentication in cleartext
id: 6923cd64-17a0-453c-b945-81ac2d8c6db9
status: stable
level: medium
author: Rico Valdez, Splunk
description: The following analytic identifies the use of cleartext protocols that risk leaking sensitive information. It detects network traffic on legacy protocols such as Telnet (port 23), POP3 (port
  110), IMAP (port 143), and non-anonymous FTP (port 21). The detection leverages the Network_Traffic data model to identify TCP traffic on these ports. Monitoring this activity is crucial as it can expose
  credentials and other sensitive data to interception. If confirmed malicious, attackers could capture authentication details, leading to unauthorized access and potential data breaches.
references:
- https://www.rackaid.com/blog/secure-your-email-and-file-transfers/
- https://www.infosecmatter.com/capture-passwords-using-wireshark/
date: '2020-04-29'
logsource:
  category: network_connection
detection:
  filter_0:
    action:
    - blocked
    - block
  selection_1:
    transport: tcp
  condition: (selection_1) and not (filter_0)
