title: Protocol or Port Mismatch
id: 54dc1265-2f74-4b6d-b30d-49eb506a31b3
status: stable
level: medium
author: Rico Valdez, Splunk
description: The following analytic identifies network traffic where the higher layer protocol does not match the expected port, such as non-HTTP traffic on TCP port 80. It leverages data from network traffic
  inspection technologies like Bro or Palo Alto Networks firewalls. This activity is significant because it may indicate attempts to bypass firewall restrictions or conceal malicious communications. If
  confirmed malicious, this behavior could allow attackers to evade detection, maintain persistence, or exfiltrate data through commonly allowed ports, posing a significant threat to network security.
tags:
- attack.T1048_003
date: '2020-04-29'
logsource:
  category: network_connection
detection:
  selection_0:
    app: dns
    DestinationPort: 53
  selection_1:
    app:
    - web-browsing
    - http
    DestinationPort:
    - 80
    - 8000
    - 8080
  selection_2:
    app: ssl
    DestinationPort:
    - 443
    - 465
    - 993
    - 8443
  selection_3:
    app: smtp
    DestinationPort:
    - 25
    - 587
    - 2525
  condition: selection_0 and selection_1 and selection_2 and selection_3
