title: Remote Desktop Network Traffic
id: 272b8407-842d-4b3d-bead-a704584003d3
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects unusual Remote Desktop Protocol (RDP) traffic on TCP/3389 by filtering out known RDP sources and destinations, focusing on atypical connections within the network.
  This detection leverages network traffic data to identify potentially unauthorized RDP access. Monitoring this activity is crucial for a SOC as unauthorized RDP access can indicate an attacker's attempt
  to control networked systems, leading to data theft, ransomware deployment, or further network compromise. If confirmed malicious, this activity could result in significant data breaches or complete system
  and network control loss.
tags:
- attack.t1021.001
date: '2019-10-16'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Network_Traffic
    WHERE All_Traffic.dest_port=3389
      AND
      All_Traffic.dest_category!=common_rdp_destination
      AND
      All_Traffic.src_category!=common_rdp_source
      AND
      All_Traffic.action="allowed"
    BY All_Traffic.src All_Traffic.dest All_Traffic.dest_port
       All_Traffic.dest_ip All_Traffic.dvc All_Traffic.src_ip
       All_Traffic.src_port All_Traffic.vendor_product
  | `drop_dm_object_name("All_Traffic")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `remote_desktop_network_traffic_filter`
splunk_rule_id: 272b8407-842d-4b3d-bead-a704584003d3
splunk_rule_type: Anomaly
logsource:
  category: network_connection
detection:
  selection_0:
    All_Traffic.dest_port: 3389
  selection_1:
    All_Traffic.dest_category: common_rdp_destination
  selection_2:
    All_Traffic.src_category: common_rdp_source
  selection_3:
    All_Traffic.action: allowed
  condition: selection_0 and selection_1 and selection_2 and selection_3
