title: Remote Desktop Network Traffic
id: 272b8407-842d-4b3d-bead-a704584003d3
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects unusual Remote Desktop Protocol (RDP) traffic on TCP/3389 by filtering out known RDP sources and destinations, focusing on atypical connections within the network.
  This detection leverages network traffic data to identify potentially unauthorized RDP access. Monitoring this activity is crucial for a SOC as unauthorized RDP access can indicate an attacker's attempt
  to control networked systems, leading to data theft, ransomware deployment, or further network compromise. If confirmed malicious, this activity could result in significant data breaches or complete system
  and network control loss.
tags:
- attack.T1021_001
date: '2019-10-16'
logsource:
  category: network_connection
detection:
  selection_0:
    DestinationPort: 3389
  selection_1:
    dest_category!: common_rdp_destination
  selection_2:
    src_category!: common_rdp_source
  selection_3:
    action: allowed
  condition: selection_0 and selection_1 and selection_2 and selection_3
