title: SearchProtocolHost with no Command Line with Network
id: b690df8c-a145-11eb-a38b-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances of searchprotocolhost.exe running without command line arguments but with an active network connection. This behavior is identified using Endpoint Detection
  and Response (EDR) telemetry, focusing on process execution and network traffic data. It is significant because searchprotocolhost.exe typically runs with specific command line arguments, and deviations
  from this norm can indicate malicious activity, such as Cobalt Strike usage. If confirmed malicious, this activity could allow attackers to establish network connections for command and control, potentially
  leading to data exfiltration or further system compromise.
references:
- https://github.com/mandiant/red_team_tool_countermeasures/blob/master/rules/PGF/supplemental/hxioc/SUSPICIOUS%20EXECUTION%20OF%20SEARCHPROTOCOLHOST%20(METHODOLOGY).ioc
tags:
- attack.t1055
date: '2021-04-19'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes where
  (
    Processes.process_name=searchprotocolhost.exe
    OR
    Processes.original_file_name=searchprotocolhost.exe
  )
  Processes.process IN (
    "*searchprotocolhost",
    "*searchprotocolhost.exe",
    "*searchprotocolhost.exe\""
  )
  by _time span=1h Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
     Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
     Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | join process_id dest
  [
    | tstats `security_content_summariesonly` count
      FROM datamodel=Network_Traffic.All_Traffic where
      All_Traffic.dest_port != 0
      by All_Traffic.action All_Traffic.app All_Traffic.bytes All_Traffic.bytes_in All_Traffic.bytes_out
         All_Traffic.dest  All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.dvc All_Traffic.protocol
         All_Traffic.protocol_version All_Traffic.src All_Traffic.src_ip All_Traffic.src_port
         All_Traffic.transport All_Traffic.user All_Traffic.vendor_product All_Traffic.direction
         All_Traffic.process_id
  | `drop_dm_object_name(All_Traffic)`
  | rename dest as C2
  | rename src as dest
  ]
  | table _time dest parent_process_name process_name process_path process process_id dest_port C2
  | `searchprotocolhost_with_no_command_line_with_network_filter`
splunk_rule_id: b690df8c-a145-11eb-a38b-acde48001122
splunk_rule_type: TTP
logsource:
  category: all_traffic
detection:
  selection_0:
    Image: searchprotocolhost.exe
  selection_1:
    OriginalFileName: searchprotocolhost.exe
  selection_2:
    CommandLine|endswith:
    - searchprotocolhost
    - searchprotocolhost.exe
    - searchprotocolhost.exe\"
  condition: selection_0 and selection_1 and selection_2
