title: SSL Certificates with Punycode
id: 696694df-5706-495a-81f2-79501fa11b90
status: experimental
level: medium
author: Michael Haag, Splunk
description: The following analytic detects SSL certificates with Punycode domains in the SSL issuer email domain, identified by the prefix "xn--". It leverages the Certificates Datamodel to flag these
  domains and uses CyberChef for decoding. This activity is significant as Punycode can be used for domain spoofing and phishing attacks. If confirmed malicious, attackers could deceive users and systems,
  potentially leading to unauthorized access and data breaches.
references:
- https://www.splunk.com/en_us/blog/security/nothing-puny-about-cve-2022-3602.html
- https://www.openssl.org/blog/blog/2022/11/01/email-address-overflows/
- https://community.emergingthreats.net/t/out-of-band-ruleset-update-summary-2022-11-01/117
- https://github.com/corelight/CVE-2022-3602/tree/master/scripts
tags:
- attack.t1573
date: '2022-12-19'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Certificates.All_Certificates
    BY All_Certificates.SSL.ssl_issuer_email_domain All_Certificates.SSL.ssl_issuer All_Certificates.SSL.ssl_subject_email
       All_Certificates.SSL.dest All_Certificates.SSL.src All_Certificates.SSL.sourcetype
       All_Certificates.SSL.ssl_subject_email_domain
  | `drop_dm_object_name("All_Certificates.SSL")`
  | eval punycode=if(like(ssl_issuer_email_domain,"%xn--%"),1,0)
  | where punycode=1
  | cyberchef infield="ssl_issuer_email_domain" outfield="convertedPuny" jsonrecipe="[{"op":"From Punycode","args":[true]}]"
  | table ssl_issuer_email_domain convertedPuny ssl_issuer ssl_subject_email dest src sourcetype ssl_subject_email_domain
  | `ssl_certificates_with_punycode_filter`
splunk_rule_id: 696694df-5706-495a-81f2-79501fa11b90
splunk_rule_type: Hunting
logsource:
  category: all_certificates
detection:
  selection_0:
    punycode: 1
  condition: selection_0
