title: TOR Traffic
id: ea688274-9c06-4473-b951-e4cb7a5d7a45
status: stable
level: medium
author: David Dorsey, Bhavin Patel, Splunk
description: |
  The following analytic identifies allowed network traffic to The Onion Router (TOR), an anonymity network often exploited for malicious activities.
  It leverages data from Next Generation Firewalls, using the Network_Traffic data model to detect traffic where the application is TOR and the action is allowed.
  This activity is significant as TOR can be used to bypass conventional monitoring, facilitating hacking, data breaches, and illicit content dissemination.
  If confirmed malicious, this could lead to unauthorized access, data exfiltration, and severe compliance violations, compromising the integrity and security of the network.
references:
- https://knowledgebase.paloaltonetworks.com/KCSArticleDetail?id=kA10g000000ClRtCAK
- https://unit42.paloaltonetworks.com/tor-traffic-enterprise-networks/#:~:text=For%20enterprises%20concerned%20about%20the,the%20most%20important%20security%20risks.
tags:
- attack.t1090.003
date: '2019-10-16'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Network_Traffic WHERE
  All_Traffic.app=tor
  All_Traffic.action IN ("allowed", "allow")
  BY All_Traffic.action All_Traffic.app All_Traffic.bytes
     All_Traffic.bytes_in All_Traffic.bytes_out All_Traffic.dest
     All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.dvc
     All_Traffic.protocol All_Traffic.protocol_version All_Traffic.src
     All_Traffic.src_ip All_Traffic.src_port All_Traffic.transport
     All_Traffic.user All_Traffic.vendor_product All_Traffic.rule
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `drop_dm_object_name("All_Traffic")`
  | `tor_traffic_filter`
splunk_rule_id: ea688274-9c06-4473-b951-e4cb7a5d7a45
splunk_rule_type: TTP
logsource:
  category: network_connection
detection:
  selection_0:
    All_Traffic.app: tor
  selection_1:
    All_Traffic.action:
    - allowed
    - allow
  condition: selection_0 and selection_1
