title: TOR Traffic
id: ea688274-9c06-4473-b951-e4cb7a5d7a45
status: stable
level: medium
author: David Dorsey, Bhavin Patel, Splunk
description: |
  The following analytic identifies allowed network traffic to The Onion Router (TOR), an anonymity network often exploited for malicious activities.
  It leverages data from Next Generation Firewalls, using the Network_Traffic data model to detect traffic where the application is TOR and the action is allowed.
  This activity is significant as TOR can be used to bypass conventional monitoring, facilitating hacking, data breaches, and illicit content dissemination.
  If confirmed malicious, this could lead to unauthorized access, data exfiltration, and severe compliance violations, compromising the integrity and security of the network.
references:
- https://knowledgebase.paloaltonetworks.com/KCSArticleDetail?id=kA10g000000ClRtCAK
- https://unit42.paloaltonetworks.com/tor-traffic-enterprise-networks/#:~:text=For%20enterprises%20concerned%20about%20the,the%20most%20important%20security%20risks.
tags:
- attack.T1090_003
date: '2019-10-16'
logsource:
  category: network_connection
detection:
  selection_0:
    app: tor
  selection_1:
    action|contains:
    - allowed
    - allow
  condition: selection_0 and selection_1
