title: Cisco Duo Admin Login Unusual Browser
id: b38932ad-e663-4e90-bfdf-8446ee5b3f34
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies instances where a Duo admin logs in using a browser other than Chrome, which is considered unusual based on typical access patterns. Please adjust as needed
  to your environment. The detection leverages Duo activity logs ingested via the Cisco Security Cloud App and filters for admin login actions where the browser is not Chrome. By renaming and aggregating
  relevant fields such as user, browser, IP address, and location, the analytic highlights potentially suspicious access attempts that deviate from the norm. This behavior is significant for a SOC because
  the use of an unexpected browser may indicate credential compromise, session hijacking, or the use of unauthorized devices by attackers attempting to evade detection. Detecting such anomalies enables
  early investigation and response, helping to prevent privilege escalation, policy manipulation, or further compromise of sensitive administrative accounts. The impact of this attack could include unauthorized
  changes to security policies, user access, or the disabling of critical security controls, posing a substantial risk to the organizations security posture.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_activity` "action.name"=admin_login NOT access_device.browser IN (Chrome)
    | rename actor.name as user access_device.ip.address as src_ip
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY access_device.browser access_device.browser_version src_ip
         access_device.location.city access_device.location.country access_device.location.state
         access_device.os access_device.os_version actor.details
         actor.type outcome.result user
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_admin_login_unusual_browser_filter`
splunk_rule_id: b38932ad-e663-4e90-bfdf-8446ee5b3f34
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    '"action.name"': admin_login
  filter_1:
    access_device.browser: Chrome
  condition: (selection_0) and not (filter_1)
