title: Cisco Duo Set User Status to Bypass 2FA
id: 8728d224-9cd5-4aa7-b75f-f8520a569979
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |
  The following analytic detects instances where a Duo user's status is changed to "Bypass" for 2FA, specifically when the
  previous status was "Active." This behavior is identified by analyzing Duo activity logs for user update actions, extracting
  the status transitions, and filtering for cases where a user is set to bypass multi-factor authentication. This is a critical
  event for a Security Operations Center (SOC) to monitor, as bypassing 2FA significantly weakens account security and may
  indicate malicious insider activity or account compromise. Attackers or unauthorized administrators may exploit this change to
  disable strong authentication controls, increasing the risk of unauthorized access to sensitive systems and data. Early detection
  of such changes enables rapid investigation and response, helping to prevent potential breaches and limit the impact of
  credential-based attacks.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.T1556
date: '2025-07-10'
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    name: user_update
  condition: selection_0
