title: Cisco Duo Admin Login Unusual Os
id: c4824cc6-d644-458e-a39a-67cd67da75e3
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies Duo admin login attempts from operating systems that are unusual for your environment, excluding commonly used OS such as Mac OS X. Please adjust to your environment.
  It works by analyzing Duo activity logs for admin login actions and filtering out logins from expected operating systems. The analytic then aggregates events by browser, version, source IP, location,
  and OS details to highlight anomalies. Detecting admin logins from unexpected operating systems is critical for a SOC, as it may indicate credential compromise, unauthorized access, or attacker activity
  using unfamiliar devices. Such behavior can precede privilege escalation, policy changes, or other malicious actions within the Duo environment. Early detection enables rapid investigation and response,
  reducing the risk of account takeover and minimizing potential damage to organizational security controls.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_activity` "action.name"=admin_login NOT access_device.os IN ("Mac OS X")
    | rename actor.name as user access_device.ip.address as src_ip
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY access_device.browser access_device.browser_version src_ip
         access_device.location.city access_device.location.country access_device.location.state
         access_device.os access_device.os_version actor.details
         actor.type outcome.result user
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_admin_login_unusual_os_filter`
splunk_rule_id: c4824cc6-d644-458e-a39a-67cd67da75e3
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    '"action.name"': admin_login
  filter_1:
    access_device.os: Mac OS X
  condition: (selection_0) and not (filter_1)
