title: Cisco Duo Bypass Code Generation
id: 446e81ff-ce06-4925-9c7d-4073f9b5abf5
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |
  The following analytic detects when a Duo user generates a bypass code, which allows them to circumvent multi-factor authentication (2FA) protections.
  It works by monitoring Duo activity logs for the 'bypass_create' action, renaming the affected object as the user, and aggregating events to identify
  instances where a bypass code is issued. This behavior is significant for a Security Operations Center (SOC) because generating a bypass code can enable
  attackers, malicious insiders, or unauthorized administrators to gain access to sensitive systems without the required second authentication factor.
  Such activity may indicate account compromise, privilege abuse, or attempts to weaken security controls. Early detection of bypass code generation is
  critical, as it allows the SOC to investigate and respond before an attacker can exploit the reduced authentication requirements, helping to prevent
  unauthorized access, data breaches, or further lateral movement within the environment. Monitoring for this action helps maintain strong authentication
  standards and reduces the risk of credential-based attacks.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_administrator` action=bypass_create
    | rename object as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action actionlabel description
         user
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_bypass_code_generation_filter`
splunk_rule_id: 446e81ff-ce06-4925-9c7d-4073f9b5abf5
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    action: bypass_create
  condition: selection_0
