title: Cisco Duo Admin Login Unusual Country
id: 1bf631d1-44a0-472b-98c4-2975b8b281df
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects instances where a Duo admin login originates from a country outside of the United States, which may indicate suspicious or unauthorized access attempts. Please
  adjust as needed to your environment. It works by analyzing Duo activity logs for admin login actions and filtering out events where the access device's country is not within the expected region. By correlating
  user, device, browser, and location details, the analytic highlights anomalies in geographic login patterns. This behavior is critical for a SOC to identify because admin accounts have elevated privileges,
  and access from unusual countries can be a strong indicator of credential compromise, account takeover, or targeted attacks. Early detection of such activity enables rapid investigation and response,
  reducing the risk of unauthorized changes, data breaches, or further lateral movement within the environment. The impact of this attack can be severe, potentially allowing attackers to bypass security
  controls, alter configurations, or exfiltrate sensitive information.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_activity` "action.name"=admin_login NOT access_device.location.country IN ("United States")
    | rename actor.name as user access_device.ip.address as src_ip
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY access_device.browser access_device.browser_version src_ip
         access_device.location.city access_device.location.country access_device.location.state
         access_device.os access_device.os_version actor.details
         actor.type outcome.result user
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_admin_login_unusual_country_filter`
splunk_rule_id: 1bf631d1-44a0-472b-98c4-2975b8b281df
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    '"action.name"': admin_login
  filter_1:
    access_device.location.country: United States
  condition: (selection_0) and not (filter_1)
