title: Cisco Duo Policy Allow Old Java
id: ff56d843-57de-4a87-b726-13b145f6bf96
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |
  The following analytic detects when a Duo policy is created or updated to allow the use of outdated Java versions, which can introduce significant
  security risks. It works by searching Duo administrator activity logs for policy creation or update actions where the policy explicitly sets
  'java_remediation' to 'no remediation', indicating that no restrictions are enforced against old Java. The analytic aggregates relevant details
  such as the user, admin email, and action context for further investigation. Identifying this behavior is critical for a Security Operations Center
  (SOC) because allowing outdated Java can expose an organization to known vulnerabilities, malware, and exploitation techniques. Attackers or malicious
  insiders may attempt to weaken security controls by modifying policies to permit insecure software, increasing the risk of compromise. Prompt detection
  enables SOC analysts to respond quickly, revert risky changes, and mitigate potential threats before they are exploited.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_administrator` action=policy_update OR action=policy_create
    | spath input=description
    | search java_remediation="no remediation"
    | rename object as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action actionlabel description
         user admin_email
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_policy_allow_old_java_filter`
splunk_rule_id: ff56d843-57de-4a87-b726-13b145f6bf96
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    action: policy_update
  selection_1:
    action: policy_create
  condition: selection_0 and selection_1
