title: Cisco Duo Policy Allow Devices Without Screen Lock
id: 114c616b-c793-465d-a80d-758c9fe8a704
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |
  The following analytic detects when a Duo policy is created or updated to allow devices without a screen lock requirement. It identifies this behavior
  by searching Duo administrator activity logs for policy creation or update events where the 'require_lock' setting is set to false. This action may indicate
  a weakening of device security controls, potentially exposing the organization to unauthorized access if devices are lost or stolen. For a Security Operations
  Center (SOC), identifying such policy changes is critical, as attackers or malicious insiders may attempt to lower authentication standards to facilitate
  unauthorized access. The impact of this attack could include increased risk of credential compromise, data breaches, or lateral movement within the
  environment due to reduced device security requirements.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_administrator` action=policy_update OR action=policy_create
    | spath input=description
    | search require_lock=false
    | rename object as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action actionlabel description
         user admin_email
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_policy_allow_devices_without_screen_lock_filter`
splunk_rule_id: 114c616b-c793-465d-a80d-758c9fe8a704
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    action: policy_update
  selection_1:
    action: policy_create
  condition: selection_0 and selection_1
