title: Cisco Duo Policy Allow Old Flash
id: f36c0d3f-d57f-4b88-a5d4-0a4c9a0752f6
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies instances where a Duo administrator creates or updates a policy to allow the use of outdated Flash components, specifically by detecting policy changes with
  the flash_remediation=no remediation attribute. It leverages Duo activity logs ingested via the Cisco Security Cloud App, searching for policy_update or policy_create actions and parsing the policy description
  for indicators of weakened security controls. This behavior is significant for a SOC because permitting old Flash increases the attack surface, as Flash is widely known for its security vulnerabilities
  and is no longer supported. Attackers may exploit such policy changes to bypass security controls, introduce malware, or escalate privileges within the environment. Detecting and responding to these policy
  modifications helps prevent potential exploitation, reduces organizational risk, and ensures adherence to security best practices. Immediate investigation is recommended to determine if the change was
  authorized or indicative of malicious activity.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_administrator` action=policy_update OR action=policy_create
  | spath input=description
  | search flash_remediation="no remediation"
  | rename object as user
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY action actionlabel description
       user admin_email
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_duo_policy_allow_old_flash_filter`
splunk_rule_id: f36c0d3f-d57f-4b88-a5d4-0a4c9a0752f6
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    action: policy_update
  selection_1:
    action: policy_create
  condition: selection_0 and selection_1
