title: Cisco Duo Policy Skip 2FA for Other Countries
id: ab59d5ee-8694-4832-a332-cefcf66a9057
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |
  The following analytic detects when a Duo policy is created or updated to allow access without two-factor authentication (2FA)
  for users in countries other than the default. It identifies this behavior by searching Duo administrator activity logs for policy
  creation or update actions where the policy description indicates that access is permitted without 2FA for certain user locations.
  This is achieved by parsing the relevant fields in the logs and filtering for the specific condition of 'Allow access without 2FA.'
  This behavior is significant for a Security Operations Center (SOC) because bypassing 2FA for any user group or location weakens
  the organization's security posture and increases the risk of unauthorized access. Attackers or malicious insiders may exploit
  such policy changes to circumvent strong authentication controls, potentially leading to account compromise, data breaches, or
  lateral movement within the environment. Early detection of these policy modifications enables the SOC to investigate and respond
  before attackers can leverage the weakened controls, thereby reducing the risk and impact of a successful attack.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_administrator` action=policy_update OR action=policy_create
    | spath input=description
    | search user_locations_default_action="Allow access without 2FA"
    | rename object as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action actionlabel description
         user admin_email
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_policy_skip_2fa_for_other_countries_filter`
splunk_rule_id: ab59d5ee-8694-4832-a332-cefcf66a9057
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    action: policy_update
  selection_1:
    action: policy_create
  condition: selection_0 and selection_1
