title: Cisco Duo Policy Allow Tampered Devices
id: 6b813efd-8859-406f-b677-719458387fac
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |
  The following analytic detects when a Duo policy is created or updated to allow tampered or rooted devices, such as jailbroken smartphones,
  to access protected resources. It identifies this behavior by searching Duo administrator activity logs for policy changes where the allow_rooted_devices
  setting is enabled. This is accomplished by filtering for policy creation or update actions and parsing the policy description for the relevant configuration.
  Allowing tampered devices poses a significant security risk, as these devices may bypass built-in security controls, run unauthorized software, or be more
  susceptible to compromise. For a Security Operations Center (SOC), identifying such policy changes is critical because it may indicate either a
  misconfiguration or a malicious attempt to weaken authentication requirements, potentially enabling attackers to access sensitive systems with
  compromised devices. The impact of this attack can include unauthorized access, data breaches, and lateral movement within the environment,
  making prompt detection and response essential to maintaining organizational security.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.T1556
date: '2025-07-10'
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    action: policy_update
  selection_1:
    action: policy_create
  condition: selection_0 and selection_1
