title: Cisco Duo Policy Allow Network Bypass 2FA
id: 2593f641-6192-4f3d-b96c-2bd1c706215f
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |
  The following analytic detects when a Duo policy is created or updated to allow network-based bypass of two-factor authentication (2FA).
  It identifies this behavior by searching Duo administrator logs for policy creation or update actions where the networks_allow field is present,
  indicating that specific networks have been permitted to bypass 2FA requirements. This is achieved by parsing the event description and
  filtering for relevant policy changes, then aggregating the results by user and administrator details. Detecting this behavior is critical
  for a Security Operations Center (SOC) because allowing network-based 2FA bypass can significantly weaken authentication controls, potentially
  enabling unauthorized access if a trusted network is compromised or misconfigured. Attackers or malicious insiders may exploit this policy
  change to circumvent 2FA protections, increasing the risk of account takeover and lateral movement within the environment. Prompt detection
  enables SOC analysts to investigate and respond to potentially risky policy modifications before they can be leveraged for malicious purposes.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_administrator` action=policy_update OR action=policy_create
    | spath input=description
    | search networks_allow=*
    | rename object as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action actionlabel description
         user admin_email networks_allow
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_policy_allow_network_bypass_2fa_filter`
splunk_rule_id: 2593f641-6192-4f3d-b96c-2bd1c706215f
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    action: policy_update
  selection_1:
    action: policy_create
  condition: selection_0 and selection_1
