title: Cisco Duo Set User Status to Bypass 2FA
id: 8728d224-9cd5-4aa7-b75f-f8520a569979
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |
  The following analytic detects instances where a Duo user's status is changed to "Bypass" for 2FA, specifically when the
  previous status was "Active." This behavior is identified by analyzing Duo activity logs for user update actions, extracting
  the status transitions, and filtering for cases where a user is set to bypass multi-factor authentication. This is a critical
  event for a Security Operations Center (SOC) to monitor, as bypassing 2FA significantly weakens account security and may
  indicate malicious insider activity or account compromise. Attackers or unauthorized administrators may exploit this change to
  disable strong authentication controls, increasing the risk of unauthorized access to sensitive systems and data. Early detection
  of such changes enables rapid investigation and response, helping to prevent potential breaches and limit the impact of
  credential-based attacks.
references:
- https://splunkbase.splunk.com/app/7404
tags:
- attack.t1556
date: '2025-07-10'
original_spl: |-
  `cisco_duo_activity` action.name=user_update
    | spath input=target.details path=status output=status
    | spath input=old_target.details path=status output=old_status
    | search status=Bypass old_status=Active
    | rename target.name as user access_device.ip.address as src_ip
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY access_device.browser access_device.browser_version src_ip
         access_device.location.city access_device.location.country access_device.location.state
         access_device.os access_device.os_version action.name
         actor.details actor.name actor.type
         old_target.details target.details status
         old_status user
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `cisco_duo_set_user_status_to_bypass_2fa_filter`
splunk_rule_id: 8728d224-9cd5-4aa7-b75f-f8520a569979
splunk_rule_type: TTP
logsource:
  product: cisco
  service: duo
detection:
  selection_0:
    action.name: user_update
  condition: selection_0
