title: Amazon EKS Kubernetes cluster scan detection
id: 294c4686-63dd-4fe6-93a2-ca807626704a
status: experimental
level: medium
author: Rod Soto, Splunk
description: The following analytic detects unauthenticated requests to an Amazon EKS Kubernetes cluster, specifically identifying actions by the "system:anonymous" user. It leverages AWS CloudWatch Logs
  data, focusing on user agents and authentication details. This activity is significant as it may indicate unauthorized scanning or probing of the Kubernetes cluster, which could be a precursor to an attack.
  If confirmed malicious, this could lead to unauthorized access, data exfiltration, or disruption of services within the Kubernetes environment.
tags:
- attack.t1526
date: '2020-04-29'
original_spl: |-
  `aws_cloudwatchlogs_eks` "user.username"="system:anonymous" userAgent!="AWS Security Scanner"
    | rename sourceIPs{} as src_ip
    | stats count min(_time) as firstTime max(_time) as lastTime values(responseStatus.reason) values(source) as cluster_name values(responseStatus.code) values(userAgent) as http_user_agent values(verb) values(requestURI)
      BY src_ip user.username user.groups{}
    | `security_content_ctime(lastTime)`
    | `security_content_ctime(firstTime)`
    | `amazon_eks_kubernetes_cluster_scan_detection_filter`
splunk_rule_id: 294c4686-63dd-4fe6-93a2-ca807626704a
splunk_rule_type: Hunting
logsource:
  product: aws
  service: eks
detection:
  selection_0:
    '"user.username"': system:anonymous
  selection_1:
    userAgent: AWS Security Scanner
  condition: selection_0 and selection_1
