title: File Download or Read to Pipe Execution
id: 26f86252-1549-45e1-a212-eb26840e86bc
status: stable
level: medium
author: Michael Haag, Nasreddine Bencherchali, Splunk, DipsyTipsy
description: |
  The following analytic detects the use of download or file reading utilities from Windows, Linux or MacOS to download or read the contents of a file from a remote or local source and pipe it directly to a shell for execution.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions.
  This activity is significant as it is commonly associated with malicious actions like coinminers and exploits such as CVE-2021-44228 in Log4j.
  If confirmed malicious, this behavior could allow attackers to execute arbitrary code, potentially leading to system compromise and unauthorized access to sensitive data.
references:
- https://gist.github.com/nathanqthai/01808c569903f41a52e7e7b575caa890
- https://github.com/MHaggis/notes/blob/master/utilities/warp_pipe_tester.py
- https://www.huntress.com/blog/rapid-response-critical-rce-vulnerability-is-affecting-java
- https://www.lunasec.io/docs/blog/log4j-zero-day/
- https://securelist.com/bad-magic-apt/109087/
tags:
- attack.T1105
date: '2025-10-24'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains:
    - '*.DownloadFile(*'
    - '*.DownloadString(*'
    - '*ASCII.GetString*'
    - '*bitsadmin*'
    - '*certutil*'
    - '*curl*'
    - '*Invoke-RestMethod*'
    - '*Invoke-WebRequest*'
    - '*irm*'
    - '*iwr *'
    - '*mshta*'
    - '*wget*'
  selection_1:
    CommandLine|contains: '*|*'
  selection_2:
    CommandLine:
    - '*bash*'
    - '*csh*'
    - '*dash*'
    - '*fish*'
    - '*ksh*'
    - '*rbash*'
    - '*tcsh*'
    - '*zsh*'
  selection_3:
    CommandLine:
    - '*|sh'
    - '* sh*'
  selection_4:
    CommandLine:
    - '*IEX*'
    - '*Invoke-Expression*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
