title: Linux Service Restarted
id: 084275ba-61b8-11ec-8d64-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the restarting or re-enabling of services on Linux systems using the `systemctl` or `service` commands. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process and command-line execution logs. This activity is significant as adversaries may use it to maintain persistence or execute unauthorized actions. If confirmed malicious,
  this behavior could lead to repeated execution of malicious payloads, unauthorized access, or data destruction. Security analysts should investigate these events to mitigate risks and prevent further
  compromise.
references:
- https://attack.mitre.org/techniques/T1543/003/
tags:
- attack.T1053_006
date: '2021-12-23'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains:
    - systemctl
    - service
  selection_1:
    CommandLine|contains:
    - '*systemctl *'
    - '*service *'
  selection_2:
    CommandLine|contains:
    - '*restart*'
    - '*reload*'
    - '*reenable*'
  condition: selection_0 and selection_1 and selection_2
