title: Linux Docker Root Directory Mount
id: aa049566-f76a-43b9-908c-3c27e079fd43
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk, Emil Elsetrønning
description: |
  This detection identifies Docker containers that mount the host's root directory into the container filesystem.
  Mounting the entire host root directory into a container effectively grants the container visibility and potential write access to all files on the host system.
  If the container is running as root or with elevated capabilities (e.g., --privileged), the risk is significantly increased.
references:
- https://docs.docker.com/engine/storage/volumes/
- https://gtfobins.github.io/gtfobins/docker/
tags:
- attack.T1611
date: '2026-03-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains: docker*
  selection_1:
    CommandLine|contains:
    - '* -v *'
    - '* --volume *'
  selection_2:
    CommandLine|contains: '* /:/*'
  condition: selection_0 and selection_1 and selection_2
