title: Linux Docker Root Directory Mount
id: aa049566-f76a-43b9-908c-3c27e079fd43
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk, Emil Elsetrønning
description: |
  This detection identifies Docker containers that mount the host's root directory into the container filesystem.
  Mounting the entire host root directory into a container effectively grants the container visibility and potential write access to all files on the host system.
  If the container is running as root or with elevated capabilities (e.g., --privileged), the risk is significantly increased.
references:
- https://docs.docker.com/engine/storage/volumes/
- https://gtfobins.github.io/gtfobins/docker/
tags:
- attack.t1611
date: '2026-03-10'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
  from datamodel=Endpoint.Processes where
  Processes.process_name=docker*
  Processes.process IN (
    "* -v *",
    "* --volume *"
  )
  Processes.process="* /:/*"
  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id
     Processes.process_integrity_level Processes.process_name
     Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_docker_root_directory_mount_filter`
splunk_rule_id: aa049566-f76a-43b9-908c-3c27e079fd43
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|startswith: docker
  selection_1:
    CommandLine|contains:
    - ' -v '
    - ' --volume '
  selection_2:
    CommandLine|contains: ' /:/'
  condition: selection_0 and selection_1 and selection_2
