title: Linux Possible Append Command To At Allow Config File
id: 7bc20606-5f40-11ec-a586-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious command lines that append user entries to /etc/at.allow or /etc/at.deny files. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on command-line executions involving these files. This activity is significant because altering these configuration files can allow attackers to schedule tasks with elevated permissions, facilitating
  persistence on a compromised Linux host. If confirmed malicious, this could enable attackers to execute arbitrary code at scheduled intervals, potentially leading to further system compromise and unauthorized
  access to sensitive information.
references:
- https://linuxize.com/post/at-command-in-linux/
- https://attack.mitre.org/techniques/T1053/001/
tags:
- attack.t1053.002
date: '2021-12-21'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
    WHERE Processes.process = "*echo*"
      AND
      Processes.process IN("*/etc/at.allow", "*/etc/at.deny")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_possible_append_command_to_at_allow_config_file_filter`
splunk_rule_id: 7bc20606-5f40-11ec-a586-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: echo
  selection_1:
    CommandLine|endswith:
    - /etc/at.allow
    - /etc/at.deny
  condition: selection_0 and selection_1
