title: Linux Telnet Authentication Bypass
id: 6e0913d4-5461-487c-9dce-6d22ef2c0f03
status: stable
level: medium
author: Raven Tait, Splunk
description: Detects an authentication bypass in telnet tracked as CVE-2026-24061. An attacker can supply a specifically crafted USER environment variable (-f root) that is passed to /usr/bin/login. Because
  this input isn't sanitized an attacker can force the system to skip authentication and login directly as root.
references:
- https://www.safebreach.com/blog/safebreach-labs-root-cause-analysis-and-poc-exploit-for-cve-2026-24061/
tags:
- attack.T1548
date: '2022-08-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image: login
  selection_1:
    ParentImage: telnetd
  selection_2:
    CommandLine|contains: '* -p *'
  selection_3:
    CommandLine|contains: '* -f root*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
