title: Linux Sudo OR Su Execution
id: 4b00f134-6d6a-11ec-a90c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the "sudo" or "su" command on a Linux operating system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names and parent process names. This activity is significant because "sudo" and "su" commands are commonly used by adversaries to elevate privileges, potentially leading to unauthorized access or control
  over the system. If confirmed malicious, this activity could allow attackers to execute commands with root privileges, leading to severe security breaches, data exfiltration, or further system compromise.
references:
- https://attack.mitre.org/techniques/T1548/003/
tags:
- attack.t1548.003
date: '2022-01-10'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name IN ("sudo", "su")
      OR
      Processes.parent_process_name IN ("sudo", "su")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_sudo_or_su_execution_filter`
splunk_rule_id: 4b00f134-6d6a-11ec-a90c-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image:
    - sudo
    - su
  selection_1:
    ParentImage:
    - sudo
    - su
  condition: selection_0 and selection_1
