title: Linux Gdrive Binary Activity
id: a42f8029-5472-4c33-8943-bb17bb07466a
status: stable
level: medium
author: Raven Tait, Splunk
description: The following analytic detects the execution of the 'gdrive' tool on a Linux host. This tool allows standard users to perform tasks associated with Google Drive via the command line. This is
  used by actors to stage tools as well as exfiltrate data. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. If confirmed
  malicious, this could lead to compromise of systems or sensitive data being stolen.
references:
- https://cloud.google.com/blog/topics/threat-intelligence/uncovering-unc3886-espionage-operations
tags:
- attack.t1567
date: '2022-04-26'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name="gdrive" Processes.process IN  ("* download *", "* upload *", "* list*", "* update *", "* sync *", "* share *", "* account add*", "* drives *", "* files *")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_gdrive_binary_activity_filter`
splunk_rule_id: a42f8029-5472-4c33-8943-bb17bb07466a
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image: gdrive
  selection_1:
    CommandLine|contains:
    - ' download '
    - ' upload '
    - ' list'
    - ' update '
    - ' sync '
    - ' share '
    - ' account add'
    - ' drives '
    - ' files '
  condition: selection_0 and selection_1
