title: Linux Visudo Utility Execution
id: 08c41040-624c-11ec-a71f-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the 'visudo' utility to modify the /etc/sudoers file on a Linux system. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process execution logs. This activity is significant because unauthorized changes to the /etc/sudoers file can grant elevated privileges to users, potentially allowing adversaries to execute
  commands as root. If confirmed malicious, this could lead to full system compromise, privilege escalation, and persistent unauthorized access, severely impacting the security posture of the affected host.
references:
- https://askubuntu.com/questions/334318/sudoers-file-enable-nopasswd-for-user-all-commands
tags:
- attack.T1548_003
date: '2022-01-05'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image: visudo
  condition: selection_0
