title: Linux GDB Privilege Escalation
id: 310b7da2-ab52-437f-b1bf-0bd458674308
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects the execution of the GNU Debugger (GDB) with specific flags that indicate an attempt to escalate privileges on a Linux system. It leverages Endpoint Detection
  and Response (EDR) telemetry to identify processes where GDB is run with the `-nx`, `-ex`, and `sudo` flags. This activity is significant because it can allow a user to execute system commands as root,
  potentially leading to a root shell. If confirmed malicious, this could result in full system compromise, allowing an attacker to gain complete control over the affected endpoint.
references:
- https://gtfobins.github.io/gtfobins/gdb/
tags:
- attack.T1548_003
date: '2022-08-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: '*gdb*'
  selection_1:
    CommandLine|contains: '*-nx*'
  selection_2:
    CommandLine|contains: '*-ex*!*'
  selection_3:
    CommandLine|contains: '*sudo*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
