title: Linux SSH Authorized Keys Modification
id: f5ab595e-28e5-4327-8077-5008ba97c850
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the modification of SSH Authorized Keys on Linux systems. It leverages process execution data from Endpoint Detection and Response (EDR) agents, specifically
  monitoring commands like "bash" and "cat" interacting with "authorized_keys" files. This activity is significant as adversaries often modify SSH Authorized Keys to establish persistent access to compromised
  endpoints. If confirmed malicious, this behavior could allow attackers to maintain unauthorized access, bypassing traditional authentication mechanisms and potentially leading to further exploitation
  or data exfiltration.
references:
- https://redcanary.com/blog/lateral-movement-with-secure-shell/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1098.004/T1098.004.md
tags:
- attack.T1098_004
date: '2022-06-17'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains:
    - bash
    - cat
  selection_1:
    CommandLine|contains: '*/authorized_keys*'
  condition: selection_0 and selection_1
