title: Linux AWK Privilege Escalation
id: 4510cae0-96a2-4840-9919-91d262db210a
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects the use of the AWK command with elevated privileges to execute system commands. It leverages Endpoint Detection and Response (EDR) telemetry, specifically monitoring
  processes that include "sudo," "awk," and "BEGIN*system" in their command lines. This activity is significant because it indicates a potential privilege escalation attempt, where a user could gain root
  access by executing commands as the root user. If confirmed malicious, this could allow an attacker to fully compromise the system, execute arbitrary commands, and maintain persistent control over the
  affected endpoint.
references:
- https://www.hacknos.com/awk-privilege-escalation/
tags:
- attack.t1548.003
date: '2022-02-15'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process="*sudo*"
      AND
      Processes.process="*awk*"
      AND
      Processes.process="*BEGIN*system*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_awk_privilege_escalation_filter`
splunk_rule_id: 4510cae0-96a2-4840-9919-91d262db210a
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: sudo
  selection_1:
    CommandLine|contains: awk
  selection_2:
    CommandLine|contains: BEGIN*system
  condition: selection_0 and selection_1 and selection_2
