title: Linux Iptables Firewall Modification
id: 309d59dc-1e1b-49b2-9800-7cf18d12f7b7
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious command-line activity that modifies the iptables firewall settings on a Linux machine. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on specific command patterns that alter firewall rules to accept traffic on certain TCP ports. This activity is significant as it can indicate malware, such as CyclopsBlink, modifying
  firewall settings to allow communication with a Command and Control (C2) server. If confirmed malicious, this could enable attackers to maintain persistent access and exfiltrate data, posing a severe
  security risk.
references:
- https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf
- https://www.trendmicro.com/en_us/research/22/c/cyclops-blink-sets-sights-on-asus-routers--.html
tags:
- attack.t1686
date: '2022-04-07'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where

  Processes.process = "*iptables *"
  Processes.process = "* --dport *"
  Processes.process = "* ACCEPT*"
  Processes.process = "*&>/dev/null*"
  Processes.process = "* tcp *"
  NOT Processes.parent_process_path IN("/bin/*", "/lib/*", "/usr/bin/*", "/sbin/*")

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process
     Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
     Processes.process_integrity_level Processes.process_name Processes.process_path
     Processes.user Processes.user_id Processes.vendor_product

  | rex field=Processes.process "--dport (?<port>3269|636|989|994|995|8443)"
  | stats values(Processes.process) as processes_exec
          values(port) as ports
          values(Processes.process_guid) as guids
          values(Processes.process_id) as pids
          dc(port) as port_count
          count by Processes.process_name Processes.parent_process_name
                   Processes.parent_process_id Processes.dest Processes.user
                   Processes.parent_process_path Processes.process_path
  | where port_count >=3
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_iptables_firewall_modification_filter`
splunk_rule_id: 309d59dc-1e1b-49b2-9800-7cf18d12f7b7
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: 'iptables '
  selection_1:
    CommandLine|contains: ' --dport '
  selection_2:
    CommandLine|contains: ' ACCEPT'
  selection_3:
    CommandLine|contains: '&>/dev/null'
  selection_4:
    CommandLine|contains: ' tcp '
  filter_5:
    ParentImage:
    - /bin/*
    - /lib/*
    - /usr/bin/*
    - /sbin/*
  condition: (selection_0 and selection_1 and selection_2 and selection_3 and selection_4) and not (filter_5)
