title: Linux Add User Account
id: 51fbcaf2-6259-11ec-b0f3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Bhavin Patel, Splunk
description: The following analytic detects the creation of new user accounts on Linux systems using commands like "useradd" or "adduser." It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line executions. This activity is significant as adversaries often create new user accounts to establish persistence on compromised hosts. If confirmed malicious,
  this could allow attackers to maintain access, escalate privileges, and further compromise the system, posing a severe security risk.
references:
- https://linuxize.com/post/how-to-create-users-in-linux-using-the-useradd-command/
tags:
- attack.T1136_001
date: '2022-01-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains:
    - useradd
    - adduser
  selection_1:
    CommandLine|contains:
    - '*useradd *'
    - '*adduser *'
  condition: selection_0 and selection_1
