title: Linux Unix Shell Enable All SysRq Functions
id: e7a96937-3b58-4962-8dce-538e4763cf15
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of a command to enable all SysRq functions on a Linux system, a technique associated with the AwfulShred malware. It leverages Endpoint Detection
  and Response (EDR) data to identify processes executing the command to pipe bitmask '1' to /proc/sys/kernel/sysrq. This activity is significant as it can indicate an attempt to manipulate kernel system
  requests, which is uncommon and potentially malicious. If confirmed, this could allow an attacker to reboot the system or perform other critical actions, leading to system instability or further compromise.
references:
- https://www.kernel.org/doc/html/latest/admin-guide/sysrq.html
- https://cert.gov.ua/article/3718487
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/
tags:
- attack.T1059_004
date: '2023-02-09'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains:
    - dash
    - sudo
    - bash
  selection_1:
    CommandLine|contains: '* echo 1 > *'
  selection_2:
    CommandLine|contains: '*/proc/sys/kernel/sysrq'
  condition: selection_0 and selection_1 and selection_2
