title: Linux Possible Access To Sudoers File
id: 4479539c-71fc-11ec-b2e2-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects potential access or modification of the /etc/sudoers file on a Linux system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  processes like "cat," "nano," "vim," and "vi" accessing the /etc/sudoers file. This activity is significant because the sudoers file controls user permissions for executing commands with elevated privileges.
  If confirmed malicious, an attacker could gain persistence or escalate privileges, compromising the security of the targeted host.
references:
- https://attack.mitre.org/techniques/T1548/003/
- https://web.archive.org/web/20210708035426/https://www.cobaltstrike.com/downloads/csmanual43.pdf
tags:
- attack.t1548.003
date: '2022-01-10'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name IN("cat", "nano*","vim*", "vi*")
      AND
      Processes.process IN("*/etc/sudoers*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_possible_access_to_sudoers_file_filter`
splunk_rule_id: 4479539c-71fc-11ec-b2e2-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|startswith:
    - cat
    - nano
    - vim
    - vi
  selection_1:
    CommandLine|contains: /etc/sudoers
  condition: selection_0 and selection_1
