title: Linux Data Destruction Command
id: b11d3979-b2f7-411b-bb1a-bd00e642173b
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of a Unix shell command designed to wipe root directories on a Linux host. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on the 'rm' command with force recursive deletion and the '--no-preserve-root' option. This activity is significant as it indicates potential data destruction attempts, often associated with
  malware like Awfulshred. If confirmed malicious, this behavior could lead to severe data loss, system instability, and compromised integrity of the affected Linux host. Immediate investigation and response
  are crucial to mitigate potential damage.
references:
- https://cert.gov.ua/article/3718487
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/
tags:
- attack.t1485
date: '2023-02-08'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name = "rm"
      AND
      Processes.process IN ("* -rf*", "* -fr*")
      AND
      Processes.process = "* --no-preserve-root"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `linux_data_destruction_command_filter`
splunk_rule_id: b11d3979-b2f7-411b-bb1a-bd00e642173b
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image: rm
  selection_1:
    CommandLine|contains:
    - ' -rf'
    - ' -fr'
  selection_2:
    CommandLine|endswith: ' --no-preserve-root'
  condition: selection_0 and selection_1 and selection_2
