title: Linux c99 Privilege Escalation
id: e1c6dec5-2249-442d-a1f9-99a4bd228183
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects the execution of the c99 utility with sudo privileges, which can lead to privilege escalation on Linux systems. It leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process execution logs that include command-line details. This activity is significant because it indicates a potential misuse of the c99 utility to gain root access,
  which is critical for maintaining system security. If confirmed malicious, this could allow an attacker to execute commands as root, potentially compromising the entire system and accessing sensitive
  information.
references:
- https://gtfobins.github.io/gtfobins/c99/
- https://pubs.opengroup.org/onlinepubs/009604499/utilities/c99.html
tags:
- attack.T1548_003
date: '2022-08-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: '*c99*'
  selection_1:
    CommandLine|contains: '*-wrapper*'
  selection_2:
    CommandLine|contains: '*sudo*'
  condition: selection_0 and selection_1 and selection_2
