title: Linux MySQL Privilege Escalation
id: c0d810f4-230c-44ea-b703-989da02ff145
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects the execution of MySQL commands with elevated privileges using sudo, which can lead to privilege escalation. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process execution logs that include command-line details. This activity is significant because it indicates a potential misuse of MySQL to execute system commands as root, which
  could allow an attacker to gain root shell access. If confirmed malicious, this could result in full control over the affected system, leading to severe security breaches and unauthorized access to sensitive
  data.
references:
- https://gtfobins.github.io/gtfobins/mysql/
tags:
- attack.t1548.003
date: '2022-08-10'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process="*mysql*-e*"
      AND
      Processes.process="*\!**"
      AND
      Processes.process="*sudo*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_mysql_privilege_escalation_filter`
splunk_rule_id: c0d810f4-230c-44ea-b703-989da02ff145
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: mysql*-e
  selection_1:
    CommandLine|contains: \!*
  selection_2:
    CommandLine|contains: sudo
  condition: selection_0 and selection_1 and selection_2
