title: Linux Possible Cronjob Modification With Editor
id: dcc89bde-5f24-11ec-87ca-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects potential unauthorized modifications to Linux cronjobs using text editors like "nano," "vi," or "vim." It identifies this activity by monitoring command-line
  executions that interact with cronjob configuration paths. This behavior is significant for a SOC as it may indicate attempts at privilege escalation or establishing persistent access. If confirmed malicious,
  the impact could be severe, allowing attackers to execute damaging actions such as data theft, system sabotage, or further network penetration.
references:
- https://attack.mitre.org/techniques/T1053/003/
tags:
- attack.T1053_003
date: '2021-12-21'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains:
    - nano
    - vim.basic
  selection_1:
    CommandLine|contains:
    - '*nano *'
    - '*vi *'
    - '*vim *'
  selection_2:
    CommandLine|contains:
    - '*/etc/cron*'
    - '*/var/spool/cron/*'
    - '*/etc/anacrontab*'
  condition: selection_0 and selection_1 and selection_2
