title: Linux Disable Services
id: f2e08a38-6689-4df4-ad8c-b51c16262316
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects attempts to disable a service on a Linux system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on processes like "systemctl,"
  "service," and "svcadm" with commands containing "disable." This activity is significant as adversaries may disable security or critical services to evade detection and facilitate further malicious actions,
  such as deploying destructive payloads. If confirmed malicious, this could lead to the termination of essential security services, allowing attackers to persist undetected and potentially cause significant
  damage to the system.
references:
- https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/
- https://cert.gov.ua/article/39518
tags:
- attack.T1489
date: '2022-04-26'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains:
    - systemctl
    - service
    - svcadm
  selection_1:
    CommandLine|contains: '* disable*'
  condition: selection_0 and selection_1
