title: Linux Docker Shell Execution
id: 03b2b286-fa86-4ec9-b1a1-ec19d314bdf7
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk, Emil Elsetrønning
description: |
  This detection identifies shell execution activity associated with Docker containers on Linux systems.
  Specifically, it monitors for interactive or non-interactive shell processes (e.g., `/bin/bash`, `/bin/sh`, `/bin/zsh`) launched via Docker commands such as `docker exec`,  or through container entrypoint overrides.
  Shell execution inside a container may indicate administrative troubleshooting activity.
  However, it can also represent post-exploitation behavior, where an attacker gains access to a container and spawns a shell to execute arbitrary commands, establish persistence, or pivot to the host.
references:
- https://docs.docker.com/reference/cli/docker/container/exec/
- https://gtfobins.github.io/gtfobins/docker/
tags:
- attack.T1059_013
date: '2026-03-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains: docker*
  selection_1:
    CommandLine|contains: '* exec *'
  selection_2:
    CommandLine|contains:
    - '* /bin/bash *'
    - '* /bin/dash *'
    - '* /bin/sh *'
    - '* /bin/zsh *'
    - '* bash *'
    - '* bash'
    - '* dash *'
    - '* dash'
    - '* sh *'
    - '* sh'
    - '* zsh *'
    - '* zsh'
  condition: selection_0 and selection_1 and selection_2
