title: Linux Sudo OR Su Execution
id: 4b00f134-6d6a-11ec-a90c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the "sudo" or "su" command on a Linux operating system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names and parent process names. This activity is significant because "sudo" and "su" commands are commonly used by adversaries to elevate privileges, potentially leading to unauthorized access or control
  over the system. If confirmed malicious, this activity could allow attackers to execute commands with root privileges, leading to severe security breaches, data exfiltration, or further system compromise.
references:
- https://attack.mitre.org/techniques/T1548/003/
tags:
- attack.T1548_003
date: '2022-01-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains:
    - sudo
    - su
  selection_1:
    ParentImage|contains:
    - sudo
    - su
  condition: selection_0 and selection_1
