title: Linux Cpulimit Privilege Escalation
id: d4e40b7e-aad3-4a7d-aac8-550ea5222be5
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects the use of the 'cpulimit' command with specific flags ('-l', '-f') executed with 'sudo' privileges. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process command-line arguments and execution details. This activity is significant because if 'cpulimit' is granted sudo rights, a user can potentially execute system commands as root,
  leading to privilege escalation. If confirmed malicious, this could allow an attacker to gain root access, execute arbitrary commands, and fully compromise the affected system.
references:
- https://gtfobins.github.io/gtfobins/cpulimit/
- http://cpulimit.sourceforge.net/
tags:
- attack.T1548_003
date: '2022-08-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: '*cpulimit*'
  selection_1:
    CommandLine|contains: '*-l*'
  selection_2:
    CommandLine|contains: '*-f*'
  selection_3:
    CommandLine|contains: '*sudo*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
