title: Linux Change File Owner To Root
id: c1400ea2-6257-11ec-ad49-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of the 'chown' command to change a file owner to 'root' on a Linux system. It leverages Endpoint Detection and Response (EDR) telemetry, specifically
  monitoring command-line executions and process details. This activity is significant as it may indicate an attempt to escalate privileges by adversaries, malware, or red teamers. If confirmed malicious,
  this action could allow an attacker to gain root-level access, leading to full control over the compromised host and potential persistence within the environment.
references:
- https://unix.stackexchange.com/questions/101073/how-to-change-permissions-from-root-user-to-all-users
- https://askubuntu.com/questions/617850/changing-from-user-to-superuser
tags:
- attack.t1222.002
date: '2022-01-05'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name = chown
          OR
          Processes.process = "*chown *"
      )
      AND Processes.process = "* root *"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_change_file_owner_to_root_filter`
splunk_rule_id: c1400ea2-6257-11ec-ad49-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image: chown
  selection_1:
    CommandLine|contains: 'chown '
  selection_2:
    CommandLine|contains: ' root '
  condition: selection_0 and selection_1 and selection_2
