title: Linux Iptables Firewall Modification
id: 309d59dc-1e1b-49b2-9800-7cf18d12f7b7
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious command-line activity that modifies the iptables firewall settings on a Linux machine. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on specific command patterns that alter firewall rules to accept traffic on certain TCP ports. This activity is significant as it can indicate malware, such as CyclopsBlink, modifying
  firewall settings to allow communication with a Command and Control (C2) server. If confirmed malicious, this could enable attackers to maintain persistent access and exfiltrate data, posing a severe
  security risk.
references:
- https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf
- https://www.trendmicro.com/en_us/research/22/c/cyclops-blink-sets-sights-on-asus-routers--.html
tags:
- attack.T1686
date: '2022-04-07'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: '*iptables *'
  selection_1:
    CommandLine|contains: '* --dport *'
  selection_2:
    CommandLine|contains: '* ACCEPT*'
  selection_3:
    CommandLine|contains: '*&>/dev/null*'
  selection_4:
    CommandLine|contains: '* tcp *'
  filter_5:
    ParentImage:
    - /bin/*
    - /lib/*
    - /usr/bin/*
    - /sbin/*
  condition: (selection_0 and selection_1 and selection_2 and selection_3 and selection_4) and not (filter_5)
