title: Linux Kworker Process In Writable Process Path
id: 1cefb270-74a5-4e27-aa0c-2b6fa7c5b4ed
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of a kworker process with a command line in writable directories such as /home/, /var/log, and /tmp on a Linux machine. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process and parent process paths. This activity is significant as kworker processes are typically kernel threads, and their presence in writable directories
  is unusual and indicative of potential malware, such as CyclopsBlink. If confirmed malicious, this could allow attackers to blend malicious processes with legitimate ones, leading to persistent access
  and further system compromise.
references:
- https://www.ncsc.gov.uk/files/Cyclops-Blink-Malware-Analysis-Report.pdf
- https://www.trendmicro.com/en_us/research/22/c/cyclops-blink-sets-sights-on-asus-routers--.html
tags:
- attack.T1036_004
date: '2022-04-07'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    ParentCommandLine|contains: '*[kworker/*'
  selection_1:
    ParentImage|contains:
    - /home/*
    - /tmp/*
    - /var/log/*
  selection_2:
    CommandLine|contains: '*iptables*'
  condition: selection_0 and selection_1 and selection_2
