title: Linux Add User Account
id: 51fbcaf2-6259-11ec-b0f3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Bhavin Patel, Splunk
description: The following analytic detects the creation of new user accounts on Linux systems using commands like "useradd" or "adduser." It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line executions. This activity is significant as adversaries often create new user accounts to establish persistence on compromised hosts. If confirmed malicious,
  this could allow attackers to maintain access, escalate privileges, and further compromise the system, posing a severe security risk.
references:
- https://linuxize.com/post/how-to-create-users-in-linux-using-the-useradd-command/
tags:
- attack.t1136.001
date: '2022-01-10'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name IN ("useradd", "adduser")
      OR
      Processes.process IN ("*useradd *", "*adduser *")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_add_user_account_filter`
splunk_rule_id: 51fbcaf2-6259-11ec-b0f3-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image:
    - useradd
    - adduser
  selection_1:
    CommandLine|contains:
    - 'useradd '
    - 'adduser '
  condition: selection_0 and selection_1
