title: Linux Possible Access To Credential Files
id: 16107e0e-71fc-11ec-b862-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects attempts to access or dump the contents of /etc/passwd and /etc/shadow files on Linux systems. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on processes like 'cat', 'nano', 'vim', and 'vi' accessing these files. This activity is significant as it may indicate credential dumping, a technique used by adversaries to gain persistence
  or escalate privileges. If confirmed malicious, attackers could obtain hashed passwords for offline cracking, leading to unauthorized access and potential system compromise.
references:
- https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd
- https://attack.mitre.org/techniques/T1003/008/
tags:
- attack.t1003.008
date: '2022-01-10'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name IN("cat", "nano*","vim*", "vi*")
      AND
      Processes.process IN("*/etc/shadow*", "*/etc/passwd*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_possible_access_to_credential_files_filter`
splunk_rule_id: 16107e0e-71fc-11ec-b862-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|startswith:
    - cat
    - nano
    - vim
    - vi
  selection_1:
    CommandLine|contains:
    - /etc/shadow
    - /etc/passwd
  condition: selection_0 and selection_1
