title: Linux Possible Access To Credential Files
id: 16107e0e-71fc-11ec-b862-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects attempts to access or dump the contents of /etc/passwd and /etc/shadow files on Linux systems. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on processes like 'cat', 'nano', 'vim', and 'vi' accessing these files. This activity is significant as it may indicate credential dumping, a technique used by adversaries to gain persistence
  or escalate privileges. If confirmed malicious, attackers could obtain hashed passwords for offline cracking, leading to unauthorized access and potential system compromise.
references:
- https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd
- https://attack.mitre.org/techniques/T1003/008/
tags:
- attack.T1003_008
date: '2022-01-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    Image|contains:
    - cat
    - nano*
    - vim*
    - vi*
  selection_1:
    CommandLine|contains:
    - '*/etc/shadow*'
    - '*/etc/passwd*'
  condition: selection_0 and selection_1
