title: Linux Busybox Privilege Escalation
id: 387c4e78-f4a4-413d-ad44-e9f7bc4642c9
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects the execution of BusyBox with sudo privileges, which can lead to privilege escalation on Linux systems. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process creation events where BusyBox is executed with both 'sh' and 'sudo' commands. This activity is significant because it indicates a user may be attempting to gain root
  access, bypassing standard security controls. If confirmed malicious, this could allow an attacker to execute arbitrary commands as root, leading to full system compromise and potential persistence within
  the environment.
references:
- https://gtfobins.github.io/gtfobins/busybox/
- https://man.archlinux.org/man/busybox.1.en
tags:
- attack.T1548_003
date: '2022-08-10'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    CommandLine|contains: '*busybox*'
  selection_1:
    CommandLine|contains: '*sh*'
  selection_2:
    CommandLine|contains: '*sudo*'
  condition: selection_0 and selection_1 and selection_2
