title: Potential password in username
id: 5ced34b4-ab32-4bb0-8f22-3b8f186f0a38
status: stable
level: medium
author: Mikael Bjerkeland, Splunk
description: The following analytic identifies instances where users may have mistakenly entered their passwords in the username field during authentication attempts. It detects this by analyzing failed
  authentication events with usernames longer than 7 characters and high Shannon entropy, followed by a successful authentication from the same source to the same destination. This activity is significant
  as it can indicate potential security risks, such as password exposure. If confirmed malicious, attackers could exploit this to gain unauthorized access, leading to potential data breaches or further
  compromise of the system.
references:
- https://medium.com/@markmotig/search-for-passwords-accidentally-typed-into-the-username-field-975f1a389928
tags:
- attack.T1078_003
- attack.T1552_001
date: '2022-05-27'
logsource:
  category: authentication
  product: linux
detection:
  selection_0:
    nodename: Authentication.Failed_Authentication
  condition: selection_0
