title: Web or Application Server Spawning a Shell
id: 8fdb41ad-091c-4d7a-af1d-9123fe94b539
status: stable
level: medium
author: Michael Haag, Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects instances where Java, or Tomcat
  processes spawn a Linux shell, which may indicate exploitation attempts, such as
  those related to CVE-2021-44228 (Log4Shell). This detection leverages Endpoint Detection
  and Response (EDR) telemetry, focusing on process names and parent-child process
  relationships. This activity is significant as it can signify a compromised Java
  application, potentially leading to unauthorized shell access. If confirmed malicious,
  attackers could execute arbitrary commands, escalate privileges, or maintain persistent
  access, posing a severe threat to the environment.
references:
- https://blog.netlab.360.com/ten-families-of-malicious-samples-are-spreading-using-the-log4j2-vulnerability-now/
- https://gist.github.com/olafhartong/916ebc673ba066537740164f7e7e1d72
tags:
- attack.T1190
- attack.T1133
date: '2021-12-13'
logsource:
  category: process_creation
  product: linux
detection:
  selection_0:
    ParentImage:
    - java
    - tomcat*
    - httpd
    - lighttpd
    - apache2
    - nginx
    - node
    - caddy
  selection_1:
    ParentImage:
    - httpd.exe
    - nginx.exe
    - php*.exe
    - php-cgi.exe
    - tomcat*.exe
    - caddy.exe
    - UMWorkerProcess.exe
    - w3wp.exe
    - ws_TomcatService.exe
    - node.exe
    - java.exe
  condition: selection_0 and selection_1
