title: HTTP Duplicated Header
id: 1606cc5b-fd5f-4865-9fe3-0ed1eaec2df6
status: stable
level: medium
author: Raven Tait, Splunk
description: Detects when a request has more than one of the same header. This is commonly used in request smuggling and other web based attacks. HTTP Request Smuggling exploits inconsistencies in how front-end
  and back-end servers parse HTTP requests by using ambiguous or malformed headers to hide malicious requests within legitimate ones. Attackers leverage duplicate headers, particularly Content-Length and
  Transfer-Encoding, to cause different servers in the chain to disagree on where one request ends and another begins. RFC7230 states that a sender MUST NOT generate multiple header fields with the same
  field name in a message unless either the entire field value for that header field is defined as a comma-separated list or the header field is a well-known exception.
references:
- https://portswigger.net/web-security/request-smuggling#what-is-http-request-smuggling
- https://portswigger.net/research/http1-must-die
- https://www.vaadata.com/blog/what-is-http-request-smuggling-exploitations-and-security-best-practices/
- https://www.securityweek.com/new-http-request-smuggling-attacks-impacted-cdns-major-orgs-millions-of-websites/
tags:
- attack.t1071.001
- attack.t1190
date: '2025-10-21'
original_spl: |-
  `suricata` http.request_headers{}.name="*"
    | rename dest_ip as dest
    | spath path=http.request_headers{}.name output=header_names
    | mvexpand header_names
    | where lower(header_names) != "set-cookie"
    | stats count
      BY _raw, header_names, src_ip,
         dest
    | where count > 1
    | stats values(header_names) as duplicate_headers
      BY _raw, count, src_ip,
         dest
    | `http_duplicated_header_filter`
splunk_rule_id: 1606cc5b-fd5f-4865-9fe3-0ed1eaec2df6
splunk_rule_type: Anomaly
logsource:
  product: suricata
  service: ids
detection:
  selection_0:
    http.request_headers{}.name|contains: ''
  condition: selection_0
