title: Splunk Information Disclosure on Account Login
id: 2bae5d19-6d1b-4db0-82ab-0af5ac5f836c
status: deprecated
level: medium
author: Rod Soto
description: This is a composed hunting search that looks for possible user enumeration attempts when SAML is enabled on a Splunk instance by capturing different responses from server.
references:
- https://advisory.splunk.com/advisories/SVD-2024-0716
tags:
- attack.t1087
date: '2024-07-01'
original_spl: '`splunkd` component=UiAuth status=failure action=login TcpChannelThread | stats count min(_time) as firstTime max(_time) as lastTime by user status action clientip | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `splunk_information_disclosure_on_account_login_filter`'
splunk_rule_id: 2bae5d19-6d1b-4db0-82ab-0af5ac5f836c
splunk_rule_type: Hunting
logsource:
  product: splunk
  service: splunkd
detection:
  selection_0:
    component: UiAuth
  selection_1:
    status: failure
  selection_2:
    action: login
  condition: selection_0 and selection_1 and selection_2
