title: Splunk Sensitive Information Disclosure in DEBUG Logging Channels
id: 93dc7182-c5da-4085-82ec-401abf33d623
status: stable
level: medium
author: Rod Soto, Eric McGinnis, Splunk
description: In Splunk versions 9.3, 9.2, 9.1, 9.1.5 Applications which have been enabled with logging level DEBUG may write sensitive information such as keys, tokens, or other sensitive strings into the
  internal index.
references:
- https://advisory.splunk.com/advisories/SVD-2024-0301
- https://advisory.splunk.com/advisories/SVD-2024-1008
- https://advisory.splunk.com/advisories/SVD-2024-1009
tags:
- attack.t1552
date: '2024-10-14'
original_spl: |-
  `splunkd` log_level="DEBUG" AND component IN ("REST_Calls", "AdminManager", "JSONWebToken")
  | stats count min(_time) as firstTime max(_time) as lastTime by host splunk_server log_level component event_message
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `splunk_sensitive_information_disclosure_in_debug_logging_channels_filter`
splunk_rule_id: 93dc7182-c5da-4085-82ec-401abf33d623
splunk_rule_type: Hunting
logsource:
  product: splunk
  service: splunkd
detection:
  selection_0:
    log_level: DEBUG
  selection_1:
    component:
    - REST_Calls
    - AdminManager
    - JSONWebToken
  condition: selection_0 and selection_1
