title: Zscaler Potentially Abused File Download
id: b0c21379-f4ba-4bac-a958-897e260f964a
status: stable
level: medium
author: Gowthamaraj Rajendran, Rod Soto, Splunk
description: The following analytic identifies the download of potentially malicious file types, such as .scr, .dll, .bat, and .lnk, within a network. It leverages web proxy logs from Zscaler, focusing
  on blocked actions and analyzing fields like deviceowner, user, urlcategory, url, dest, and filename. This activity is significant as these file types are often used to spread malware, posing a threat
  to network security. If confirmed malicious, this activity could lead to malware execution, data compromise, or further network infiltration.
references:
- https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
- attack.t1566
date: '2024-04-17'
original_spl: |-
  `zscaler_proxy` url IN ("*.scr", "*.dll", "*.bat", "*.lnk")
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY deviceowner user urlcategory
         url src filename
         dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `zscaler_potentially_abused_file_download_filter`
splunk_rule_id: b0c21379-f4ba-4bac-a958-897e260f964a
splunk_rule_type: Anomaly
logsource:
  category: proxy
  service: zscaler
detection:
  selection_0:
    url|endswith:
    - .scr
    - .dll
    - .bat
    - .lnk
  condition: selection_0
