title: Zscaler Scam Destinations Threat Blocked
id: a0c21379-f4ba-4bac-a958-897e260f964a
status: stable
level: medium
author: Gowthamaraj Rajendran, Rod Soto, Splunk
description: The following analytic identifies blocked scam-related activities detected by Zscaler within a network. It leverages web proxy logs to examine actions flagged as scam threats, focusing on data
  points such as device owner, user, URL category, destination URL, and IP. This detection is significant for SOC as it helps in the early identification and mitigation of scam activities, ensuring network
  safety. If confirmed malicious, this activity could indicate attempts to deceive users, potentially leading to data theft or financial loss.
references:
- https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
- attack.t1566
date: '2024-04-17'
original_spl: |-
  `zscaler_proxy` action=blocked threatname=*scam*
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action deviceowner user
         urlcategory url src
         dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `zscaler_scam_destinations_threat_blocked_filter`
splunk_rule_id: a0c21379-f4ba-4bac-a958-897e260f964a
splunk_rule_type: Anomaly
logsource:
  category: proxy
  service: zscaler
detection:
  selection_0:
    action: blocked
  selection_1:
    threatname|contains: scam
  condition: selection_0 and selection_1
