title: Zscaler Behavior Analysis Threat Blocked
id: 289ad59f-8939-4331-b805-f2bd51d36fb8
status: stable
level: medium
author: Rod Soto, Gowthamaraj Rajendran, Splunk
description: The following analytic identifies threats blocked by the Zscaler proxy based on behavior analysis. It leverages web proxy logs to detect entries where actions are blocked and threat names and
  classes are specified. This detection is significant as it highlights potential malicious activities that were intercepted by Zscaler's behavior analysis, providing early indicators of threats. If confirmed
  malicious, these blocked threats could indicate attempted breaches or malware infections, helping security teams to understand and mitigate potential risks in their environment.
references:
- https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
- attack.t1566
date: '2024-04-17'
original_spl: |-
  `zscaler_proxy` action=blocked threatname!="None" threatclass="Behavior Analysis"
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action deviceowner user
         threatname url src
         dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `zscaler_behavior_analysis_threat_blocked_filter`
splunk_rule_id: 289ad59f-8939-4331-b805-f2bd51d36fb8
splunk_rule_type: Anomaly
logsource:
  category: proxy
  service: zscaler
detection:
  selection_0:
    action: blocked
  selection_1:
    threatname: None
  selection_2:
    threatclass: Behavior Analysis
  condition: selection_0 and selection_1 and selection_2
