title: Zscaler Adware Activities Threat Blocked
id: 3407b250-345a-4d71-80db-c91e555a3ece
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic identifies potential adware activity blocked by Zscaler. It leverages web proxy logs to detect blocked actions associated with adware threats. Key data points such as
  device owner, user, URL category, destination URL, and IP are analyzed. This activity is significant as adware can degrade system performance, lead to unwanted advertisements, and potentially expose users
  to further malicious content. If confirmed malicious, it could indicate an attempt to compromise user systems, necessitating further investigation and remediation to prevent potential data breaches or
  system exploitation.
references:
- https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
- attack.t1566
date: '2024-04-17'
original_spl: |-
  `zscaler_proxy` action=blocked threatname=*adware*
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action deviceowner user
         urlcategory url src
         dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `zscaler_adware_activities_threat_blocked_filter`
splunk_rule_id: 3407b250-345a-4d71-80db-c91e555a3ece
splunk_rule_type: Anomaly
logsource:
  category: proxy
  service: zscaler
detection:
  selection_0:
    action: blocked
  selection_1:
    threatname|contains: adware
  condition: selection_0 and selection_1
