title: Zscaler Employment Search Web Activity
id: 5456bdef-d765-4565-8e1f-61ca027bc50e
status: stable
level: medium
author: Gowthamaraj Rajendran, Rod Soto, Splunk
description: The following analytic identifies web activity related to employment searches within a network. It leverages Zscaler web proxy logs, focusing on entries categorized as 'Job/Employment Search'.
  Key data points such as device owner, user, URL category, destination URL, and IP are analyzed. This detection is significant for SOCs as it helps monitor potential insider threats by identifying users
  who may be seeking new employment. If confirmed malicious, this activity could indicate a risk of data exfiltration or other insider threats, potentially leading to sensitive information leakage or other
  security breaches.
references:
- https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
- attack.t1566
date: '2024-04-17'
original_spl: |-
  `zscaler_proxy` urlsupercategory="Job/Employment Search"
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY action deviceowner user
         urlcategory url src
         dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `zscaler_employment_search_web_activity_filter`
splunk_rule_id: 5456bdef-d765-4565-8e1f-61ca027bc50e
splunk_rule_type: Anomaly
logsource:
  category: proxy
  service: zscaler
detection:
  selection_0:
    urlsupercategory: Job/Employment Search
  condition: selection_0
