title: Windows Event Triggered Image File Execution Options Injection
id: f7abfab9-12ea-44e8-8745-475f9ca6e0a4
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies the creation or modification of Image File Execution Options (IFEO) registry keys, detected via EventCode 3000 in the Application channel. This detection leverages
  Windows Event Logs to monitor for process names added to IFEO under specific registry paths. This activity is significant as it can indicate attempts to set traps for process monitoring or debugging,
  often used by attackers for persistence or evasion. If confirmed malicious, this could allow an attacker to execute arbitrary code or manipulate process behavior, leading to potential system compromise.
references:
- https://blog.thinkst.com/2022/09/sensitive-command-token-so-much-offense.html
- https://docs.microsoft.com/en-us/windows-hardware/drivers/debugger/registry-entries-for-silent-process-exit
tags:
- attack.t1546.012
date: '2022-09-09'
original_spl: |-
  `wineventlog_application` EventCode=3000
    | rename param1 AS "Process" param2 AS "Exit_Code"
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY Process Exit_Code dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_event_triggered_image_file_execution_options_injection_filter`
splunk_rule_id: f7abfab9-12ea-44e8-8745-475f9ca6e0a4
splunk_rule_type: Hunting
logsource:
  product: windows
  service: application
detection:
  selection_0:
    EventID: 3000
  condition: selection_0
