title: Windows SQL Server Configuration Option Hunt
id: 8dc9efd5-805a-460e-889e-bc79e5477af9
status: stable
level: medium
author: Michael Haag, Splunk, sidoyle from Splunk Community
description: This detection helps hunt for changes to SQL Server configuration options that could indicate malicious activity. It monitors for modifications to any SQL Server configuration settings, allowing
  analysts to identify potentially suspicious changes that may be part of an attack, such as enabling dangerous features or modifying security-relevant settings.
references:
- https://learn.microsoft.com/en-us/sql/database-engine/configure-windows/server-configuration-options-sql-server
- https://attack.mitre.org/techniques/T1505/001/
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
tags:
- attack.t1505.001
date: '2025-02-13'
original_spl: |-
  `wineventlog_application` EventCode=15457
    | rex field=EventData_Xml "<Data>(?<config_name>[^<]+)</Data><Data>(?<old_value>[^<]+)</Data><Data>(?<new_value>[^<]+)</Data>"
    | rename host as dest
    | eval change_type=case( old_value="0" AND new_value="1", "enabled", old_value="1" AND new_value="0", "disabled", true(), "modified" )
    | eval risk_score=case( change_type="enabled", 90, change_type="disabled", 60, true(), 70 )
    | eval risk_message="SQL Server ".config_name." was ".change_type." on host ".dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest EventCode config_name
         change_type risk_message risk_score
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_sql_server_configuration_option_hunt_filter`
splunk_rule_id: 8dc9efd5-805a-460e-889e-bc79e5477af9
splunk_rule_type: Hunting
logsource:
  product: windows
  service: application
detection:
  selection_0:
    EventID: 15457
  condition: selection_0
