title: Windows SQL Server Extended Procedure DLL Loading Hunt
id: 182ba99f-2dde-4cdb-8e5c-e3b1e251cb10
status: stable
level: medium
author: Michael Haag, Splunk
description: This analytic detects when SQL Server loads DLLs to execute extended stored procedures. This is particularly important for security monitoring as it indicates the first-time use or version
  changes of potentially dangerous procedures like xp_cmdshell, sp_OACreate, and others. While this is a legitimate operation, adversaries may abuse these procedures for execution, discovery, or privilege
  escalation.
references:
- https://learn.microsoft.com/en-us/sql/relational-databases/system-stored-procedures/general-extended-stored-procedures-transact-sql
- https://learn.microsoft.com/en-us/previous-versions/sql/sql-server-2008-r2/ms175543(v=sql.105)
- https://learn.microsoft.com/en-us/sql/relational-databases/extended-stored-procedures-programming/using-extended-stored-procedures
tags:
- attack.t1505.001
- attack.t1059.009
date: '2025-02-13'
original_spl: |-
  `wineventlog_application` EventCode=8128
    | rex field=EventData_Xml "<Data>(?<dll_name>[^<]+)</Data><Data>(?<dll_version>[^<]+)</Data><Data>(?<procedure_name>[^<]+)</Data>"
    | rename host as dest
    | eval dll_category=case( dll_name=="xpstar.dll", "Extended Procedures", dll_name=="odsole70.dll", "OLE Automation", dll_name=="xplog70.dll", "Logging Procedures", true(), "Other")
    | stats count as execution_count, values(procedure_name) as procedures_used, latest(_time) as last_seen
      BY dest dll_name dll_category
         dll_version
    | sort - execution_count
    | `windows_sql_server_extended_procedure_dll_loading_hunt_filter`
splunk_rule_id: 182ba99f-2dde-4cdb-8e5c-e3b1e251cb10
splunk_rule_type: Hunting
logsource:
  product: windows
  service: application
detection:
  selection_0:
    EventID: 8128
  condition: selection_0
