title: Access LSASS Memory for Dump Creation
id: fb4c31b0-13e8-4155-8aa5-24de4b8d6717
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects attempts to dump the LSASS process memory, a common technique in credential dumping attacks. It leverages Sysmon logs, specifically EventCode 10, to identify
  suspicious call traces to dbgcore.dll and dbghelp.dll associated with lsass.exe. This activity is significant as it often precedes the theft of sensitive login credentials, posing a high risk of unauthorized
  access to systems and data. If confirmed malicious, attackers could gain access to critical credentials, enabling further compromise and lateral movement within the network.
references:
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
tags:
- attack.T1003_001
date: '2019-12-11'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
    TargetImage|contains: '*lsass.exe'
    CallTrace|contains: '*dbgcore.dll*'
  selection_1:
    CallTrace|contains: '*dbghelp.dll*'
  condition: selection_0 and selection_1
