title: Advanced IP or Port Scanner Execution
id: 9a4e50c7-5b62-4d52-93b4-f2b61332e9a5
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects the execution of network scanning utilities such as Advanced IP Scanner or Advanced Port Scanner.
  These legitimate administrative tools are often leveraged by threat actors and ransomware operators during the discovery phase to enumerate active hosts and open ports within a target environment.
  Detection is based on process creation telemetry referencing known executable names, original file names, or specific command-line parameters such as "/portable" and "/lng" that are characteristic of these tools.
  If confirmed malicious, this activity may indicate internal reconnaissance aimed at identifying reachable systems or services prior to lateral movement or further post-compromise actions.
references:
- https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
- https://cloud.google.com/blog/topics/threat-intelligence/tactics-techniques-procedures-associated-with-maze-ransomware-incidents/
- https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf
- https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20IP%20Scanner
tags:
- attack.t1046
- attack.t1135
date: '2025-10-24'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

    from datamodel=Endpoint.Processes where
      Processes.process_name IN ("advanced_ip_scanner.exe", "advanced_ip_scanner_console.exe", "advanced_port_scanner.exe", "advanced_port_scanner_console.exe")
      OR
      Processes.original_file_name IN ("advanced_ip_scanner.exe", "advanced_ip_scanner_console.exe", "advanced_port_scanner.exe", "advanced_port_scanner_console.exe")
      OR (
      Processes.process = "* /portable *"
      Processes.process = "* /lng *"
      )

    by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
       Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
       Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
       Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `advanced_ip_or_port_scanner_execution_filter`
splunk_rule_id: 9a4e50c7-5b62-4d52-93b4-f2b61332e9a5
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image:
    - advanced_ip_scanner.exe
    - advanced_ip_scanner_console.exe
    - advanced_port_scanner.exe
    - advanced_port_scanner_console.exe
  selection_1:
    OriginalFileName:
    - advanced_ip_scanner.exe
    - advanced_ip_scanner_console.exe
    - advanced_port_scanner.exe
    - advanced_port_scanner_console.exe
  selection_2:
    CommandLine|contains: '* /portable *'
  condition: selection_0 and selection_1 and selection_2
