title: Advanced IP or Port Scanner Execution
id: 9a4e50c7-5b62-4d52-93b4-f2b61332e9a5
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects the execution of network scanning utilities such as Advanced IP Scanner or Advanced Port Scanner.
  These legitimate administrative tools are often leveraged by threat actors and ransomware operators during the discovery phase to enumerate active hosts and open ports within a target environment.
  Detection is based on process creation telemetry referencing known executable names, original file names, or specific command-line parameters such as "/portable" and "/lng" that are characteristic of these tools.
  If confirmed malicious, this activity may indicate internal reconnaissance aimed at identifying reachable systems or services prior to lateral movement or further post-compromise actions.
references:
- https://news.sophos.com/en-us/2019/12/09/snatch-ransomware-reboots-pcs-into-safe-mode-to-bypass-protection/
- https://cloud.google.com/blog/topics/threat-intelligence/tactics-techniques-procedures-associated-with-maze-ransomware-incidents/
- https://assets.documentcloud.org/documents/20444693/fbi-pin-egregor-ransomware-bc-01062021.pdf
- https://thedfirreport.com/2021/01/18/all-that-for-a-coinminer
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20IP%20Scanner
tags:
- attack.T1046
- attack.T1135
date: '2025-10-24'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - advanced_ip_scanner.exe
    - advanced_ip_scanner_console.exe
    - advanced_port_scanner.exe
    - advanced_port_scanner_console.exe
  selection_1:
    OriginalFileName|contains:
    - advanced_ip_scanner.exe
    - advanced_ip_scanner_console.exe
    - advanced_port_scanner.exe
    - advanced_port_scanner_console.exe
  selection_2:
    CommandLine|contains: '* /portable *'
  condition: selection_0 and selection_1 and selection_2
