title: Allow File And Printing Sharing In Firewall
id: ce27646e-d411-11eb-8a00-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the modification of firewall settings to allow file and printer sharing. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line
  executions involving 'netsh' commands that enable file and printer sharing. This activity is significant because it can indicate an attempt by ransomware to discover and encrypt files on additional machines
  connected to the compromised host. If confirmed malicious, this could lead to widespread file encryption across the network, significantly increasing the impact of a ransomware attack.
references:
- https://community.fortinet.com:443/t5/FortiEDR/How-FortiEDR-detects-and-blocks-Revil-Ransomware-aka-sodinokibi/ta-p/189638?externalID=FD52469
- https://app.any.run/tasks/c0f98850-af65-4352-9746-fbebadee4f05/
tags:
- attack.t1686.001
date: '2021-06-23'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where
  `process_netsh`
  Processes.process= "*firewall*"
  Processes.process= "*group=\"File and Printer Sharing\"*"
  Processes.process="*enable=Yes*"
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process
     Processes.process_exec Processes.process_guid Processes.process_hash
     Processes.process_id Processes.process_integrity_level Processes.process_name
     Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `allow_file_and_printing_sharing_in_firewall_filter`
splunk_rule_id: ce27646e-d411-11eb-8a00-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: firewall
  selection_1:
    CommandLine|contains: group=\"File and Printer Sharing\"
  selection_2:
    CommandLine|contains: enable=Yes
  condition: selection_0 and selection_1 and selection_2
