title: Anomalous usage of 7zip
id: 9364ee8e-a39a-11eb-8f1d-acde48001122
status: stable
level: medium
author: Michael Haag, Teoderick Contreras, Splunk
description: The following analytic detects the execution of 7z.exe, a 7-Zip utility, spawned from rundll32.exe or dllhost.exe. This behavior is identified using Endpoint Detection and Response (EDR) telemetry,
  focusing on process names and parent processes. This activity is significant as it may indicate an adversary attempting to use 7-Zip for data exfiltration, often by renaming the executable to evade detection.
  If confirmed malicious, this could lead to unauthorized data archiving and exfiltration, compromising sensitive information and potentially leading to further system exploitation.
references:
- https://attack.mitre.org/techniques/T1560/001/
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
- https://thedfirreport.com/2021/01/31/bazar-no-ryuk/
tags:
- attack.T1560_001
date: '2021-04-22'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - rundll32.exe
    - dllhost.exe
  selection_1:
    Image|contains: '*7z*'
  filter_2:
    Image: C:\Program Files\VMware\VMware Tools\7za.exe
  condition: (selection_0 and selection_1) and not (filter_2)
