title: Certutil exe certificate extraction
id: 337a46be-600f-11eb-ae93-0242ac130002
status: stable
level: medium
author: Rod Soto, Splunk
description: |-
  The following analytic identifies the use of certutil.exe with arguments indicating the manipulation or extraction of certificates.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments.
  This activity is significant because extracting certificates can allow attackers to sign new authentication tokens, particularly in federated environments like Windows ADFS.
  If confirmed malicious, this could enable attackers to forge authentication tokens, potentially leading to unauthorized access and privilege escalation within the network.
references:
- https://blog.sygnia.co/detection-and-hunting-of-golden-saml-attack
- https://strontic.github.io/xcyclopedia/library/certutil.exe-09A8A29BAA3A451713FD3D07943B4A43.html
tags:
- attack.T1649
date: '2021-01-26'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: certutil.exe
  selection_1:
    OriginalFileName: certutil.exe
  selection_2:
    CommandLine|contains: '*-exportPFX*'
  condition: selection_0 and selection_1 and selection_2
