title: Certutil exe certificate extraction
id: 337a46be-600f-11eb-ae93-0242ac130002
status: stable
level: medium
author: Rod Soto, Splunk
description: |-
  The following analytic identifies the use of certutil.exe with arguments indicating the manipulation or extraction of certificates.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments.
  This activity is significant because extracting certificates can allow attackers to sign new authentication tokens, particularly in federated environments like Windows ADFS.
  If confirmed malicious, this could enable attackers to forge authentication tokens, potentially leading to unauthorized access and privilege escalation within the network.
references:
- https://blog.sygnia.co/detection-and-hunting-of-golden-saml-attack
- https://strontic.github.io/xcyclopedia/library/certutil.exe-09A8A29BAA3A451713FD3D07943B4A43.html
tags:
- attack.t1649
date: '2021-01-26'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
  FROM datamodel=Endpoint.Processes
  WHERE
  (
      Processes.process_name=certutil.exe
      OR
      Processes.original_file_name=certutil.exe
  )
  Processes.process = "*-exportPFX*"

  BY Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `certutil_exe_certificate_extraction_filter`
splunk_rule_id: 337a46be-600f-11eb-ae93-0242ac130002
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: certutil.exe
  selection_1:
    OriginalFileName: certutil.exe
  selection_2:
    CommandLine|contains: -exportPFX
  condition: selection_0 and selection_1 and selection_2
