title: Check Elevated CMD using whoami
id: a9079b18-1633-11ec-859c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the execution of the "whoami" command with the "/group" flag, where the results are passed to the "find" command in order to look for a the string "12288".
  This string represents the SID of the group "Mandatory Label\High Mandatory Level" effectively checking if the current process is running as a "High" integrity process or with Administrator privileges.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and command-line telemetry. This activity is significant because it is commonly used by attackers, such as FIN7,
  to perform reconnaissance on a compromised host. If confirmed malicious, this behavior could indicate an attacker is assessing their privilege level, potentially leading to further privilege escalation
  or persistence within the environment.
tags:
- attack.T1033
date: '2021-09-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*whoami*'
  selection_1:
    CommandLine|contains: '*/group*'
  selection_2:
    CommandLine|contains: '* find *'
  selection_3:
    CommandLine|contains: '*12288*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
