title: Child Processes of Spoolsv exe
id: aa0c4aeb-5b18-41c4-8c07-f1442d7599df
status: experimental
level: medium
author: Rico Valdez, Splunk
description: The following analytic identifies child processes spawned by spoolsv.exe, the Print Spooler service in Windows, which typically runs with SYSTEM privileges. This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships. Monitoring this activity is crucial as it can indicate exploitation attempts, such as those associated
  with CVE-2018-8440, which can lead to privilege escalation. If confirmed malicious, attackers could gain SYSTEM-level access, allowing them to execute arbitrary code, escalate privileges, and potentially
  compromise the entire system.
tags:
- attack.T1068
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: spoolsv.exe
  selection_1:
    process_name!: regsvr32.exe
  condition: selection_0 and selection_1
