title: Cisco NVM - Rundll32 Abuse of MSHTML.DLL for Payload Download
id: 18f0d27d-569e-4bc4-96e1-09b214fa73c0
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic detects suspicious use of `rundll32.exe` in combination with `mshtml.dll` and the export `RunHTMLApplication`.
  This behavior is often observed in malware to execute JavaScript or VBScript in memory, enabling payload staging or
  bypassing script execution policies and bypassing the usage of the "mshta.exe" binary.
  The detection leverages Cisco Network Visibility Module telemetry which offers network flow activity
  along with process information such as command-line arguments
  If confirmed malicious, this activity may indicate initial access or payload download.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Rundll32/
- https://redcanary.com/blog/threat-detection/threat-research-questions/
- https://twitter.com/n1nj4sec/status/1421190238081277959
- https://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_TROJAN.WIN32.POWESSERE.G_MITIGATION_BYPASS_PART2.txt
- http://hyp3rlinx.altervista.org/advisories/MICROSOFT_WINDOWS_DEFENDER_DETECTION_BYPASS.txt
tags:
- attack.T1218_005
date: '2025-07-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: rundll32.exe
  selection_1:
    process_arguments|contains: '*mshtml*'
  selection_2:
    process_arguments|contains:
    - '*135*'
    - '*RunHTMLApplication*'
  condition: selection_0 and selection_1 and selection_2
