title: Cisco NVM - Installation of Typosquatted Python Package
id: 5e3f6b44-42cb-4f8a-99f0-59e78a52ea1d
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic detects suspicious python package installations where the package name resembles popular Python libraries but may be typosquatted or slightly altered.
  Typosquatting is a common technique used by attackers to trick users into installing malicious packages that mimic legitimate ones.
  This detection leverages Cisco NVM flow telemetry and checks for pip or poetry package managers with the "install" or "add" flags, making outbound connections to package repository such as `pypi.org` with known or suspected typo package names.
references:
- https://securelist.com/two-more-malicious-python-packages-in-the-pypi/107218/
- https://blog.checkpoint.com/securing-the-cloud/pypi-inundated-by-malicious-typosquatting-campaign/
- https://rhisac.org/threat-intelligence/typosquatting-campaign-targets-python-developers-with-hundreds-of-malicious-libraries/
tags:
- attack.T1059
date: '2025-07-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    dest_hostname|contains:
    - '*.pythonhosted.org'
    - '*pypi.org'
    - '*python-poetry.org'
  selection_1:
    process_arguments|contains: '*pip*'
  selection_2:
    process_arguments|contains: '*poetry*'
  condition: selection_0 and selection_1 and selection_2
