title: Cisco Isovalent - Cron Job Creation
id: 94531a31-a041-4777-909f-cd92ed3b71ad
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the creation of a cron job within the Cisco Isovalent environment. It identifies this activity by monitoring process execution logs for cron job creation events.
  This behavior is significant for a SOC as it could allow an attacker to execute malicious tasks repeatedly and automatically, posing a threat to the Kubernetes infrastructure. If confirmed malicious,
  this activity could lead to persistent attacks, service disruptions, or unauthorized access to sensitive information.
references:
- https://attack.mitre.org/techniques/T1053/003/
- https://medium.com/@bag0zathev2/cronjobs-for-hackers-bugbounty-article-7d51588d0fd5
- https://kubernetes.io/docs/concepts/workloads/controllers/cron-jobs/
tags:
- attack.T1053_003
- attack.T1053_007
date: '2026-01-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - crond
    - cron
    - crontab
  condition: selection_0
