title: Cisco NVM - Suspicious File Download via Headless Browser
id: cd0e816f-f67d-4dbe-a153-480b546e867e
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic identifies the use of Chromium-based browsers (like Microsoft Edge) running in headless mode with the `--dump-dom` argument.
  This behavior has been observed in attack campaigns such as DUCKTAIL, where browsers are automated to stealthily download content from the internet using direct URLs or suspicious hosting platforms.
  The detection focuses on identifying connections to known file-sharing domains or direct IPs extracted from command-line arguments and cross-checks those against the destination of the flow.
  Since it leverages Cisco Network Visibility Module telemetry, the rule triggers only if a network connection is made.
references:
- https://labs.withsecure.com/content/dam/labs/docs/WithSecure_Research_DUCKTAIL.pdf
- https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
- https://x.com/mrd0x/status/1478234484881436672?s=12
- https://developer.chrome.com/docs/chromium/headless
tags:
- attack.T1105
- attack.T1059
date: '2025-07-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - brave.exe
    - chrome.exe
    - msedge.exe
    - opera.exe
    - vivaldi.exe
  selection_1:
    Image|contains:
    - brave.exe
    - chrome.exe
    - msedge.exe
    - opera.exe
    - vivaldi.exe
  selection_2:
    parent_process_arguments|contains: '*--headless*'
  selection_3:
    process_arguments|contains: '*--headless*'
  filter_4:
    dest:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
    - ::1
  condition: (selection_0 and selection_1 and selection_2 and selection_3) and not (filter_4)
