title: Cisco NVM - Susp Script From Archive Triggering Network Activity
id: 8b07c2c9-0cde-4c44-9fa6-59dcf2b25777
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic detects script execution (`wscript.exe` or `cscript.exe`) triggered from compressed files opened directly using
  `explorer.exe`, `winrar.exe`, or `7zFM.exe`.
  When a user double clicks on a ".js" file from within one of these compressed files. Its extracted temporally in the temp directory in folder with certain markers.
  It leverages Cisco Network Visibility Module (NVM) flow data, in order to look for a specific parent/child relationship and an initiated network connection.
  This behavior is exploited by threat actors such as Scarlet Goldfinch to deliver and run malicious scripts as an initial access technique.
references:
- https://redcanary.com/threat-detection-report/threats/scarlet-goldfinch/
tags:
- attack.t1059.005
- attack.t1204.002
date: '2025-07-01'
original_spl: |-
  `cisco_network_visibility_module_flowdata`
  parent_process_name IN ("explorer.exe", "winrar.exe", "7zFM.exe")
  process_name IN ("wscript.exe", "cscript.exe")
  process_arguments = "*\\AppData\\Local\\Temp\\*"
  process_arguments IN ("*\\rar*", "*\\7z*", "*.zip*")
  | stats count min(_time) as firstTime max(_time) as lastTime
          values(parent_process_arguments) as parent_process_arguments
          values(process_arguments) as process_arguments
          values(parent_process_hash) as parent_process_hash
          values(process_hash) as process_hash
          values(module_name_list) as module_name_list
          values(module_hash_list) as module_hash_list
          values(dest_port) as dest_port
          values(aliul) as additional_logged_in_users_list
          values(dest_hostname) as dest_hostname
          by src dest parent_process_path parent_process_name parent_process_integrity_level process_path process_name process_integrity_level process_id transport
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | table
    parent_process_integrity_level parent_process_name parent_process_path parent_process_arguments parent_process_hash
    process_integrity_level process_path process_name process_arguments process_hash process_id
    additional_logged_in_users_list module_name_list module_hash_list
    src dest_hostname dest dest_port transport firstTime lastTime
  | `cisco_nvm___susp_script_from_archive_triggering_network_activity_filter`
splunk_rule_id: 8b07c2c9-0cde-4c44-9fa6-59dcf2b25777
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    parent_process_name:
    - explorer.exe
    - winrar.exe
    - 7zFM.exe
  selection_1:
    process_name:
    - wscript.exe
    - cscript.exe
  selection_2:
    process_arguments|contains: \AppData\Local\Temp\
  selection_3:
    process_arguments|contains:
    - \rar
    - \7z
    - .zip
  condition: selection_0 and selection_1 and selection_2 and selection_3
