title: Cisco NVM - Suspicious File Download via Headless Browser
id: cd0e816f-f67d-4dbe-a153-480b546e867e
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic identifies the use of Chromium-based browsers (like Microsoft Edge) running in headless mode with the `--dump-dom` argument.
  This behavior has been observed in attack campaigns such as DUCKTAIL, where browsers are automated to stealthily download content from the internet using direct URLs or suspicious hosting platforms.
  The detection focuses on identifying connections to known file-sharing domains or direct IPs extracted from command-line arguments and cross-checks those against the destination of the flow.
  Since it leverages Cisco Network Visibility Module telemetry, the rule triggers only if a network connection is made.
references:
- https://labs.withsecure.com/content/dam/labs/docs/WithSecure_Research_DUCKTAIL.pdf
- https://www.trendmicro.com/en_us/research/23/e/managed-xdr-investigation-of-ducktail-in-trend-micro-vision-one.html
- https://x.com/mrd0x/status/1478234484881436672?s=12
- https://developer.chrome.com/docs/chromium/headless
tags:
- attack.t1105
- attack.t1059
date: '2025-07-01'
original_spl: |-
  `cisco_network_visibility_module_flowdata`

   ``` Usually the initiator of the connection is the child process, meaning the parent will contain the suspicious command.```

   (
     parent_process_name IN ("brave.exe", "chrome.exe", "msedge.exe", "opera.exe", "vivaldi.exe")
     OR
     process_name IN ("brave.exe", "chrome.exe", "msedge.exe", "opera.exe", "vivaldi.exe")
   )
   (
     (parent_process_arguments="*--headless*" parent_process_arguments="*--dump-dom*")
     OR
     (process_arguments="*--headless*" process_arguments="*--dump-dom*")
   )
   NOT dest IN (
           "10.0.0.0/8", "172.16.0.0/12", "192.168.0.0/16", "100.64.0.0/10",
           "127.0.0.0/8", "169.254.0.0/16", "192.0.0.0/24", "192.0.0.0/29", "192.0.0.8/32",
           "192.0.0.9/32", "192.0.0.10/32", "192.0.0.170/32", "192.0.0.171/32", "192.0.2.0/24",
           "192.31.196.0/24", "192.52.193.0/24", "192.88.99.0/24", "224.0.0.0/4", "192.175.48.0/24",
           "198.18.0.0/15", "198.51.100.0/24", "203.0.113.0/24", "240.0.0.0/4", "::1"
           )

   ``` In order to avoid matching with any public IP, we extract the IP value from the CommandLine and filter on it```

   | rex field=parent_process_arguments "(?i)\\b(?:https?|ftp)://(?<extracted_ip_parent>(?:\\d{1,3}\\.){3}\\d{1,3})"
   | rex field=process_arguments "(?i)\\b(?:https?|ftp)://(?<extracted_ip_child>(?:\\d{1,3}\\.){3}\\d{1,3})"
   | eval direct_ip_match=if(dest == extracted_ip_child, 1, if(dest == extracted_ip_parent, 1, 0))

   | where (
       dest_hostname IN (
           "*.githubusercontent.com*", "*anonfiles.com*", "*cdn.discordapp.com*", "*ddns.net*",
           "*dl.dropboxusercontent.com*", "*ghostbin.co*", "*glitch.me*", "*gofile.io*",
           "*hastebin.com*", "*mediafire.com*", "*mega.nz*", "*onrender.com*", "*pages.dev*",
           "*paste.ee*", "*pastebin.*", "*pastetext.net*", "*privatlab.*",
           "*send.exploit.in*", "*sendspace.com*", "*storage.googleapis.com*",
           "*storjshare.io*", "*supabase.co*", "*temp.sh*", "*transfer.sh*", "*trycloudflare.com*",
           "*ufile.io*", "*w3spaces.com*", "*workers.dev*"
       )
       OR direct_ip_match = 1
     )

   | stats count min(_time) as firstTime max(_time) as lastTime
           values(parent_process_arguments) as parent_process_arguments
           values(process_arguments) as process_arguments
           values(parent_process_hash) as parent_process_hash
           values(process_hash) as process_hash
           values(module_name_list) as module_name_list
           values(module_hash_list) as module_hash_list
           values(dest_port) as dest_port
           values(aliul) as additional_logged_in_users_list
           values(dest_hostname) as dest_hostname
           by src dest parent_process_path parent_process_name parent_process_integrity_level process_path process_name process_integrity_level process_id transport
   | `security_content_ctime(firstTime)`
   | `security_content_ctime(lastTime)`
   | table
     parent_process_integrity_level parent_process_path parent_process_name parent_process_arguments parent_process_hash
     process_integrity_level process_path process_name process_arguments process_hash process_id
     additional_logged_in_users_list module_name_list module_hash_list
     src dest_hostname dest dest_port transport firstTime lastTime
   | `cisco_nvm___suspicious_file_download_via_headless_browser_filter`
splunk_rule_id: cd0e816f-f67d-4dbe-a153-480b546e867e
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    parent_process_name:
    - brave.exe
    - chrome.exe
    - msedge.exe
    - opera.exe
    - vivaldi.exe
  selection_1:
    process_name:
    - brave.exe
    - chrome.exe
    - msedge.exe
    - opera.exe
    - vivaldi.exe
  selection_2:
    parent_process_arguments|contains: '*--headless*'
  selection_3:
    process_arguments|contains: '*--headless*'
  filter_4:
    dest:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
    - ::1
  condition: (selection_0 and selection_1 and selection_2 and selection_3) and not (filter_4)
