title: Cisco NVM - Suspicious Network Connection Initiated via MsXsl
id: 1cbcf75f-0e45-4f29-8c1b-7fcd7e55cc55
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic identifies the use of `msxsl.exe` initiating a network connection to a non-private IP address.
  Although `msxsl.exe` is a legitimate Microsoft utility used to apply XSLT transformations, adversaries can abuse it
  to execute arbitrary code or load external resources in an evasive manner.
  This detection leverages Cisco NVM telemetry to identify potentially malicious use of `msxsl.exe` making network connections
  that may indicate command and control (C2) or data exfiltration activity.
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Msxsl/
tags:
- attack.T1220
date: '2025-07-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: msxsl.exe
  filter_1:
    dest:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
    - ::1
  condition: (selection_0) and not (filter_1)
