title: Cisco NVM - Susp Script From Archive Triggering Network Activity
id: 8b07c2c9-0cde-4c44-9fa6-59dcf2b25777
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic detects script execution (`wscript.exe` or `cscript.exe`) triggered from compressed files opened directly using
  `explorer.exe`, `winrar.exe`, or `7zFM.exe`.
  When a user double clicks on a ".js" file from within one of these compressed files. Its extracted temporally in the temp directory in folder with certain markers.
  It leverages Cisco Network Visibility Module (NVM) flow data, in order to look for a specific parent/child relationship and an initiated network connection.
  This behavior is exploited by threat actors such as Scarlet Goldfinch to deliver and run malicious scripts as an initial access technique.
references:
- https://redcanary.com/threat-detection-report/threats/scarlet-goldfinch/
tags:
- attack.T1059_005
- attack.T1204_002
date: '2025-07-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - explorer.exe
    - winrar.exe
    - 7zFM.exe
  selection_1:
    Image|contains:
    - wscript.exe
    - cscript.exe
  selection_2:
    process_arguments|contains: '*\AppData\Local\Temp\*'
  selection_3:
    process_arguments|contains:
    - '*\rar*'
    - '*\7z*'
    - '*.zip*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
