title: Cisco NVM - Rclone Execution With Network Activity
id: 719f8c78-b20d-4bb9-8c33-6d1a762e7a9a
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This detection identifies execution of the file synchronization utility "rclone".
  It leverages Cisco Network Visibility Module logs, specifically flow data in order to capture process executions
  initiating network connections.
  While rclone is a legitimate command-line tool for syncing data to cloud storage providers, it has been widely abused by threat actors for data exfiltration.
  This analytic inspects process name and arguments for rclone and flags usage of suspicious flags.
  If matched, this could indicate malicious usage for stealthy data exfiltration or cloud abuse.
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
- https://redcanary.com/blog/threat-detection/rclone-mega-extortion/
tags:
- attack.T1567_002
date: '2025-07-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: rclone.exe
  selection_1:
    process_arguments|contains: '* copy *'
    process_arguments:
    - '*remote:*'
    - '*mega:*'
    - '*ftp:*'
    - '*ftp1:*'
  selection_2:
    process_arguments:
    - '*remote:*'
    - '*mega:*'
    - '*ftp:*'
    - '*ftp1:*'
    process_arguments|contains: '*--transfers'
  condition: selection_0 and selection_1 and selection_2
