title: Cisco Isovalent - Curl Execution With Insecure Flags
id: c16c4899-d3f7-461b-92c2-cc0ef5758855
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the execution of curl commands with insecure flags within the Cisco Isovalent environment. It identifies this activity by monitoring process execution logs for
  curl commands that use the -k or --insecure flags. This behavior is significant for a SOC as it could allow an attacker to bypass SSL/TLS verification, potentially exposing the Kubernetes infrastructure
  to man-in-the-middle attacks. If confirmed malicious, this activity could lead to data interception, service disruptions, or unauthorized access to sensitive  information.
references:
- https://rawcode7.medium.com/understanding-the-kubernetes-attack-surface-9a48ebcb6bc4
- https://www.tutorialworks.com/kubernetes-curl/
tags:
- attack.t1105
date: '2026-01-05'
original_spl: |-
  `cisco_isovalent_process_exec`  process_name="curl"
  | regex process="(?i)(?<!\w)-(?:[a-z]*k[a-z]*|-(insecure|proxy-insecure|doh-insecure))"
  | stats count min(_time) as firstTime max(_time) as lastTime values(process) as process
      by cluster_name pod_name parent_process_name process_name process_exec process_id node_name
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_isovalent___curl_execution_with_insecure_flags_filter`
splunk_rule_id: c16c4899-d3f7-461b-92c2-cc0ef5758855
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_name: curl
  condition: selection_0
