title: Cisco Isovalent - Shell Execution
id: 12345678-abcd-1234-ef00-1234567890ab
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the execution of a shell inside a container namespace within the Cisco Isovalent environment. It identifies this activity by monitoring process execution logs
  for the execution of a shell (sh or bash) inside a container namespace. This behavior is significant for a SOC as it could allow an attacker to gain shell access to the container, potentially leading
  to further compromise of the Kubernetes cluster. If confirmed malicious, this activity could lead to data theft, service disruption, privilege escalation, lateral movement, and further attacks, severely
  compromising the cluster's security and integrity.
references:
- https://www.sysdig.com/blog/mitre-attck-framework-for-container-runtime-security-with-sysdig-falco
tags:
- attack.t1543
date: '2026-01-05'
original_spl: |-
  `cisco_isovalent_process_exec` process_name IN ("sh", "ksh", "zsh", "bash", "dash", "rbash", "fish", "csh", "tcsh", "ion", "eshell")
  | stats count by cluster_name parent_process_name process_name process_exec process_id node_name | `cisco_isovalent___shell_execution_filter`
splunk_rule_id: 12345678-abcd-1234-ef00-1234567890ab
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_name:
    - sh
    - ksh
    - zsh
    - bash
    - dash
    - rbash
    - fish
    - csh
    - tcsh
    - ion
    - eshell
  condition: selection_0
