title: Cisco NVM - Suspicious Network Connection From Process With No Args
id: 54fa06c5-96a2-4406-a4a7-44d93ddbd173
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic detects system binaries that are commonly abused in process injection techniques but are observed without any command-line arguments.
  It leverages Cisco Network Visibility Module (NVM) flow data and process arguments
  to identify outbound connections initiated by curl where TLS checks were explicitly disabled.
  Binaries such as `rundll32.exe`, `regsvr32.exe`, `dllhost.exe`, `svchost.exe`, and others are legitimate Windows processes that are often injected into by malware or post-exploitation frameworks (e.g., Cobalt Strike) to hide execution.
  When these processes are seen initiating a network connection with an empty or missing command line, it can indicate
  potential injection and communication with a command and control server.
references:
- https://redcanary.com/threat-detection-report/techniques/process-injection/
tags:
- attack.T1055
- attack.T1218
date: '2025-07-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - backgroundtaskhost.exe
    - svchost.exe
    - dllhost.exe
    - werfault.exe
    - searchprotocolhost.exe
    - wuauclt.exe
    - spoolsv.exe
    - rundll32.exe
    - regasm.exe
    - regsvr32.exe
    - regsvcs.exe
  filter_1:
    process_arguments|contains: '*'
  filter_2:
    dest:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
    - ::1
  condition: (selection_0) and not (filter_1 and filter_2)
