title: Cisco Isovalent - Potential Escape to Host
id: 2b8a7a21-bec6-4e1f-84c4-7b319f45d2ab
status: stable
level: medium
author: Bhavin Patel, Splunk
description: |
  This analytic detects potential container escape or reconnaissance attempts by monitoring for the rapid execution of multiple suspicious Linux commands (nsenter, mount, ps aux, and ls) within a short time window. The search aggregates process execution logs into 5-minute buckets and identifies when two or more distinct commands occur in quick succession. This behavior is noteworthy because attackers often chain these commands together to pivot from a container into the host, enumerate processes, or browse filesystems. For a SOC, catching these clustered command executions is important because it highlights possible adversary activity attempting to break isolation and escalate privileges inside a Kubernetes environment.
references:
- https://attack.mitre.org/techniques/T1611/
- https://unit42.paloaltonetworks.com/hildegard-malware-teamtnt/
tags:
- attack.T1611
date: '2026-01-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - nsenter
    - mount
    - ps
    - ls
  selection_1:
    CommandLine|contains:
    - '*nsenter*'
    - '*mount*'
    - '*ps aux*'
    - '*ps -ef*'
  condition: selection_0 and selection_1
