title: Cisco NVM - Curl Execution With Insecure Flags
id: cc695238-3117-4e60-aa83-4beac2a42c69
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic detects the use of `curl.exe` with insecure flags such as `-k`, `--insecure`, `--proxy-insecure`, or `--doh-insecure`
  which disable TLS certificate validation.
  It leverages Cisco Network Visibility Module (NVM) flow data and process arguments
  to identify outbound connections initiated by curl where TLS checks were explicitly disabled.
  This behavior may indicate an attempt to bypass certificate validation to connect to potentially untrusted or malicious endpoints,
  a common tactic in red team operations, malware staging, or data exfiltration over HTTPS.
references:
- https://thedfirreport.com/2025/05/19/another-confluence-bites-the-dust-falling-to-elpaco-team-ransomware/
tags:
- attack.T1197
date: '2025-07-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: curl.exe
  filter_1:
    dest:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
    - ::1
  condition: (selection_0) and not (filter_1)
