title: Cisco NVM - Rclone Execution With Network Activity
id: 719f8c78-b20d-4bb9-8c33-6d1a762e7a9a
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This detection identifies execution of the file synchronization utility "rclone".
  It leverages Cisco Network Visibility Module logs, specifically flow data in order to capture process executions
  initiating network connections.
  While rclone is a legitimate command-line tool for syncing data to cloud storage providers, it has been widely abused by threat actors for data exfiltration.
  This analytic inspects process name and arguments for rclone and flags usage of suspicious flags.
  If matched, this could indicate malicious usage for stealthy data exfiltration or cloud abuse.
references:
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://thedfirreport.com/2021/10/04/bazarloader-and-the-conti-leaks/
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
- https://redcanary.com/blog/threat-detection/rclone-mega-extortion/
tags:
- attack.t1567.002
date: '2025-07-01'
original_spl: |-
  `cisco_network_visibility_module_flowdata`
  (
    process_name = "rclone.exe"
    OR
    (
      process_arguments = "* copy *"
      process_arguments = "*\\\\*"
      process_arguments IN ("*remote:*", "*mega:*", "*ftp:*", "*ftp1:*")
    )
    OR
    (
      process_arguments IN ("*remote:*", "*mega:*", "*ftp:*", "*ftp1:*")
      process_arguments = "*--transfers"
      process_arguments = "*--ignore-existing*"
      process_arguments = "*--auto-confirm*"
    )
  )
  | stats count min(_time) as firstTime max(_time) as lastTime
          values(parent_process_arguments) as parent_process_arguments
          values(process_arguments) as process_arguments
          values(parent_process_hash) as parent_process_hash
          values(process_hash) as process_hash
          values(module_name_list) as module_name_list
          values(module_hash_list) as module_hash_list
          values(dest_port) as dest_port
          values(aliul) as additional_logged_in_users_list
          values(dest_hostname) as dest_hostname
          by src dest parent_process_path parent_process_integrity_level process_path process_name process_integrity_level process_id transport
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | table
    parent_process_integrity_level parent_process_path parent_process_arguments parent_process_hash
    process_integrity_level process_path process_name process_arguments process_hash process_id
    additional_logged_in_users_list module_name_list module_hash_list
    src dest_hostname dest dest_port transport firstTime lastTime
  | `cisco_nvm___rclone_execution_with_network_activity_filter`
splunk_rule_id: 719f8c78-b20d-4bb9-8c33-6d1a762e7a9a
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_name: rclone.exe
  selection_1:
    process_arguments|contains: '* copy *'
    process_arguments:
    - '*remote:*'
    - '*mega:*'
    - '*ftp:*'
    - '*ftp1:*'
  selection_2:
    process_arguments:
    - '*remote:*'
    - '*mega:*'
    - '*ftp:*'
    - '*ftp1:*'
    process_arguments|endswith: '*--transfers'
    process_arguments|contains: '*--ignore-existing*'
  condition: selection_0 and selection_1 and selection_2
