title: Cisco Isovalent - Cron Job Creation
id: 94531a31-a041-4777-909f-cd92ed3b71ad
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the creation of a cron job within the Cisco Isovalent environment. It identifies this activity by monitoring process execution logs for cron job creation events.
  This behavior is significant for a SOC as it could allow an attacker to execute malicious tasks repeatedly and automatically, posing a threat to the Kubernetes infrastructure. If confirmed malicious,
  this activity could lead to persistent attacks, service disruptions, or unauthorized access to sensitive information.
references:
- https://attack.mitre.org/techniques/T1053/003/
- https://medium.com/@bag0zathev2/cronjobs-for-hackers-bugbounty-article-7d51588d0fd5
- https://kubernetes.io/docs/concepts/workloads/controllers/cron-jobs/
tags:
- attack.t1053.003
- attack.t1053.007
date: '2026-01-05'
original_spl: |-
  `cisco_isovalent_process_exec` process_name IN ("crond","cron","crontab")
  | search pod_name!=""
  | stats count
          min(_time) as firstTime
          max(_time) as lastTime
          values(process) as process
      by cluster_name pod_name parent_process_name process_name process_exec process_id node_name
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_isovalent___cron_job_creation_filter`
splunk_rule_id: 94531a31-a041-4777-909f-cd92ed3b71ad
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_name:
    - crond
    - cron
    - crontab
  condition: selection_0
