title: CMLUA Or CMSTPLUA UAC Bypass
id: f87b5062-b405-11eb-a889-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of COM objects like CMLUA or CMSTPLUA to bypass User Account Control (UAC). It leverages Sysmon EventCode 7 to identify the loading of specific DLLs (CMLUA.dll,
  CMSTPLUA.dll, CMLUAUTIL.dll) by processes not typically associated with these libraries. This activity is significant as it indicates an attempt to gain elevated privileges, a common tactic used by ransomware
  adversaries. If confirmed malicious, this could allow attackers to execute code with administrative rights, leading to potential system compromise and further malicious activities.
references:
- https://attack.mitre.org/techniques/T1218/003/
tags:
- attack.T1218_003
date: '2021-05-13'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains:
    - '*\CMLUA.dll'
    - '*\CMSTPLUA.dll'
    - '*\CMLUAUTIL.dll'
  filter_2:
    Image:
    - CMSTP.exe
    - CMMGR32.exe
  filter_3:
    Image:
    - '*\windows\*'
    - '*\program files*'
  condition: (selection_0 and selection_1) and not (filter_2 and filter_3)
