title: Conti Common Exec parameter
id: 624919bc-c382-11eb-adcc-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of suspicious command-line arguments commonly associated with Conti ransomware, specifically targeting local drives and network shares for encryption.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs that include command-line details. This activity is significant because it indicates a potential
  ransomware attack, which can lead to widespread data encryption and operational disruption. If confirmed malicious, the impact could be severe, resulting in data loss, system downtime, and potential ransom
  demands.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.conti
tags:
- attack.T1204
date: '2021-06-04'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '*-m local'
    - '*-m local *'
    - '*-m net'
    - '*-m net *'
    - '*-m all'
    - '*-m all *'
    - '*-nomutex'
    - '*-nomutex *'
  condition: selection_0
