title: Control Loading from World Writable Directory
id: 10423ac4-10c9-11ec-8dc4-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies instances of control.exe loading a .cpl or .inf file from a writable directory, which is related to CVE-2021-40444. This detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names and command-line executions mapped to the `Processes` node of the `Endpoint` data model. This activity is significant as it may indicate
  an attempt to exploit a known vulnerability, potentially leading to unauthorized code execution. If confirmed malicious, this could allow an attacker to gain control over the affected system, leading
  to further compromise.
references:
- https://strontic.github.io/xcyclopedia/library/rundll32.exe-111474C61232202B5B588D2B512CBB25.html
- https://app.any.run/tasks/36c14029-9df8-439c-bba0-45f2643b0c70/
- https://attack.mitre.org/techniques/T1218/011/
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.002/T1218.002.yaml
tags:
- attack.T1218_002
date: '2021-09-08'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: control.exe
  selection_1:
    OriginalFileName: CONTROL.EXE
  selection_2:
    CommandLine|contains:
    - '*\appdata\*'
    - '*\windows\temp\*'
    - '*\programdata\*'
  condition: selection_0 and selection_1 and selection_2
