title: Create Remote Thread into LSASS
id: 67d4dbef-9564-4699-8da8-03a151529edc
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: |-
  The following analytic detects the creation of a remote thread in the Local Security Authority Subsystem Service (LSASS).
  This behavior is identified using Sysmon EventID 8 logs, focusing on processes that create remote threads in lsass.exe.
  This activity is significant because it is commonly associated with credential dumping, a tactic used by adversaries to steal user authentication credentials.
  If confirmed malicious, this could allow attackers to gain unauthorized access to sensitive information, leading to potential compromise of the entire network.
  Analysts should investigate to differentiate between legitimate tools and potential threats.
references:
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
tags:
- attack.T1003_001
date: '2019-12-11'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 8
  selection_1:
    TargetImage|contains: '*\lsass.exe'
  condition: selection_0 and selection_1
