title: CSC Net On The Fly Compilation
id: ea73128a-43ab-11ec-9753-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of the .NET compiler csc.exe for on-the-fly compilation of potentially malicious .NET code. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on specific command-line patterns associated with csc.exe. This activity is significant because adversaries and malware often use this technique to evade detection by compiling malicious
  code at runtime. If confirmed malicious, this could allow attackers to execute arbitrary code, potentially leading to system compromise, data exfiltration, or further lateral movement within the network.
references:
- https://app.any.run/tasks/ad4c3cda-41f2-4401-8dba-56cc2d245488/
- https://tccontre.blogspot.com/2019/06/maicious-macro-that-compile-c-code-as.html
tags:
- attack.t1027.004
date: '2021-11-17'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name=csc.exe
          OR
          Processes.original_file_name=csc.exe
      )
      Processes.process = "*/noconfig*" Processes.process = "*/fullpaths*" Processes.process = "*@*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `csc_net_on_the_fly_compilation_filter`
splunk_rule_id: ea73128a-43ab-11ec-9753-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: csc.exe
  selection_1:
    OriginalFileName: csc.exe
  selection_2:
    CommandLine|contains: /noconfig
  selection_3:
    CommandLine|contains: /fullpaths
  selection_4:
    CommandLine|contains: '@'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
