title: Detect Renamed WinRAR
id: 1b7bfb2c-b8e6-11eb-99ac-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies instances where `WinRAR.exe` has been renamed and executed. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names
  and original file names within the Endpoint data model. This activity is significant because renaming executables is a common tactic used by attackers to evade detection. If confirmed malicious, this
  could indicate an attempt to bypass security controls, potentially leading to unauthorized data extraction or further system compromise.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560.001/T1560.001.md
tags:
- attack.t1560.001
date: '2021-06-03'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.original_file_name=WinRAR.exe (Processes.process_name!=rar.exe
      AND
      Processes.process_name!=winrar.exe)
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `detect_renamed_winrar_filter`
splunk_rule_id: 1b7bfb2c-b8e6-11eb-99ac-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: WinRAR.exe
  selection_1:
    Image: rar.exe
  selection_2:
    Image: winrar.exe
  condition: selection_0 and selection_1 and selection_2
