title: Detect Rare Executables
id: 44fddcb2-8d3b-454c-874e-7c6de5a4f7ac
status: stable
level: medium
author: Bhavin Patel, Splunk
description: |
  The following analytic detects the execution of rare processes that appear only once across the network within a specified timeframe.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs.
  This activity is significant for a SOC as it helps identify potentially malicious activities or unauthorized software, which could indicate a security breach or ongoing attack.
  If confirmed malicious, such rare processes could lead to data theft, privilege escalation, or complete system compromise, making early detection crucial for minimizing impact.
  The search currently identifies processes executed on fewer than 10 hosts, but this threshold can be adjusted based on the organization's environment and risk tolerance.
  The search groups results by process name which can lead to blind spots if a malicious process uses a common name. To mitigate this, consider enhancing the detection logic to group by additional attributes such as process hash.
tags:
- attack.T1204
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    dc_dest: 10
  condition: selection_0
