title: Detect Renamed PSExec
id: 683e6196-b8e8-11eb-9a79-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk, Alex Oberkircher, Github Community
description: The following analytic identifies instances where `PsExec.exe` has been renamed and executed on an endpoint. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process names and original file names. This activity is significant because renaming `PsExec.exe` is a common tactic to evade detection. If confirmed malicious, this could allow an attacker to execute
  commands remotely, potentially leading to unauthorized access, lateral movement, or further compromise of the network.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1569.002/T1569.002.yaml
- https://redcanary.com/blog/threat-hunting-psexec-lateral-movement/
tags:
- attack.T1569_002
date: '2021-06-03'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_name!: psexec.exe
  selection_1:
    process_name!: psexec64.exe
  selection_2:
    OriginalFileName: psexec.c
  condition: selection_0 and selection_1 and selection_2
