title: Detect HTML Help Renamed
id: 62fed254-513b-460e-953d-79771493a9f3
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances where hh.exe (HTML Help) has been renamed and is executing a Compiled HTML Help (CHM) file. This detection leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process names and original file names. This activity is significant because attackers can use renamed hh.exe to execute malicious scripts embedded in CHM files, potentially
  leading to code execution. If confirmed malicious, this technique could allow attackers to run arbitrary scripts, escalate privileges, or persist within the environment, posing a significant security
  risk.
references:
- https://attack.mitre.org/techniques/T1218/001/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.001/T1218.001.md
- https://lolbas-project.github.io/lolbas/Binaries/Hh/
tags:
- attack.T1218_001
date: '2021-02-11'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_name!: hh.exe
  selection_1:
    OriginalFileName: HH.EXE
  condition: selection_0 and selection_1
