title: Detect Regasm with Network Connection
id: 07921114-6db4-4e2e-ae58-3ea8a52ae93f
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of regasm.exe establishing a network connection to a public IP address, excluding private IP ranges. This detection leverages Sysmon EventID 3 logs
  to identify such behavior. This activity is significant as regasm.exe is a legitimate Microsoft-signed binary that can be exploited to bypass application control mechanisms. If confirmed malicious, this
  behavior could indicate an adversary's attempt to establish a remote Command and Control (C2) channel, potentially leading to privilege escalation and further malicious actions within the environment.
references:
- https://attack.mitre.org/techniques/T1218/009/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.009/T1218.009.md
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
tags:
- attack.T1218_009
date: '2021-02-16'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 3
  selection_1:
    Image: regasm.exe
  filter_2:
    DestinationIp:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
  condition: (selection_0 and selection_1) and not (filter_2)
