title: Detect PsExec With accepteula Flag
id: 27c3a83d-cada-47c6-9042-67baf19d2574
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies the execution of `PsExec.exe` with the `accepteula` flag in the command line. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on process execution logs and command-line arguments. This activity is significant because PsExec is commonly used by threat actors to execute code on remote systems, and the `accepteula` flag indicates
  first-time usage, which could signify initial compromise. If confirmed malicious, this activity could allow attackers to gain remote code execution capabilities, potentially leading to further system
  compromise and lateral movement within the network.
references:
- https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
tags:
- attack.T1021_002
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - psexec.exe
    - psexec64.exe
  selection_1:
    OriginalFileName: psexec.c
  selection_2:
    CommandLine|contains: '*accepteula*'
  condition: selection_0 and selection_1 and selection_2
