title: Detection of tools built by NirSoft
id: 3d8d201c-aa03-422d-b0ee-2e5ecf9718c0
status: experimental
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies the execution of tools built by NirSoft by detecting specific command-line arguments such as "/stext" and "/scomma". It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names, parent processes, and command-line executions. This activity is significant because NirSoft tools, while legitimate, can be exploited by attackers
  for malicious purposes such as credential theft or system reconnaissance. If confirmed malicious, this activity could lead to unauthorized access, data exfiltration, or further compromise of the affected
  system.
tags:
- attack.T1072
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '* /stext *'
  selection_1:
    CommandLine|contains: '* /scomma *'
  condition: selection_0 and selection_1
