title: Detect Credential Dumping through LSASS access
id: 2c365e57-4414-4540-8dc0-73ab10729996
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects attempts to read LSASS memory, indicative of credential dumping. It leverages Sysmon EventCode 10, filtering for specific access permissions (0x1010 and 0x1410)
  on the lsass.exe process. This activity is significant because it suggests an attacker is trying to extract credentials from LSASS memory, potentially leading to unauthorized access, data breaches, and
  compromise of sensitive information. If confirmed malicious, this could enable attackers to escalate privileges, move laterally within the network, or exfiltrate data. Extensive triage is necessary to
  differentiate between malicious and benign activities.
tags:
- attack.T1003_001
date: '2019-12-11'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains: '*lsass.exe'
  selection_2:
    GrantedAccess: '0x1010'
  selection_3:
    GrantedAccess: '0x1410'
  condition: selection_0 and selection_1 and selection_2 and selection_3
