title: Detect mshta renamed
id: 8f45fcf0-5b68-11eb-ae93-0242ac130002
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies instances where mshta.exe has been renamed and executed. It leverages Endpoint Detection and Response (EDR) data, specifically focusing on the original file
  name field to detect discrepancies. This activity is significant because renaming mshta.exe is a common tactic used by attackers to evade detection and execute malicious scripts. If confirmed malicious,
  this could allow an attacker to execute arbitrary code, potentially leading to system compromise, data exfiltration, or further lateral movement within the network.
references:
- https://github.com/redcanaryco/AtomicTestHarnesses
- https://redcanary.com/blog/introducing-atomictestharnesses/
tags:
- attack.T1218_005
date: '2021-01-15'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_name!: mshta.exe
  selection_1:
    OriginalFileName: MSHTA.EXE
  condition: selection_0 and selection_1
