title: Detect Excessive Account Lockouts From Endpoint
id: c026e3dd-7e18-4abb-8f41-929e836efe74
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects endpoints causing a high number of account lockouts within a short period. It leverages the Windows security event logs ingested into the `Change` datamodel,
  specifically under the `Account_Management` node, to identify and count lockout events. This activity is significant as it may indicate a brute-force attack or misconfigured system causing repeated authentication
  failures. If confirmed malicious, this behavior could lead to account lockouts, disrupting user access and potentially indicating an ongoing attack attempting to compromise user credentials.
tags:
- attack.T1078_002
date: '2020-04-29'
logsource:
  category: process_creation
detection:
  selection_0:
    Result|contains: '*lock*'
  condition: selection_0
