title: Detect AzureHound Command-Line Arguments
id: 26f02e96-c300-11eb-b611-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of the `Invoke-AzureHound` command-line argument, commonly used by the AzureHound tool. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process names and command-line executions. This activity is significant because AzureHound is often used for reconnaissance in Azure environments, potentially exposing sensitive information.
  If confirmed malicious, this activity could allow an attacker to map out Azure Active Directory structures, aiding in further attacks and privilege escalation.
references:
- https://attack.mitre.org/software/S0521/
- https://github.com/BloodHoundAD/BloodHound/tree/master/Collectors
- https://posts.specterops.io/introducing-bloodhound-4-0-the-azure-update-9b2b26c5e350
- https://github.com/BloodHoundAD/Legacy-AzureHound.ps1/blob/master/AzureHound.ps1
tags:
- attack.T1069_001
- attack.T1069_002
- attack.T1087_001
- attack.T1087_002
- attack.T1482
date: '2021-06-03'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*invoke-azurehound*'
  condition: selection_0
