title: Detect Renamed 7-Zip
id: 4057291a-b8cf-11eb-95fe-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the usage of a renamed 7-Zip executable using Sysmon data. It leverages the OriginalFileName field to identify instances where the 7-Zip process has been renamed.
  This activity is significant as attackers often rename legitimate tools to evade detection while staging or exfiltrating data. If confirmed malicious, this behavior could indicate data exfiltration attempts
  or other unauthorized data manipulation, potentially leading to significant data breaches or loss of sensitive information. Analysts should validate the legitimacy of the 7-Zip executable and investigate
  parallel processes for further suspicious activities.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1560.001/T1560.001.md
tags:
- attack.T1560_001
date: '2021-06-03'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: 7
  selection_1:
    process_name!: 7
  condition: selection_0 and selection_1
