title: Detect RClone Command-Line Usage
id: 32e0baea-b3f1-11eb-a2ce-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the usage of `rclone.exe` with specific command-line arguments indicative of file transfer activities. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on command-line executions and process details. This activity is significant as `rclone.exe` is often used by adversaries for data exfiltration, especially during ransomware attacks.
  If confirmed malicious, this behavior could lead to unauthorized data transfer, resulting in data breaches and potential loss of sensitive information. Immediate isolation of the affected endpoint and
  further investigation are recommended.
references:
- https://redcanary.com/blog/rclone-mega-extortion/
- https://www.mandiant.com/resources/shining-a-light-on-darkside-ransomware-operations
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
- https://thedfirreport.com/2021/11/29/continuing-the-bazar-ransomware-story/
tags:
- attack.t1020
date: '2021-05-13'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  (Processes.original_file_name="rclone.exe" OR Processes.process_name="rclone.exe")
  Processes.process IN (
          "*copy*", "*mega*", "*pcloud*", "*ftp*",
          "*--config*", "*--progress*", "*--no-check-certificate*",
          "*--ignore-existing*", "*--auto-confirm*", "*--transfers*",
          "*--multi-thread-streams*"
          )
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  |  `security_content_ctime(lastTime)`
  | `detect_rclone_command_line_usage_filter`
splunk_rule_id: 32e0baea-b3f1-11eb-a2ce-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: rclone.exe
  selection_1:
    Image: rclone.exe
  selection_2:
    CommandLine|contains:
    - copy
    - mega
    - pcloud
    - ftp
    - --config
    - --progress
    - --no-check-certificate
    - --ignore-existing
    - --auto-confirm
    - --transfers
    - --multi-thread-streams
  condition: selection_0 and selection_1 and selection_2
