title: Detect Regasm with no Command Line Arguments
id: c3bc1430-04e7-4178-835f-047d8e6e97df
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances of regasm.exe running without command line arguments. This behavior typically indicates process injection, where another process manipulates regasm.exe.
  The detection leverages Endpoint Detection and Response (EDR) data, focusing on process names and command-line executions. This activity is significant as it may signal an attempt to evade detection or
  execute malicious code. If confirmed malicious, attackers could achieve code execution, potentially leading to privilege escalation, persistence, or access to sensitive information. Investigate network
  connections, parallel processes, and suspicious module loads for further context.
references:
- https://attack.mitre.org/techniques/T1218/009/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.009/T1218.009.md
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
tags:
- attack.t1218.009
date: '2021-02-16'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes where
  (Processes.process_name=regasm.exe OR Processes.original_file_name=RegAsm.exe)
  Processes.process IN ("*regasm","*regasm.exe", "*regasm.exe\"")
  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
     Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
     Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `detect_regasm_with_no_command_line_arguments_filter`
splunk_rule_id: c3bc1430-04e7-4178-835f-047d8e6e97df
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: regasm.exe
  selection_1:
    OriginalFileName: RegAsm.exe
  selection_2:
    CommandLine|endswith:
    - regasm
    - regasm.exe
    - regasm.exe\"
  condition: selection_0 and selection_1 and selection_2
