title: Detect Renamed RClone
id: 6dca1124-b3ec-11eb-9328-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of a renamed `rclone.exe` process, which is commonly used for data exfiltration to remote destinations. This detection leverages Endpoint Detection
  and Response (EDR) telemetry, focusing on process names and original file names that do not match. This activity is significant because ransomware groups often use RClone to exfiltrate sensitive data.
  If confirmed malicious, this behavior could indicate an ongoing data exfiltration attempt, potentially leading to significant data loss and further compromise of the affected systems.
references:
- https://redcanary.com/blog/rclone-mega-extortion/
- https://www.mandiant.com/resources/shining-a-light-on-darkside-ransomware-operations
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware/
tags:
- attack.T1020
date: '2021-05-13'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: rclone.exe
  selection_1:
    process_name!: rclone.exe
  condition: selection_0 and selection_1
