title: Detect Regasm with no Command Line Arguments
id: c3bc1430-04e7-4178-835f-047d8e6e97df
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances of regasm.exe running without command line arguments. This behavior typically indicates process injection, where another process manipulates regasm.exe.
  The detection leverages Endpoint Detection and Response (EDR) data, focusing on process names and command-line executions. This activity is significant as it may signal an attempt to evade detection or
  execute malicious code. If confirmed malicious, attackers could achieve code execution, potentially leading to privilege escalation, persistence, or access to sensitive information. Investigate network
  connections, parallel processes, and suspicious module loads for further context.
references:
- https://attack.mitre.org/techniques/T1218/009/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.009/T1218.009.md
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
tags:
- attack.T1218_009
date: '2021-02-16'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: regasm.exe
  selection_1:
    OriginalFileName: RegAsm.exe
  selection_2:
    CommandLine|contains:
    - '*regasm'
    - '*regasm.exe'
    - '*regasm.exe\"'
  condition: selection_0 and selection_1 and selection_2
