title: Disable Schedule Task
id: db596056-3019-11ec-a9ff-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of a command to disable an existing scheduled task using 'schtasks.exe' with the '/change' and '/disable' parameters. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. Disabling scheduled tasks is significant as it is a common tactic used by adversaries, including
  malware like IcedID, to disable security applications and evade detection. If confirmed malicious, this activity could allow attackers to persist undetected, disable critical security defenses, and further
  compromise the targeted host.
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
- attack.T1685
date: '2021-10-18'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: schtasks.exe
  selection_1:
    CommandLine|contains: '*/change*'
  selection_2:
    CommandLine|contains: '*/disable*'
  condition: selection_0 and selection_1 and selection_2
