title: Disable Logs Using WevtUtil
id: 236e7c8e-c9d9-11eb-a824-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of "wevtutil.exe" with parameters to disable event logs. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names and command-line arguments. This activity is significant because disabling event logs is a common tactic used by ransomware to evade detection and hinder forensic investigations. If confirmed malicious,
  this action could allow attackers to operate undetected, making it difficult to trace their activities and respond effectively to the incident.
references:
- https://www.bleepingcomputer.com/news/security/new-ransom-x-ransomware-used-in-texas-txdot-cyberattack/
tags:
- attack.T1685_005
date: '2021-06-10'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: wevtutil.exe
  selection_1:
    CommandLine|contains:
    - '*/e:false*'
    - '*/enabled:false*'
  condition: selection_0 and selection_1
