title: DNS Exfiltration Using Nslookup App
id: 2452e632-9e0d-11eb-bacd-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Wouter Jansen
description: The following analytic identifies potential DNS exfiltration using the nslookup application. It detects specific command-line parameters such as query type (TXT, A, AAAA) and retry options,
  which are commonly used by attackers to exfiltrate data. The detection leverages Endpoint Detection and Response (EDR) telemetry, focusing on process execution logs. This activity is significant as it
  may indicate an attempt to communicate with a Command and Control (C2) server or exfiltrate sensitive data. If confirmed malicious, this could lead to data breaches and unauthorized access to critical
  information.
references:
- https://www.mandiant.com/resources/fin7-spear-phishing-campaign-targets-personnel-involved-sec-filings
- https://www.varonis.com/blog/dns-tunneling
- https://www.microsoft.com/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
tags:
- attack.T1048
date: '2021-04-22'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: nslookup.exe
    CommandLine|contains: '*-querytype=*'
  selection_1:
    CommandLine|contains: '*-qt=*'
  selection_2:
    CommandLine|contains: '*-q=*'
  selection_3:
    CommandLine|contains: '*-type=*'
  selection_4:
    CommandLine|contains: '*-retry=*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
