title: Domain Group Discovery With Wmic
id: a87736a6-95cd-4728-8689-3c64d5026b3e
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies the execution of `wmic.exe` with command-line arguments used to query for domain groups. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line executions. This activity is significant as it indicates potential reconnaissance efforts by adversaries to gain situational awareness and map out Active Directory
  structures. If confirmed malicious, this behavior could allow attackers to identify and target specific domain groups, potentially leading to privilege escalation or lateral movement within the network.
references:
- https://attack.mitre.org/techniques/T1069/002/
tags:
- attack.t1069.002
date: '2021-08-26'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where `process_wmic` (Processes.process=*/NAMESPACE:\\\\root\\directory\\ldap*
  AND Processes.process=*ds_group* AND Processes.process="*GET ds_samaccountname*") by Processes.action Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
  Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `domain_group_discovery_with_wmic_filter`'
splunk_rule_id: a87736a6-95cd-4728-8689-3c64d5026b3e
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: /NAMESPACE:\\root\directory\ldap
  selection_1:
    CommandLine|contains: ds_group
  selection_2:
    CommandLine|contains: GET ds_samaccountname
  condition: selection_0 and selection_1 and selection_2
