title: Domain Controller Discovery with Nltest
id: 41243735-89a7-4c83-bcdd-570aa78f00a1
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `nltest.exe` with command-line arguments `/dclist:` or `/dsgetdc:` to discover domain controllers. It leverages Endpoint Detection and Response
  (EDR) data, focusing on process names and command-line arguments. This activity is significant because both Red Teams and adversaries use `nltest.exe` for situational awareness and Active Directory discovery.
  If confirmed malicious, this behavior could allow attackers to map out domain controllers, facilitating further attacks such as privilege escalation or lateral movement within the network.
references:
- https://attack.mitre.org/techniques/T1018/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)
tags:
- attack.T1018
date: '2021-09-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: nltest.exe
  selection_1:
    OriginalFileName: nltestrk.exe
  selection_2:
    CommandLine|contains: '*/dclist:*'
  selection_3:
    CommandLine|contains: '*/dsgetdc:*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
