title: Domain Controller Discovery with Wmic
id: 64c7adaa-48ee-483c-b0d6-7175bc65e6cc
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies the execution of `wmic.exe` with command-line arguments used to discover domain controllers in a Windows domain. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because it is commonly used by adversaries and Red Teams for situational awareness and Active
  Directory discovery. If confirmed malicious, this behavior could allow attackers to map out the network, identify key systems, and plan further attacks, potentially leading to unauthorized access and
  data exfiltration.
references:
- https://attack.mitre.org/techniques/T1018/
tags:
- attack.T1018
date: '2021-09-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: wmic.exe
  selection_1:
    CommandLine: ''
  selection_2:
    CommandLine|contains: '*DomainControllerAddress*'
  condition: selection_0 and selection_1 and selection_2
