title: Domain Controller Discovery with Nltest
id: 41243735-89a7-4c83-bcdd-570aa78f00a1
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `nltest.exe` with command-line arguments `/dclist:` or `/dsgetdc:` to discover domain controllers. It leverages Endpoint Detection and Response
  (EDR) data, focusing on process names and command-line arguments. This activity is significant because both Red Teams and adversaries use `nltest.exe` for situational awareness and Active Directory discovery.
  If confirmed malicious, this behavior could allow attackers to map out domain controllers, facilitating further attacks such as privilege escalation or lateral movement within the network.
references:
- https://attack.mitre.org/techniques/T1018/
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/cc731935(v=ws.11)
tags:
- attack.t1018
date: '2021-09-01'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name=nltest.exe
          OR
          Processes.original_file_name=nltestrk.exe
      )
      (Processes.process="*/dclist:*" OR Processes.process="*/dsgetdc:*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `domain_controller_discovery_with_nltest_filter`
splunk_rule_id: 41243735-89a7-4c83-bcdd-570aa78f00a1
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: nltest.exe
  selection_1:
    OriginalFileName: nltestrk.exe
  selection_2:
    CommandLine|contains: '/dclist:'
  selection_3:
    CommandLine|contains: '/dsgetdc:'
  condition: selection_0 and selection_1 and selection_2 and selection_3
