title: ESXi Download Errors
id: 515cccd0-c4d8-4427-92d9-8a8f8b5a71dc
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies failed file download attempts on ESXi hosts by looking for specific error messages in the system logs. These failures may indicate unauthorized or malicious attempts
  to install or update components—such as VIBs or scripts
tags:
- attack.T1601_001
- attack.T1685
date: '2025-07-11'
logsource:
  category: application
  product: windows
detection:
  selection_0:
    Message|contains:
    - '*Download failed*'
    - '*Failed to download file*'
    - '*File download error*'
    - '*Could not download*'
  condition: selection_0
