title: Excessive Usage Of Taskkill
id: fe5bca48-accb-11eb-a67c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies excessive usage of `taskkill.exe`, a command-line utility used to terminate processes. The detection leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on instances where `taskkill.exe` is executed ten or more times within a one-minute span. This behavior is significant as adversaries often use `taskkill.exe` to disable security tools
  or other critical processes to evade detection. If confirmed malicious, this activity could allow attackers to bypass security defenses, maintain persistence, and further compromise the system.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
- https://www.joesandbox.com/analysis/702680/0/html
tags:
- attack.t1685
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime values(Processes.action) as action values(Processes.dest) as dest values(Processes.original_file_name) as original_file_name values(Processes.parent_process) as parent_process values(Processes.parent_process_exec) as parent_process_exec values(Processes.parent_process_guid) as parent_process_guid values(Processes.parent_process_id) as parent_process_id values(Processes.parent_process_path) as parent_process_path values(Processes.process) as process values(Processes.process_exec) as process_exec values(Processes.process_guid) as process_guid values(Processes.process_hash) as process_hash values(Processes.process_id) as process_id values(Processes.process_integrity_level) as process_integrity_level values(Processes.process_path) as process_path values(Processes.user) as user  values(Processes.user_id) as user_id values(Processes.vendor_product) as vendor_product FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name = "taskkill.exe"
    BY Processes.parent_process_name Processes.process_name Processes.dest
       Processes.user _time span=1m
  | where count >=10
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `excessive_usage_of_taskkill_filter`
splunk_rule_id: fe5bca48-accb-11eb-a67c-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: taskkill.exe
  condition: selection_0
