title: Excessive number of taskhost processes
id: f443dac2-c7cf-11eb-ab51-acde48001122
status: stable
level: medium
author: Michael Hart
description: The following analytic identifies an excessive number of taskhost.exe and taskhostex.exe processes running within a short time frame. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names and their counts. This behavior is significant as it is commonly associated with post-exploitation tools like Meterpreter and Koadic, which use multiple instances
  of these processes for actions such as discovery and lateral movement. If confirmed malicious, this activity could indicate an ongoing attack, allowing attackers to execute code, escalate privileges,
  or move laterally within the network.
references:
- https://attack.mitre.org/software/S0250/
tags:
- attack.t1059
date: '2021-06-08'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.action) as action values(Processes.original_file_name) as original_file_name values(Processes.parent_process) as parent_process values(Processes.parent_process_exec) as parent_process_exec values(Processes.parent_process_guid) as parent_process_guid values(Processes.parent_process_id) as parent_process_id values(Processes.parent_process_name) as parent_process_name values(Processes.parent_process_path) as parent_process_path values(Processes.process) as process values(Processes.process_exec) as process_exec values(Processes.process_guid) as process_guid values(Processes.process_hash) as process_hash values(Processes.process_id) as process_id values(Processes.process_integrity_level) as process_integrity_level values(Processes.user) as user values(Processes.process_path) as process_path values(Processes.user_id) as user_id values(Processes.vendor_product) as vendor_product min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name = "taskhost.exe"
      OR
      Processes.process_name = "taskhostex.exe"
    BY Processes.dest Processes.process_name _time
       span=1h
  | `drop_dm_object_name(Processes)`
  | eval pid_count=mvcount(process_id)
  | eval taskhost_count_=if(process_name == "taskhost.exe", pid_count, 0)
  | eval taskhostex_count_=if(process_name == "taskhostex.exe", pid_count, 0)
  | stats sum(taskhost_count_) as taskhost_count, sum(taskhostex_count_) as taskhostex_count values(action) as action values(original_file_name) as original_file_name values(parent_process) as parent_process values(parent_process_exec) as parent_process_exec values(parent_process_guid) as parent_process_guid values(parent_process_id) as parent_process_id values(parent_process_name) as parent_process_name values(parent_process_path) as parent_process_path values(process) as process values(process_exec) as process_exec values(process_guid) as process_guid values(process_hash) as process_hash values(process_id) as process_id values(process_integrity_level) as process_integrity_level values(user) as user values(process_path) as process_path values(user_id) as user_id values(vendor_product) as vendor_product values(process_name) as process_name
    BY _time, dest, firstTime,
       lastTime
  | where taskhost_count > 10 or taskhostex_count > 10
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `excessive_number_of_taskhost_processes_filter`
splunk_rule_id: f443dac2-c7cf-11eb-ab51-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: taskhost.exe
  selection_1:
    Image: taskhostex.exe
  condition: selection_0 and selection_1
