title: Excessive File Deletion In WinDefender Folder
id: b5baa09a-7a05-11ec-8da4-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic detects excessive file deletion events in the Windows Defender folder. It leverages Sysmon EventCodes 23 and 26 to identify processes deleting multiple files within this
  directory. This behavior is significant as it may indicate an attempt to corrupt or disable Windows Defender, a key security component. If confirmed malicious, this activity could allow an attacker to
  disable endpoint protection, facilitating further malicious actions without detection.
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.T1485
date: '2022-01-21'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID|contains:
    - '23'
    - '26'
  selection_1:
    TargetFilename|contains: '*\ProgramData\Microsoft\Windows Defender\*'
  condition: selection_0 and selection_1
