title: Excessive number of taskhost processes
id: f443dac2-c7cf-11eb-ab51-acde48001122
status: stable
level: medium
author: Michael Hart
description: The following analytic identifies an excessive number of taskhost.exe and taskhostex.exe processes running within a short time frame. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names and their counts. This behavior is significant as it is commonly associated with post-exploitation tools like Meterpreter and Koadic, which use multiple instances
  of these processes for actions such as discovery and lateral movement. If confirmed malicious, this activity could indicate an ongoing attack, allowing attackers to execute code, escalate privileges,
  or move laterally within the network.
references:
- https://attack.mitre.org/software/S0250/
tags:
- attack.T1059
date: '2021-06-08'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: taskhost.exe
  selection_1:
    Image: taskhostex.exe
  condition: selection_0 and selection_1
