title: Excessive Usage Of Cacls App
id: 0bdf6092-af17-11eb-939a-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic identifies excessive usage of `cacls.exe`, `xcacls.exe`,
  or `icacls.exe` to change file or folder permissions.
  It looks for 10 or more execution of the aforementioned processes in the span of 1 minute.
  It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line executions.
  This activity is significant as it may indicate an adversary attempting
  to restrict access to malware components or artifacts on a compromised system.
  If confirmed malicious, this behavior could prevent users from deleting or accessing
  critical files, aiding in the persistence and concealment of malicious activities.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
- attack.T1222
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - icacls.exe
    - cacls.exe
    - xcacls.exe
  condition: selection_0
