title: Excessive Usage Of Taskkill
id: fe5bca48-accb-11eb-a67c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies excessive usage of `taskkill.exe`, a command-line utility used to terminate processes. The detection leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on instances where `taskkill.exe` is executed ten or more times within a one-minute span. This behavior is significant as adversaries often use `taskkill.exe` to disable security tools
  or other critical processes to evade detection. If confirmed malicious, this activity could allow attackers to bypass security defenses, maintain persistence, and further compromise the system.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
- https://www.joesandbox.com/analysis/702680/0/html
tags:
- attack.T1685
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: taskkill.exe
  condition: selection_0
