title: FodHelper UAC Bypass
id: 909f8fd8-7ac8-11eb-a1f3-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of fodhelper.exe, which is known to exploit a User Account Control (UAC) bypass by leveraging specific registry keys. The detection method uses
  Endpoint Detection and Response (EDR) telemetry to identify when fodhelper.exe spawns a child process and accesses the registry keys. This activity is significant because it indicates a potential privilege
  escalation attempt by an attacker. If confirmed malicious, the attacker could execute commands with elevated privileges, leading to unauthorized system changes and potential full system compromise.
references:
- https://blog.malwarebytes.com/malwarebytes-news/2021/02/lazyscripter-from-empire-to-double-rat/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1548.002/T1548.002.md
- https://github.com/gushmazuko/WinBypass/blob/master/FodhelperBypass.ps1
- https://attack.mitre.org/techniques/T1548/002/
tags:
- attack.T1112
- attack.T1548_002
date: '2021-03-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: fodhelper.exe
  condition: selection_0
