title: Get DomainUser with PowerShell
id: 9a5a41d6-04e7-11ec-923c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: The following analytic detects the execution of `powershell.exe` with command-line arguments used to enumerate domain users via the `Get-DomainUser` command. This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions mapped to the `Processes` node of the `Endpoint` data model. This activity is significant as it indicates
  potential reconnaissance efforts by adversaries or Red Teams using PowerView for Active Directory discovery. If confirmed malicious, this could allow attackers to gain situational awareness and identify
  valuable targets within the domain, potentially leading to further exploitation.
references:
- https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainUser/
tags:
- attack.T1087_002
date: '2021-08-25'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: cmd.exe
  selection_1:
    Image|contains: powershell*
  selection_2:
    CommandLine|contains: '*Get-DomainUser*'
  condition: selection_0 and selection_1 and selection_2
