title: Get DomainUser with PowerShell Script Block
id: 61994268-04f4-11ec-865c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: The following analytic detects the execution of the `Get-DomainUser` cmdlet using PowerShell Script Block Logging (EventCode=4104). This cmdlet is part of PowerView, a tool often used for domain
  enumeration. The detection leverages PowerShell operational logs to identify instances where this command is executed. Monitoring this activity is crucial as it may indicate an adversary's attempt to
  gather information about domain users, which is a common step in Active Directory Discovery. If confirmed malicious, this activity could lead to further reconnaissance and potential exploitation of domain
  resources.
references:
- https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainUser/
tags:
- attack.T1087_002
date: '2021-08-25'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*Get-DomainUser*'
  condition: selection_0 and selection_1
