title: Get WMIObject Group Discovery
id: 5434f670-155d-11ec-8cca-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of the `Get-WMIObject Win32_Group` command executed via PowerShell to enumerate local groups on an endpoint. This detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names and command-line executions. Identifying local groups can be a precursor to privilege escalation or lateral movement. If confirmed malicious,
  this activity could allow an attacker to map out group memberships, aiding in further exploitation or unauthorized access to sensitive resources.
references:
- https://attack.mitre.org/techniques/T1069/001/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
tags:
- attack.t1069.001
date: '2021-09-14'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name=powershell.exe
          OR
          processes.process_name=cmd.exe
      )
      (Processes.process="*Get-WMIObject*" AND Processes.process="*Win32_Group*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `get_wmiobject_group_discovery_filter`
splunk_rule_id: 5434f670-155d-11ec-8cca-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: powershell.exe
  selection_1:
    processes.process_name: cmd.exe
  selection_2:
    CommandLine|contains: Get-WMIObject
  selection_3:
    CommandLine|contains: Win32_Group
  condition: selection_0 and selection_1 and selection_2 and selection_3
