title: Get ADDefaultDomainPasswordPolicy with Powershell
id: 36e46ebe-065a-11ec-b4c7-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the execution of `powershell.exe` running the `Get-ADDefaultDomainPasswordPolicy` cmdlet, which is used to retrieve the password policy in a Windows domain.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions.
  Monitoring this activity is crucial as it can indicate attempts by adversaries to gather information about domain policies for situational awareness and Active Directory discovery.
  If confirmed malicious, this activity could lead to further reconnaissance and potential exploitation of domain security settings.
references:
- https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
- https://attack.mitre.org/techniques/T1201/
- https://docs.microsoft.com/en-us/powershell/module/activedirectory/get-addefaultdomainpasswordpolicy?view=windowsserver2019-ps
tags:
- attack.T1201
date: '2021-08-27'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*Get-ADDefaultDomainPasswordPolicy*'
  condition: selection_0
