title: Get DomainPolicy with Powershell
id: b8f9947e-065a-11ec-aafb-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: The following analytic detects the execution of `powershell.exe` running the `Get-DomainPolicy` cmdlet, which is used to retrieve password policies in a Windows domain. It leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential reconnaissance efforts by adversaries to gather
  domain policy information, which is crucial for planning further attacks. If confirmed malicious, this could lead to unauthorized access to sensitive domain configurations, aiding in privilege escalation
  and lateral movement within the network.
references:
- https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
- https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainPolicy/
- https://attack.mitre.org/techniques/T1201/
tags:
- attack.T1201
date: '2021-08-27'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: cmd.exe
  selection_1:
    Image|contains: powershell*
  selection_2:
    CommandLine|contains: '*Get-DomainPolicy*'
  condition: selection_0 and selection_1 and selection_2
