title: Get DomainUser with PowerShell
id: 9a5a41d6-04e7-11ec-923c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: The following analytic detects the execution of `powershell.exe` with command-line arguments used to enumerate domain users via the `Get-DomainUser` command. This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions mapped to the `Processes` node of the `Endpoint` data model. This activity is significant as it indicates
  potential reconnaissance efforts by adversaries or Red Teams using PowerView for Active Directory discovery. If confirmed malicious, this could allow attackers to gain situational awareness and identify
  valuable targets within the domain, potentially leading to further exploitation.
references:
- https://powersploit.readthedocs.io/en/latest/Recon/Get-DomainUser/
tags:
- attack.t1087.002
date: '2021-08-25'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name="cmd.exe"
          OR
          Processes.process_name="powershell*"
      )
      AND Processes.process = "*Get-DomainUser*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `get_domainuser_with_powershell_filter`
splunk_rule_id: 9a5a41d6-04e7-11ec-923c-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: cmd.exe
  selection_1:
    Image|startswith: powershell
  selection_2:
    CommandLine|contains: Get-DomainUser
  condition: selection_0 and selection_1 and selection_2
