title: Get ADUser with PowerShell
id: 0b6ee3f4-04e3-11ec-a87d-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: The following analytic detects the execution of `powershell.exe` with command-line arguments used to enumerate domain users via the `Get-ADUser` cmdlet. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it may indicate an attempt by adversaries to gather information about domain users for
  situational awareness and Active Directory discovery. If confirmed malicious, this behavior could lead to further reconnaissance, enabling attackers to identify high-value targets and plan subsequent
  attacks.
references:
- https://www.blackhillsinfosec.com/red-blue-purple/
- https://attack.mitre.org/techniques/T1087/002/
- https://docs.microsoft.com/en-us/powershell/module/activedirectory/get-aduser?view=windowsserver2019-ps
tags:
- attack.T1087_002
date: '2021-08-25'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: cmd.exe
  selection_1:
    Image|contains: powershell*
  selection_2:
    CommandLine|contains: '*Get-ADUser*'
  selection_3:
    CommandLine|contains: '*-filter*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
