title: Get WMIObject Group Discovery
id: 5434f670-155d-11ec-8cca-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of the `Get-WMIObject Win32_Group` command executed via PowerShell to enumerate local groups on an endpoint. This detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names and command-line executions. Identifying local groups can be a precursor to privilege escalation or lateral movement. If confirmed malicious,
  this activity could allow an attacker to map out group memberships, aiding in further exploitation or unauthorized access to sensitive resources.
references:
- https://attack.mitre.org/techniques/T1069/001/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1069.001/T1069.001.md
tags:
- attack.T1069_001
date: '2021-09-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: powershell.exe
  selection_1:
    Image: cmd.exe
  selection_2:
    CommandLine|contains: '*Get-WMIObject*'
  selection_3:
    CommandLine|contains: '*Win32_Group*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
