title: GetAdComputer with PowerShell
id: c5a31f80-5888-4d81-9f78-1cc65026316e
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `powershell.exe` with the `Get-AdComputer` commandlet, which is used to discover remote systems within a domain. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because it indicates potential reconnaissance efforts by adversaries
  to map out domain computers, which is a common step in the attack lifecycle. If confirmed malicious, this behavior could allow attackers to gain situational awareness and plan further attacks, potentially
  leading to unauthorized access and data exfiltration.
references:
- https://attack.mitre.org/techniques/T1018/
tags:
- attack.t1018
date: '2021-09-01'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name="powershell.exe"
      )
      (Processes.process=*Get-AdComputer*)
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `getadcomputer_with_powershell_filter`
splunk_rule_id: c5a31f80-5888-4d81-9f78-1cc65026316e
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: powershell.exe
  selection_1:
    CommandLine|contains: Get-AdComputer
  condition: selection_0 and selection_1
