title: GetAdComputer with PowerShell
id: c5a31f80-5888-4d81-9f78-1cc65026316e
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `powershell.exe` with the `Get-AdComputer` commandlet, which is used to discover remote systems within a domain. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because it indicates potential reconnaissance efforts by adversaries
  to map out domain computers, which is a common step in the attack lifecycle. If confirmed malicious, this behavior could allow attackers to gain situational awareness and plan further attacks, potentially
  leading to unauthorized access and data exfiltration.
references:
- https://attack.mitre.org/techniques/T1018/
tags:
- attack.T1018
date: '2021-09-01'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: powershell.exe
  selection_1:
    CommandLine|contains: '*Get-AdComputer*'
  condition: selection_0 and selection_1
