title: GetLocalUser with PowerShell
id: 85fae8fa-0427-11ec-8b78-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `powershell.exe` with the `Get-LocalUser` commandlet, which is used to query local user accounts. This detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names and command-line arguments. Monitoring this activity is significant because adversaries and Red Teams may use it to enumerate local users
  for situational awareness and Active Directory discovery. If confirmed malicious, this activity could allow attackers to identify potential targets for further exploitation or privilege escalation within
  the environment.
references:
- https://attack.mitre.org/techniques/T1087/001/
tags:
- attack.t1087.001
date: '2021-08-24'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name="powershell.exe"
      )
      (Processes.process=*Get-LocalUser*)
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `getlocaluser_with_powershell_filter`
splunk_rule_id: 85fae8fa-0427-11ec-8b78-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: powershell.exe
  selection_1:
    CommandLine|contains: Get-LocalUser
  condition: selection_0 and selection_1
