title: GetWmiObject Ds Group with PowerShell
id: df275a44-4527-443b-b884-7600e066e3eb
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: |-
  The following analytic identifies the execution of `powershell.exe` with command-line arguments used to query domain groups via the `Get-WmiObject` cmdlet and the `-class ds_group` parameter.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions.
  This activity is significant as it indicates potential reconnaissance efforts by adversaries to enumerate domain groups, which is a common step in Active Directory Discovery.
  If confirmed malicious, this could allow attackers to gain insights into the domain structure, aiding in further attacks and privilege escalation.
references:
- https://attack.mitre.org/techniques/T1069/002/
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/get-wmiobject?view=powershell-5.1
tags:
- attack.T1069_002
date: '2021-08-26'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*Get-WmiObject*'
  selection_1:
    CommandLine|contains: '*namespace *'
  selection_2:
    CommandLine|contains: '* root\directory\ldap*'
  selection_3:
    CommandLine|contains: '* ds_group*'
  selection_4:
    CommandLine|contains: '*class *'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
