title: GetWmiObject DS User with PowerShell
id: 22d3b118-04df-11ec-8fa3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: |-
  The following analytic detects the execution of `powershell.exe` with command-line arguments used to query domain users via the `Get-WmiObject` cmdlet and `-class ds_user` parameter.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions.
  This activity is significant as it indicates potential reconnaissance efforts by adversaries to enumerate domain users, which is a common step in Active Directory Discovery.
  If confirmed malicious, this could lead to further attacks, including privilege escalation and lateral movement within the network.
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/dsquery.htm
tags:
- attack.t1087.002
date: '2021-08-25'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  (
      `process_powershell`
      OR
      `process_cmd`
  )
  AND
  Processes.process = "*get-wmiobject*"
  Processes.process = "*ds_user*"
  Processes.process = "*root\\directory\\ldap*"
  Processes.process = "*-namespace*"

  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id
     Processes.process_integrity_level Processes.process_name
     Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `getwmiobject_ds_user_with_powershell_filter`
splunk_rule_id: 22d3b118-04df-11ec-8fa3-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: get-wmiobject
  selection_1:
    CommandLine|contains: ds_user
  selection_2:
    CommandLine|contains: root\directory\ldap
  selection_3:
    CommandLine|contains: -namespace
  condition: selection_0 and selection_1 and selection_2 and selection_3
