title: GetWmiObject DS User with PowerShell
id: 22d3b118-04df-11ec-8fa3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: |-
  The following analytic detects the execution of `powershell.exe` with command-line arguments used to query domain users via the `Get-WmiObject` cmdlet and `-class ds_user` parameter.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions.
  This activity is significant as it indicates potential reconnaissance efforts by adversaries to enumerate domain users, which is a common step in Active Directory Discovery.
  If confirmed malicious, this could lead to further attacks, including privilege escalation and lateral movement within the network.
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/dsquery.htm
tags:
- attack.T1087_002
date: '2021-08-25'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*get-wmiobject*'
  selection_1:
    CommandLine|contains: '*ds_user*'
  selection_2:
    CommandLine|contains: '*root\directory\ldap*'
  selection_3:
    CommandLine|contains: '*-namespace*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
