title: Headless Browser Usage
id: 869ba261-c272-47d7-affe-5c0aa85c93d6
status: stable
level: medium
author: Michael Haag, Teoderick Contreras, Splunk
description: The following analytic detects the usage of headless browsers within an organization. It identifies processes containing the "--headless" and "--disable-gpu" command line arguments, which are
  indicative of headless browsing. This detection leverages data from the Endpoint.Processes datamodel to identify such processes. Monitoring headless browser usage is significant as these tools can be
  exploited by adversaries for malicious activities like web scraping, automated testing, and undetected web interactions. If confirmed malicious, this activity could lead to unauthorized data extraction,
  automated attacks, or other covert operations on web applications.
references:
- https://www.trendmicro.com/en_us/research/26/a/analysis-of-the-evelyn-stealer-campaign.html
- https://cert.gov.ua/article/5702579
tags:
- attack.T1497
- attack.T1564_003
date: '2023-09-11'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - Chrome.exe
    - Brave.exe
    - Opera.exe
    - Vivaldi.exe
    - msedge.exe
  selection_1:
    CommandLine|contains: '*--headless*'
  selection_2:
    CommandLine|contains: '*--disable-gpu*'
  condition: selection_0 and selection_1 and selection_2
