title: Headless Browser Usage
id: 869ba261-c272-47d7-affe-5c0aa85c93d6
status: stable
level: medium
author: Michael Haag, Teoderick Contreras, Splunk
description: The following analytic detects the usage of headless browsers within an organization. It identifies processes containing the "--headless" and "--disable-gpu" command line arguments, which are
  indicative of headless browsing. This detection leverages data from the Endpoint.Processes datamodel to identify such processes. Monitoring headless browser usage is significant as these tools can be
  exploited by adversaries for malicious activities like web scraping, automated testing, and undetected web interactions. If confirmed malicious, this activity could lead to unauthorized data extraction,
  automated attacks, or other covert operations on web applications.
references:
- https://www.trendmicro.com/en_us/research/26/a/analysis-of-the-evelyn-stealer-campaign.html
- https://cert.gov.ua/article/5702579
tags:
- attack.t1497
- attack.t1564.003
date: '2023-09-11'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process_name IN ("Chrome.exe","Brave.exe", "Opera.exe", "Vivaldi.exe", "msedge.exe") (Processes.process="*--headless*" AND Processes.process="*--disable-gpu*")
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `headless_browser_usage_filter`
splunk_rule_id: 869ba261-c272-47d7-affe-5c0aa85c93d6
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image:
    - Chrome.exe
    - Brave.exe
    - Opera.exe
    - Vivaldi.exe
    - msedge.exe
  selection_1:
    CommandLine|contains: --headless
  selection_2:
    CommandLine|contains: --disable-gpu
  condition: selection_0 and selection_1 and selection_2
