title: Hiding Files And Directories With Attrib exe
id: 6e5a3ae4-90a3-462d-9aa6-0119f638c0f1
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the use of the Windows binary attrib.exe to hide files or directories by marking them with specific flags. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on command-line arguments that include the "+h" flag. This activity is significant because hiding files can be a tactic used by attackers to conceal malicious files or tools from
  users and security software. If confirmed malicious, this behavior could allow an attacker to persist in the environment undetected, potentially leading to further compromise or data exfiltration.
tags:
- attack.T1222_001
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: attrib.exe
  selection_1:
    CommandLine|contains: '*+h*'
  condition: selection_0 and selection_1
