title: High Process Termination Frequency
id: 17cd75b2-8666-11eb-9ab4-acde48001122
status: stable
level: medium
author: Teoderick Contreras
description: The following analytic identifies a high frequency of process termination events on a computer within a short period. It leverages Sysmon EventCode 5 logs to detect instances where 15 or more
  processes are terminated within a 3-second window. This behavior is significant as it is commonly associated with ransomware attempting to avoid exceptions during file encryption. If confirmed malicious,
  this activity could indicate an active ransomware attack, potentially leading to widespread file encryption and significant data loss.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
- attack.T1486
date: '2021-03-19'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 5
  condition: selection_0
