title: Icacls Deny Command
id: cf8d753e-a8fe-11eb-8f58-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects instances where an adversary modifies
  security permissions of a file or directory using commands like "icacls.exe", "cacls.exe",
  or "xcacls.exe" with deny options. It leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process names and command-line executions. This
  activity is significant as it is commonly used by Advanced Persistent Threats (APTs)
  and coinminer scripts to evade detection and impede access to critical files. If
  confirmed malicious, this could allow attackers to maintain persistence and hinder
  incident response efforts.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
- attack.t1222
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  Processes.process_name IN ( "icacls.exe", "cacls.exe", "xcacls.exe") AND
  Processes.process IN ("*/deny*", "*/d:*", "*/d ")
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `icacls_deny_command_filter`
splunk_rule_id: cf8d753e-a8fe-11eb-8f58-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image:
    - icacls.exe
    - cacls.exe
    - xcacls.exe
  selection_1:
    CommandLine:
    - '*/deny*'
    - '*/d:*'
    - '*/d '
  condition: selection_0 and selection_1
