title: Java Class File download by Java User Agent
id: 8281ce42-5c50-11ec-82d2-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies a Java user agent performing a GET request for a .class file from a remote site. It leverages web or proxy logs within the Web Datamodel to detect this activity.
  This behavior is significant as it may indicate exploitation attempts, such as those related to CVE-2021-44228 (Log4Shell). If confirmed malicious, an attacker could exploit vulnerabilities in the Java
  application, potentially leading to remote code execution and further compromise of the affected system.
references:
- https://arstechnica.com/information-technology/2021/12/as-log4shell-wreaks-havoc-payroll-service-reports-ransomware-attack/
tags:
- attack.T1190
date: '2021-12-13'
logsource:
  category: webserver
  product: windows
detection:
  selection_0:
    cs-user-agent|contains: '*Java*'
  selection_1:
    cs-method: GET
  selection_2:
    cs-uri|contains: '*.class*'
  condition: selection_0 and selection_1 and selection_2
