title: Jscript Execution Using Cscript App
id: 002f1e24-146e-11ec-a470-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of JScript using the cscript.exe process. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and command-line
  telemetry. This behavior is significant because JScript files are typically executed by wscript.exe, making cscript.exe execution unusual and potentially indicative of malicious activity, such as the
  FIN7 group's tactics. If confirmed malicious, this activity could allow attackers to execute arbitrary scripts, leading to code execution, data exfiltration, or further system compromise.
references:
- https://www.mandiant.com/resources/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation
- https://attack.mitre.org/groups/G0046/
tags:
- attack.T1059_007
date: '2021-09-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: cscript.exe
    ParentCommandLine|contains: '*//e:jscript*'
  selection_1:
    Image: cscript.exe
    CommandLine|contains: '*//e:jscript*'
  condition: selection_0 and selection_1
