title: Log4Shell JNDI Payload Injection with Outbound Connection
id: 69afee44-5c91-11ec-bf1f-497c9a704a72
status: stable
level: medium
author: Jose Hernandez
description: The following analytic detects Log4Shell JNDI payload injections via outbound connections. It identifies suspicious LDAP lookup functions in web logs, such as `${jndi:ldap://PAYLOAD_INJECTED}`,
  and correlates them with network traffic to known malicious IP addresses. This detection leverages the Web and Network_Traffic data models in Splunk. Monitoring this activity is crucial as it targets
  vulnerabilities in Java web applications using log4j, potentially leading to remote code execution. If confirmed malicious, attackers could gain unauthorized access, execute arbitrary code, and compromise
  sensitive data within the affected environment.
references:
- https://www.lunasec.io/docs/blog/log4j-zero-day/
tags:
- attack.T1190
- attack.T1133
date: '2021-12-13'
logsource:
  category: all_traffic
  product: windows
detection:
  selection_0:
    type: inner
  condition: selection_0
