title: MacOS plutil
id: c11f2b57-92c1-4cd2-b46c-064eafb833ac
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the usage of the `plutil` command to modify plist files on macOS systems. It leverages osquery to monitor process events, specifically looking for executions
  of `/usr/bin/plutil`. This activity is significant because adversaries can use `plutil` to alter plist files, potentially adding malicious binaries or command-line arguments that execute upon user logon
  or system startup. If confirmed malicious, this could allow attackers to achieve persistence, execute arbitrary code, or escalate privileges, posing a significant threat to the system's security.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
tags:
- attack.T1647
date: '2022-03-04'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    name: es_process_events
  selection_1:
    path: /usr/bin/plutil
  condition: selection_0 and selection_1
