title: MacOS Keychains Dumped
id: dcb45a09-5e6f-441e-b2f8-cbbf923e36d9
status: stable
level: medium
author: Raven Tait, Jamie Windley, Splunk
description: |-
  Detects command-line attempts to access or dump macOS Keychain data using native utilities or direct file access.
  This includes credential dumping via the `security` utility (e.g. `dump-keychain -d`), bulk certificate export using `security find-certificate`, and direct file copying of Keychain database files using utilities such as `cat`.
  Keychain files are located in `~/Library/Keychains/`, `/Library/Keychains/`, and `/Network/Library/Keychains/`.
  This technique is commonly associated with post-exploitation credential harvesting, where an attacker with local access seeks to escalate privileges or move laterally by obtaining stored credentials for applications, Wi-Fi networks, system services, and certificates.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
- https://gist.github.com/hfeeki/88c12f01d00534e09a84
- https://ss64.com/mac/security-keychain-settings.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1555.001/T1555.001.md
tags:
- attack.T1555_001
date: '2026-04-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: /usr/bin/security
  selection_1:
    CommandLine|contains: '*keychaindump*'
  selection_2:
    Image:
    - cat
    - cp
    - dd
    - mv
    CommandLine|contains: '*Library/Keychains/*'
  condition: selection_0 and selection_1 and selection_2
