title: MacOS AMOS Stealer - Virtual Machine Check Activity
id: 4e41ad21-9761-426d-8aa1-083712ff9f30
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk, Alex Karkins
description: |
  The following analytic detects AMOS Stealer VM check activity on macOS. It leverages osquery to monitor process events and identifies the execution of the "osascript" command along with specific commandline strings.
  This activity is significant as AMOS stealer was seen using this pattern in order to check if the host is a Virtual Machine or not.
  If confirmed malicious, this behavior indicate that the host is already infected by the AMOS stealer, which could allow attackers to execute arbitrary code, escalate privileges, steal information, or persist within the environment, posing a significant security risk.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
- https://www.virustotal.com/gui/search/behaviour_processes%253A%2522osascript%2520-e%2520set%2522%2520AND%2520behaviour_processes%253A%2522system_profiler%2522%2520AND%2520(behaviour_processes%253A%2522VMware%2522%2520OR%2520behaviour_processes%253A%2522QEMU%2522)?type=files
tags:
- attack.T1059_002
date: '2025-04-25'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    name: es_process_events
  selection_1:
    cmdline|contains: '*osascript*'
  selection_2:
    cmdline|contains: '* -e *'
  selection_3:
    cmdline|contains: '*set*'
  selection_4:
    cmdline|contains: '*system_profiler*'
  selection_5:
    cmdline|contains:
    - '*VMware*'
    - '*QEMU*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5
