title: MacOS Account Created
id: 491004ae-694f-453e-b1e0-fc1e65daeea1
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  The following analytic detects the creation of a new local user account on a MacOS system. It leverages osquery logs to identify this activity.
  Monitoring the creation of local accounts is crucial for a SOC as it can indicate unauthorized access or lateral movement within the network.
  If confirmed malicious, this activity could allow an attacker to establish persistence, escalate privileges, or gain unauthorized access to sensitive systems and data.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
- https://ss64.com/mac/sysadminctl.html
- https://ss64.com/mac/dseditgroup.html
- https://ss64.com/mac/dscl.html
tags:
- attack.T1136
date: '2026-04-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*sysadminctl'
  selection_1:
    CommandLine|contains: '*createhomedir*'
  selection_2:
    CommandLine|contains: '*dseditgroup*'
    CommandLine:
    - '*edit*'
    - '*-a*'
  selection_3:
    CommandLine|contains: '*dscl*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
