title: MacOS Hidden Files and Directories
id: 51c43b7b-e406-45d2-9bad-5c67f07e6528
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  The following analytic detects suspicious creation of hidden files and directories, which may indicate an attacker's attempt to conceal malicious activities or unauthorized data.
  Hidden files and directories are often used to evade detection by security tools and administrators, providing a stealthy means for storing malware, logs, or sensitive information.
  By monitoring for unusual or unauthorized creation of hidden files and directories, this analytic helps identify potential attempts to hide or unauthorized creation of hidden files and directories, and helps identify potential attempts to hide malicious operations, enabling security teams to uncover and address hidden threats effectively.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
- https://ss64.com/mac/chflags.html
- https://ss64.com/mac/xattr.html
tags:
- attack.T1564_001
date: '2026-04-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*chflags *'
  selection_1:
    CommandLine|contains: '*xattr *'
  condition: selection_0 and selection_1
