title: MacOS LoginHook Persistence
id: a04832e7-9d1d-49b1-a684-e31bcd775c77
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Identifies attempts to configure a macOS LoginHook via the defaults utility. LoginHooks enable automatic execution of a script or program upon user login and have historically been abused for persistence.
  Creation or modification of this setting may indicate an attempt to establish startup execution outside standard LaunchAgent mechanisms.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
- https://www.loobins.io/binaries/defaults/
tags:
- attack.T1037_002
date: '2026-04-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*defaults *'
  selection_1:
    CommandLine|contains: '*write*'
  selection_2:
    CommandLine|contains: '*loginwindow*'
  selection_3:
    CommandLine|contains: '*loginhook*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
