title: MacOS Gatekeeper Bypass
id: 2c9346f3-bbeb-48ce-8411-fc13d09d83a5
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects known MacOS security bypass techniques that may be used to enable malicious code execution.
  Specifically monitors for attempts to remove the com.apple.quarantine attribute using xattr, or to disable Gatekeeper protections via spctl --master-disable, both of which can allow untrusted or malicious applications to execute without standard system safeguards.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
- https://ss64.com/mac/xattr.html
- https://ss64.com/mac/spctl.html
tags:
- attack.T1553_001
date: '2026-04-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*xattr*'
  selection_1:
    CommandLine|contains: '*spctl*'
  condition: selection_0 and selection_1
