title: MacOS Kextload Usage
id: 9d680775-84a6-4625-a8ea-8182b9427ce4
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects execution of the kextload command on macOS systems. The kextload utility is used to manually load kernel extensions (KEXTs) into the macOS kernel, which can introduce privileged code at the kernel level.
  While legitimate for driver installation and system administration, misuse may indicate attempts to install unauthorized, malicious, or persistence-enabling kernel extensions.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
- https://www.unix.com/man_page/osx/8/kextload/
tags:
- attack.t1543
date: '2026-04-14'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.process_name = "kextload"

  AND NOT

  Processes.process IN (
      "*-help*",
      "* -h *"
  )

  by Processes.dest Processes.original_file_name Processes.parent_process_id
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id
     Processes.process_current_directory Processes.process_name
     Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `macos_kextload_usage_filter`
splunk_rule_id: 9d680775-84a6-4625-a8ea-8182b9427ce4
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: kextload
  filter_1:
    CommandLine:
    - '*-help*'
    - '* -h *'
  condition: (selection_0) and not (filter_1)
