title: MacOS Kextload Usage
id: 9d680775-84a6-4625-a8ea-8182b9427ce4
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects execution of the kextload command on macOS systems. The kextload utility is used to manually load kernel extensions (KEXTs) into the macOS kernel, which can introduce privileged code at the kernel level.
  While legitimate for driver installation and system administration, misuse may indicate attempts to install unauthorized, malicious, or persistence-enabling kernel extensions.
references:
- https://osquery.readthedocs.io/en/stable/deployment/process-auditing/
- https://www.unix.com/man_page/osx/8/kextload/
tags:
- attack.T1543
date: '2026-04-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: kextload
  filter_1:
    CommandLine:
    - '*-help*'
    - '* -h *'
  condition: (selection_0) and not (filter_1)
