title: Microsoft SharePoint Server Elevation of Privilege
id: fcf4bd3f-a79f-4b7a-83bf-2692d60b859d
status: stable
level: medium
author: Michael Haag, Gowthamaraj Rajendran, Splunk
description: |-
  The following analytic detects potential exploitation attempts against Microsoft SharePoint Server vulnerability CVE-2023-29357.
  It leverages the Web datamodel to monitor for specific API calls and HTTP methods indicative of privilege escalation attempts.
  This activity is significant as it may indicate an attacker is trying to gain unauthorized privileged access to the SharePoint environment.
  If confirmed malicious, the impact could include unauthorized access to sensitive data, potential data theft, and further compromise of the SharePoint server, leading to a broader security breach.
references:
- https://socradar.io/microsoft-sharepoint-server-elevation-of-privilege-vulnerability-exploit-cve-2023-29357/
- https://github.com/LuemmelSec/CVE-2023-29357/blob/main/CVE-2023-29357/Program.cs
tags:
- attack.T1068
date: '2023-10-13'
logsource:
  category: webserver
  product: windows
detection:
  selection_0:
    cs-uri|contains:
    - '*/_api/web/siteusers*'
    - '*/_api/web/currentuser*'
  selection_1:
    sc-status: 200
  selection_2:
    cs-method: GET
  condition: selection_0 and selection_1 and selection_2
