title: Mmc LOLBAS Execution Process Spawn
id: f6601940-4c74-11ec-b9b7-3e22fbd008af
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies `mmc.exe` spawning a LOLBAS execution process. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where
  `mmc.exe` is the parent process. This activity is significant because adversaries can abuse the DCOM protocol and MMC20 COM object to execute malicious code, using Windows native binaries documented by
  the LOLBAS project. If confirmed malicious, this behavior could indicate lateral movement, allowing attackers to execute code remotely, potentially leading to further compromise and persistence within
  the environment.
references:
- https://attack.mitre.org/techniques/T1021/003/
- https://www.cybereason.com/blog/dcom-lateral-movement-techniques
- https://lolbas-project.github.io/
tags:
- attack.t1021.003
- attack.t1218.014
date: '2021-11-23'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes
  where (Processes.parent_process_name=mmc.exe) (Processes.process_name IN ("Regsvcs.exe", "Ftp.exe", "OfflineScannerShell.exe",
  "Rasautou.exe", "Schtasks.exe", "Xwizard.exe", "Dllhost.exe", "Pnputil.exe", "Atbroker.exe",
  "Pcwrun.exe", "Ttdinject.exe","Mshta.exe", "Bitsadmin.exe", "Certoc.exe", "Ieexec.exe",
  "Microsoft.Workflow.Compiler.exe", "Runscripthelper.exe", "Forfiles.exe", "Msbuild.exe",
  "Register-cimprovider.exe", "Tttracer.exe", "Ie4uinit.exe", "Bash.exe", "Hh.exe",
  "SettingSyncHost.exe", "Cmstp.exe", "Mmc.exe", "Stordiag.exe", "Scriptrunner.exe",
  "Odbcconf.exe", "Extexport.exe", "Msdt.exe", "WorkFolders.exe", "Diskshadow.exe",
  "Mavinject.exe", "Regasm.exe", "Gpscript.exe", "Rundll32.exe", "Regsvr32.exe", "Msiexec.exe",
  "Wuauclt.exe", "Presentationhost.exe", "Wmic.exe", "Runonce.exe", "Syncappvpublishingserver.exe",
  "Verclsid.exe", "Infdefaultinstall.exe", "Explorer.exe", "Installutil.exe", "Netsh.exe",
  "Wab.exe", "Dnscmd.exe", "At.exe", "Pcalua.exe", "Msconfig.exe"))

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
  Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
  Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `mmc_lolbas_execution_process_spawn_filter`
splunk_rule_id: f6601940-4c74-11ec-b9b7-3e22fbd008af
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: mmc.exe
  selection_1:
    Image:
    - Regsvcs.exe
    - Ftp.exe
    - OfflineScannerShell.exe
    - Rasautou.exe
    - Schtasks.exe
    - Xwizard.exe
    - Dllhost.exe
    - Pnputil.exe
    - Atbroker.exe
    - Pcwrun.exe
    - Ttdinject.exe
    - Mshta.exe
    - Bitsadmin.exe
    - Certoc.exe
    - Ieexec.exe
    - Microsoft.Workflow.Compiler.exe
    - Runscripthelper.exe
    - Forfiles.exe
    - Msbuild.exe
    - Register-cimprovider.exe
    - Tttracer.exe
    - Ie4uinit.exe
    - Bash.exe
    - Hh.exe
    - SettingSyncHost.exe
    - Cmstp.exe
    - Mmc.exe
    - Stordiag.exe
    - Scriptrunner.exe
    - Odbcconf.exe
    - Extexport.exe
    - Msdt.exe
    - WorkFolders.exe
    - Diskshadow.exe
    - Mavinject.exe
    - Regasm.exe
    - Gpscript.exe
    - Rundll32.exe
    - Regsvr32.exe
    - Msiexec.exe
    - Wuauclt.exe
    - Presentationhost.exe
    - Wmic.exe
    - Runonce.exe
    - Syncappvpublishingserver.exe
    - Verclsid.exe
    - Infdefaultinstall.exe
    - Explorer.exe
    - Installutil.exe
    - Netsh.exe
    - Wab.exe
    - Dnscmd.exe
    - At.exe
    - Pcalua.exe
    - Msconfig.exe
  condition: selection_0 and selection_1
