title: Modification Of Wallpaper
id: accb0712-c381-11eb-8e5b-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the modification of registry keys related to the desktop wallpaper settings. It leverages Sysmon EventCode 13 to identify changes to the "Control Panel\\Desktop\\Wallpaper"
  and "Control Panel\\Desktop\\WallpaperStyle" registry keys, especially when the modifying process is not explorer.exe or involves suspicious file paths like temp or public directories. This activity is
  significant as it can indicate ransomware behavior, such as the REVIL ransomware, which changes the wallpaper to display a ransom note. If confirmed malicious, this could signify a compromised machine
  and the presence of ransomware, leading to potential data encryption and extortion.
references:
- https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-what-the-code-tells-us/
- https://news.sophos.com/en-us/2020/04/24/lockbit-ransomware-borrows-tricks-to-keep-up-with-revil-and-maze/
tags:
- attack.T1491
date: '2021-06-04'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 13
    TargetObject:
    - '*\Control Panel\Desktop\Wallpaper'
    - '*\Control Panel\Desktop\WallpaperStyle'
    Image|contains: '*\explorer.exe'
  selection_1:
    TargetObject:
    - '*\Control Panel\Desktop\Wallpaper'
    - '*\Control Panel\Desktop\WallpaperStyle'
    Details:
    - '*\temp\*'
    - '*\users\public\*'
  condition: selection_0 and selection_1
