title: MS Scripting Process Loading Ldap Module
id: 0b0c40dc-14a6-11ec-b267-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of MS scripting processes (wscript.exe or cscript.exe) loading LDAP-related modules (Wldap32.dll, adsldp.dll, adsldpc.dll). It leverages Sysmon
  EventCode 7 to identify these specific DLL loads. This activity is significant as it may indicate an attempt to query LDAP for host information, a behavior observed in FIN7 implants. If confirmed malicious,
  this could allow attackers to gather detailed Active Directory information, potentially leading to further exploitation or data exfiltration.
references:
- https://www.mandiant.com/resources/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation
- https://attack.mitre.org/groups/G0046/
tags:
- attack.T1059_007
date: '2021-09-17'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image|contains:
    - '*\wscript.exe'
    - '*\cscript.exe'
  selection_2:
    ImageLoaded|contains:
    - '*\Wldap32.dll'
    - '*\adsldp.dll'
    - '*\adsldpc.dll'
  condition: selection_0 and selection_1 and selection_2
