title: MS Scripting Process Loading WMI Module
id: 2eba3d36-14a6-11ec-a682-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the loading of WMI modules by Microsoft scripting processes like wscript.exe or cscript.exe. It leverages Sysmon EventCode 7 to identify instances where these
  scripting engines load specific WMI-related DLLs. This activity is significant because it can indicate the presence of malware, such as the FIN7 implant, which uses JavaScript to execute WMI queries for
  gathering host information to send to a C2 server. If confirmed malicious, this behavior could allow attackers to collect sensitive system information and maintain persistence within the environment.
references:
- https://www.mandiant.com/resources/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation
- https://attack.mitre.org/groups/G0046/
tags:
- attack.T1059_007
date: '2021-09-17'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image|contains:
    - '*\wscript.exe'
    - '*\cscript.exe'
  selection_2:
    ImageLoaded|contains:
    - '*\fastprox.dll'
    - '*\wbemdisp.dll'
    - '*\wbemprox.dll'
    - '*\wbemsvc.dll'
    - '*\wmiutils.dll'
    - '*\wbemcomn.dll'
  condition: selection_0 and selection_1 and selection_2
