title: MSBuild Suspicious Spawned By Script Process
id: 213b3148-24ea-11ec-93a2-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the suspicious spawning of MSBuild.exe by Windows Script Host processes (cscript.exe or wscript.exe). This behavior is often associated with malware or adversaries
  executing malicious MSBuild processes via scripts on compromised hosts. The detection leverages Endpoint Detection and Response (EDR) telemetry, focusing on process creation events where MSBuild is a
  child of script hosts. This activity is significant as it may indicate an attempt to execute malicious code. If confirmed malicious, it could lead to unauthorized code execution, potentially compromising
  the host and allowing further malicious activities.
references:
- https://app.any.run/tasks/dc93ee63-050c-4ff8-b07e-8277af9ab939/
tags:
- attack.T1127_001
date: '2021-10-04'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - wscript.exe
    - cscript.exe
  condition: selection_0
