title: Mshta spawning Rundll32 OR Regsvr32 Process
id: 4aa5d062-e893-11eb-9eb2-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a suspicious mshta.exe process spawning rundll32 or regsvr32 child processes. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process GUID, process name, and parent process fields. This activity is significant as it is a known technique used by malware like Trickbot to load malicious DLLs and execute payloads. If confirmed malicious,
  this behavior could allow attackers to execute arbitrary code, escalate privileges, or download additional malware, posing a severe threat to the environment.
references:
- https://twitter.com/cyb3rops/status/1416050325870587910?s=21
tags:
- attack.T1218_005
date: '2021-07-19'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: mshta.exe
  condition: selection_0
