title: MSI Module Loaded by Non-System Binary
id: ccb98a66-5851-11ec-b91c-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the loading of `msi.dll` by a binary not located in `system32`, `syswow64`, `winsxs`, or `windows` directories. This is identified using Sysmon EventCode 7, which
  logs DLL loads, and filters out legitimate system paths. This activity is significant as it may indicate exploitation of CVE-2021-41379 or DLL side-loading attacks, both of which can lead to unauthorized
  system modifications. If confirmed malicious, this could allow an attacker to execute arbitrary code, escalate privileges, or persist within the environment.
references:
- https://attackerkb.com/topics/7LstI2clmF/cve-2021-41379/rapid7-analysis
- https://github.com/AlexandrVIvanov/InstallerFileTakeOver
- https://github.com/mandiant/red_team_tool_countermeasures/blob/master/rules/PGF/supplemental/hxioc/msi.dll%20Hijack%20(Methodology).ioc
tags:
- attack.T1574_001
date: '2021-12-08'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains: '*\msi.dll'
  filter_2:
    Image:
    - '*\System32\*'
    - '*\syswow64\*'
    - '*\windows\*'
    - '*\winsxs\*'
  condition: (selection_0 and selection_1) and not (filter_2)
