title: Network Discovery Using Route Windows App
id: dd83407e-439f-11ec-ab8e-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the `route.exe` Windows application, commonly used for network discovery. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process creation events. This activity is significant because adversaries often use `route.exe` to map network routes and identify potential targets within a network. If confirmed malicious,
  this behavior could allow attackers to gain insights into network topology, facilitating lateral movement and further exploitation. Note that false positives may occur due to legitimate administrative
  tasks or automated scripts.
references:
- https://app.any.run/tasks/ad4c3cda-41f2-4401-8dba-56cc2d245488/
tags:
- attack.t1016.001
date: '2021-11-17'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  (Processes.process_name=route.exe OR Processes.original_file_name=route.exe)
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
     Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `network_discovery_using_route_windows_app_filter`
splunk_rule_id: dd83407e-439f-11ec-ab8e-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: route.exe
  selection_1:
    OriginalFileName: route.exe
  condition: selection_0 and selection_1
