title: Network Discovery Using Route Windows App
id: dd83407e-439f-11ec-ab8e-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the `route.exe` Windows application, commonly used for network discovery. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process creation events. This activity is significant because adversaries often use `route.exe` to map network routes and identify potential targets within a network. If confirmed malicious,
  this behavior could allow attackers to gain insights into network topology, facilitating lateral movement and further exploitation. Note that false positives may occur due to legitimate administrative
  tasks or automated scripts.
references:
- https://app.any.run/tasks/ad4c3cda-41f2-4401-8dba-56cc2d245488/
tags:
- attack.T1016_001
date: '2021-11-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: route.exe
  selection_1:
    OriginalFileName: route.exe
  condition: selection_0 and selection_1
