title: Network Connection Discovery With Arp
id: ae008c0f-83bd-4ed4-9350-98d4328e15d2
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `arp.exe` with the `-a` flag, which is used to list network connections on a compromised system. This detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, command-line executions, and related telemetry. Monitoring this activity is significant because both Red Teams and adversaries use `arp.exe`
  for situational awareness and Active Directory discovery. If confirmed malicious, this activity could allow attackers to map the network, identify active devices, and plan further lateral movement or
  attacks.
references:
- https://attack.mitre.org/techniques/T1049/
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
- https://thedfirreport.com/2023/05/22/icedid-macro-ends-in-nokoyawa-ransomware/
tags:
- attack.t1049
date: '2021-08-24'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  FROM datamodel=Endpoint.Processes WHERE

  (
      Processes.process_name="arp.exe"
      OR
      Processes.process_original_file_name="arp.exe"
  )
  Processes.process IN (
      "* -a*",
      "* -g *",
      "* /a *",
      "* /g *"
  )
  BY Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `network_connection_discovery_with_arp_filter`
splunk_rule_id: ae008c0f-83bd-4ed4-9350-98d4328e15d2
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: arp.exe
  selection_1:
    Processes.process_original_file_name: arp.exe
  selection_2:
    CommandLine|contains:
    - ' -a'
    - ' -g '
    - ' /a '
    - ' /g '
  condition: selection_0 and selection_1 and selection_2
