title: Ntdsutil Export NTDS
id: da63bc76-61ae-11eb-ae93-0242ac130002
status: stable
level: medium
author: Michael Haag, Patrick Bareiss, Splunk
description: The following analytic detects the use of Ntdsutil to export the Active Directory database (NTDS.dit). It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names and command-line arguments. This activity is significant because exporting NTDS.dit can be a precursor to offline password cracking, posing a severe security risk. If confirmed malicious, an attacker
  could gain access to sensitive credentials, potentially leading to unauthorized access and privilege escalation within the network.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.003/T1003.003.md#atomic-test-3---dump-active-directory-database-with-ntdsutil
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-R2-and-2012/cc753343(v=ws.11)
- https://2017.zeronights.org/wp-content/uploads/materials/ZN17_Kheirkhabarov_Hunting_for_Credentials_Dumping_in_Windows_Environment.pdf
- https://strontic.github.io/xcyclopedia/library/vss_ps.dll-97B15BDAE9777F454C9A6BA25E938DB3.html
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
- attack.T1003_003
date: '2021-01-28'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: ntdsutil.exe
  selection_1:
    CommandLine|contains: '*ntds*'
  selection_2:
    CommandLine|contains: '*create*'
  condition: selection_0 and selection_1 and selection_2
