title: PaperCut NG Suspicious Behavior Debug Log
id: 395163b8-689b-444b-86c7-9fe9ad624734
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies potential exploitation attempts on a PaperCut NG server by analyzing its debug log data. It detects unauthorized or suspicious access attempts from public
  IP addresses and searches for specific URIs associated with known exploits. The detection leverages regex to parse unstructured log data, focusing on admin login activities. This activity is significant
  as it can indicate an active exploitation attempt on the server. If confirmed malicious, attackers could gain unauthorized access, potentially leading to data breaches or further compromise of the server.
references:
- https://www.papercut.com/kb/Main/HowToCollectApplicationServerDebugLogs
- https://github.com/inodee/threathunting-spl/blob/master/hunt-queries/HAFNIUM.md
- https://www.cisa.gov/news-events/alerts/2023/05/11/cisa-and-fbi-release-joint-advisory-response-active-exploitation-papercut-vulnerability
- https://www.papercut.com/kb/Main/PO-1216-and-PO-1219
- https://www.horizon3.ai/papercut-cve-2023-27350-deep-dive-and-indicators-of-compromise/
- https://www.bleepingcomputer.com/news/security/hackers-actively-exploit-critical-rce-bug-in-papercut-servers/
- https://www.huntress.com/blog/critical-vulnerabilities-in-papercut-print-management-software
tags:
- attack.T1190
- attack.T1133
date: '2023-05-15'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    loginType: Admin
  selection_1:
    userIdentity.userName: admin
  condition: selection_0 and selection_1
