title: Possible Browser Pass View Parameter
id: 8ba484e8-4b97-11ec-b19a-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies processes with command-line parameters associated with web browser credential dumping tools, specifically targeting behaviors used by Remcos RAT malware. It
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions and specific file paths. This activity is significant as it indicates potential credential theft,
  a common tactic in broader cyber-espionage campaigns. If confirmed malicious, attackers could gain unauthorized access to sensitive web credentials, leading to further system compromise and data breaches.
references:
- https://www.nirsoft.net/utils/web_browser_password.html
- https://app.any.run/tasks/df0baf9f-8baf-4c32-a452-16562ecb19be/
tags:
- attack.t1555.003
date: '2021-11-22'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process  IN ("*/stext *", "*/shtml *", "*/LoadPasswordsIE*",
  "*/LoadPasswordsFirefox*", "*/LoadPasswordsChrome*", "*/LoadPasswordsOpera*", "*/LoadPasswordsSafari*" , "*/UseOperaPasswordFile*", "*/OperaPasswordFile*","*/stab*", "*/scomma*", "*/stabular*", "*/shtml*",
  "*/sverhtml*", "*/sxml*", "*/skeepass*" ) AND Processes.process IN ("*\\temp\\*", "*\\users\\public\\*", "*\\programdata\\*") by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
  Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `possible_browser_pass_view_parameter_filter`'
splunk_rule_id: 8ba484e8-4b97-11ec-b19a-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '/stext '
    - '/shtml '
    - /LoadPasswordsIE
    - /LoadPasswordsFirefox
    - /LoadPasswordsChrome
    - /LoadPasswordsOpera
    - /LoadPasswordsSafari
    - /UseOperaPasswordFile
    - /OperaPasswordFile
    - /stab
    - /scomma
    - /stabular
    - /shtml
    - /sverhtml
    - /sxml
    - /skeepass
  selection_1:
    CommandLine|contains:
    - \temp\
    - \users\public\
    - \programdata\
  condition: selection_0 and selection_1
