title: Powershell Disable Security Monitoring
id: c148a894-dd93-11eb-bf2a-acde48001122
status: stable
level: medium
author: Michael Haag, Nasreddine Bencherchali, Splunk
description: |
  The following analytic identifies attempts to disable Windows Defender
  real-time behavior monitoring via PowerShell commands. It detects the use of specific
  `Set-MpPreference` parameters that disable various security features. This activity
  is significant as it is commonly used by malware such as RATs, bots, or Trojans
  to evade detection by disabling antivirus protections. If confirmed malicious, this
  action could allow an attacker to operate undetected, leading to potential data
  exfiltration, further system compromise, or persistent access within the environment.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md#atomic-test-15---tamper-with-windows-defender-atp-powershell
- https://docs.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2022-ps
tags:
- attack.t1685
date: '2021-07-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
  from datamodel=Endpoint.Processes where
  `process_powershell`
  Processes.process="*Set-MpPreference*"
  (
    Processes.process IN (
      "*DisableArchiveScanning*",
      "*DisableBehaviorMonitoring*",
      "*DisableBlockAtFirstSeen*",
      "*DisableCatchupFullScan*",
      "*DisableCatchupQuickScan*",
      "*DisableIOAVProtection*",
      "*DisableRealtimeMonitoring*",
      "*DisableRemovableDriveScanning*",
      "*DisableRestorePoint*",
      "*DisableScanningMappedNetworkDrivesForFullScan*",
      "*DisableScanningNetworkFiles*",
      "*DisableScriptScanning*",
      "*drdsc*",
      "*dsnf *",
      "*drtm *",
      "*dioavp *",
      "*dscrptsc *",
      "*dbaf *",
      "*darchsc *",
      "*dcfsc *",
      "*dbm *"
    )
    Processes.process IN (
      "* $true*",
      "* 1*"
    )
  )
  OR
  (
    Processes.process = "*PUAProtection*"
    Processes.process = "*disable*"
  )
  OR
  (
    Processes.process = "*CloudBlockLevel*"
    Processes.process IN (
      "* $false*",
      "* 0*"
    )
  )
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
     Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `powershell_disable_security_monitoring_filter`
splunk_rule_id: c148a894-dd93-11eb-bf2a-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*Set-MpPreference*'
    CommandLine:
    - '*DisableArchiveScanning*'
    - '*DisableBehaviorMonitoring*'
    - '*DisableBlockAtFirstSeen*'
    - '*DisableCatchupFullScan*'
    - '*DisableCatchupQuickScan*'
    - '*DisableIOAVProtection*'
    - '*DisableRealtimeMonitoring*'
    - '*DisableRemovableDriveScanning*'
    - '*DisableRestorePoint*'
    - '*DisableScanningMappedNetworkDrivesForFullScan*'
    - '*DisableScanningNetworkFiles*'
    - '*DisableScriptScanning*'
    - '*drdsc*'
    - '*dsnf *'
    - '*drtm *'
    - '*dioavp *'
    - '*dscrptsc *'
    - '*dbaf *'
    - '*darchsc *'
    - '*dcfsc *'
    - '*dbm *'
    - '* $true*'
    - '* 1*'
  selection_1:
    CommandLine|contains: '*PUAProtection*'
  selection_2:
    CommandLine|contains: '*CloudBlockLevel*'
    CommandLine:
    - '* $false*'
    - '* 0*'
  condition: selection_0 and selection_1 and selection_2
