title: PowerShell Start-BitsTransfer
id: 39e2605a-90d8-11eb-899e-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of the PowerShell command `Start-BitsTransfer`, which can be used for file transfers, including potential data exfiltration. It leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process creation events and command-line arguments. This activity is significant because `Start-BitsTransfer` can be abused by adversaries to
  upload sensitive files to remote locations, posing a risk of data loss. If confirmed malicious, this could lead to unauthorized data exfiltration, compromising sensitive information and potentially leading
  to further exploitation of the network.
references:
- https://isc.sans.edu/diary/Investigating+Microsoft+BITS+Activity/23281
- https://docs.microsoft.com/en-us/windows/win32/bits/using-windows-powershell-to-create-bits-transfer-jobs
tags:
- attack.T1197
date: '2021-03-30'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*start-bitstransfer*'
  condition: selection_0
