title: PowerShell Invoke CIMMethod CIMSession
id: 651ee958-a433-471c-b264-39725b788b83
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of a New-CIMSession cmdlet followed by the use of the Invoke-CIMMethod cmdlet within PowerShell. It leverages PowerShell Script Block Logging to
  identify these specific cmdlets in the ScriptBlockText field. This activity is significant because it mirrors the behavior of the Invoke-WMIMethod cmdlet, often used for remote code execution via NTLMv2
  pass-the-hash authentication. If confirmed malicious, this could allow an attacker to execute commands remotely, potentially leading to unauthorized access and control over targeted systems.
references:
- https://learn.microsoft.com/en-us/powershell/module/cimcmdlets/invoke-cimmethod?view=powershell-7.3
tags:
- attack.T1047
date: '2023-03-22'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains:
    - '*invoke-CIMMethod*'
    - '*New-CimSession*'
  condition: selection_0 and selection_1
