title: Powershell Windows Defender Exclusion Commands
id: 907ac95c-4dd9-11ec-ba2c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the use of PowerShell commands to add or set Windows Defender exclusions.
  It leverages EventCode 4104 to identify suspicious `Add-MpPreference` or `Set-MpPreference` commands with exclusion parameters.
  This activity is significant because adversaries often use it to bypass Windows Defender, allowing malicious code to execute without detection.
  If confirmed malicious, this behavior could enable attackers to evade antivirus defenses, maintain persistence, and execute further malicious activities undetected.
references:
- https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
- https://app.any.run/tasks/cf1245de-06a7-4366-8209-8e3006f2bfe5/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.T1685
date: '2021-11-25'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains:
    - '*Add-MpPreference *'
    - '*Set-MpPreference *'
  selection_2:
    ScriptBlockText|contains: '*-exclusion*'
  condition: selection_0 and selection_1 and selection_2
