title: Processes Tapping Keyboard Events
id: 2a371608-331d-4034-ae2c-21dda8f1d0ec
status: experimental
level: medium
author: Jose Hernandez, Splunk
description: The following analytic detects processes on macOS systems that are tapping keyboard events, potentially monitoring all keystrokes made by a user. It leverages data from osquery results within
  the Alerts data model, focusing on specific process names and command lines. This activity is significant as it is a common technique used by Remote Access Trojans (RATs) to log keystrokes, posing a serious
  security risk. If confirmed malicious, this could lead to unauthorized access to sensitive information, including passwords and personal data, compromising the integrity and confidentiality of the system.
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    app: osquery:results
  selection_1:
    name: pack_osx-attacks_Keyboard_Event_Taps
  condition: selection_0 and selection_1
