title: Process Kill Base On File Path
id: 5ffaa42c-acdb-11eb-9ad3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of `wmic.exe` with the `delete` command to remove an executable path. This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names, parent processes, and command-line executions. This activity is significant because it often indicates the initial stages of an adversary setting up malicious activities, such
  as cryptocurrency mining, on an endpoint. If confirmed malicious, this behavior could allow an attacker to disable security tools or other critical processes, facilitating further compromise and persistence
  within the environment.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
- attack.t1685
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as process values(Processes.process_id) as process_id count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE `process_wmic`
      AND
      Processes.process="*process*"
      AND
      Processes.process="*executablepath*"
      AND
      Processes.process="*delete*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `process_kill_base_on_file_path_filter`
splunk_rule_id: 5ffaa42c-acdb-11eb-9ad3-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: process
  selection_1:
    CommandLine|contains: executablepath
  selection_2:
    CommandLine|contains: delete
  condition: selection_0 and selection_1 and selection_2
