title: Process Execution via WMI
id: 24869767-8579-485d-9a4f-d9ddfd8f0cac
status: stable
level: medium
author: Rico Valdez, Michael Haag, Splunk
description: The following analytic detects the execution of a process by `WmiPrvSE.exe`, indicating potential use of WMI (Windows Management Instrumentation) for process creation. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships. This activity is significant as WMI can be used for lateral movement, remote code execution,
  or persistence by attackers. If confirmed malicious, this could allow an attacker to execute arbitrary commands or scripts, potentially leading to further compromise of the affected system or network.
tags:
- attack.T1047
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: WmiPrvSE.exe
  filter_1:
    CommandLine: '*\dismhost.exe*'
  condition: (selection_0) and not (filter_1)
