title: Process Deleting Its Process File Path
id: f7eda4bc-871c-11eb-b110-acde48001122
status: stable
level: medium
author: Teoderick Contreras
description: The following analytic identifies a process attempting to delete its own file path, a behavior often associated with defense evasion techniques. This detection leverages Sysmon EventCode 1
  logs, focusing on command lines executed via cmd.exe that include deletion commands. This activity is significant as it may indicate malware, such as Clop ransomware, trying to evade detection by removing
  its executable file if certain conditions are met. If confirmed malicious, this could allow the attacker to persist undetected, complicating incident response and remediation efforts.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.T1070
date: '2021-03-19'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 1
  selection_1:
    CommandLine|contains: '* /c *'
  selection_2:
    CommandLine|contains: '* del*'
  selection_3:
    Image|contains: '*\cmd.exe'
  condition: selection_0 and selection_1 and selection_2 and selection_3
