title: Ransomware Notes bulk creation
id: eff7919a-8330-11eb-83f8-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the bulk creation of ransomware notes (e.g., .txt, .html, .hta files) on an infected machine. It leverages Sysmon EventCode 11 to detect multiple instances
  of these file types being created within a short time frame. This activity is significant as it often indicates an active ransomware attack, where the attacker is notifying the victim of the encryption.
  If confirmed malicious, this behavior could lead to widespread data encryption, rendering critical files inaccessible and potentially causing significant operational disruption.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
- attack.T1486
date: '2021-03-19'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 11
  selection_1:
    file_name|contains:
    - '*\.txt'
    - '*\.html'
    - '*\.hta'
  condition: selection_0 and selection_1
