title: Reg exe Manipulating Windows Services Registry Keys
id: 8470d755-0c13-45b3-bd63-387a373c10cf
status: stable
level: medium
author: Rico Valdez, Splunk
description: The following analytic detects the use of reg.exe to modify registry keys associated with Windows services and their configurations. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process names, parent processes, and command-line executions. This activity is significant because unauthorized changes to service registry keys can indicate an attempt to establish
  persistence or escalate privileges. If confirmed malicious, this could allow an attacker to control service behavior, potentially leading to unauthorized code execution or system compromise.
tags:
- attack.T1574_011
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: reg.exe
  selection_1:
    CommandLine|contains: '*reg*'
  selection_2:
    CommandLine|contains: '*add*'
  selection_3:
    CommandLine|contains: '*Services*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
