title: Remote Process Instantiation via WinRM and Winrs
id: 0dd296a2-4338-11ec-ba02-3e22fbd008af
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `winrs.exe` with command-line arguments used to start a process on a remote endpoint. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names and command-line executions mapped to the `Processes` node of the `Endpoint` data model. This activity is significant as it may indicate lateral movement or remote
  code execution attempts by adversaries. If confirmed malicious, this could allow attackers to execute arbitrary code on remote systems, potentially leading to further compromise and lateral spread within
  the network.
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/winrs
- https://attack.mitre.org/techniques/T1021/006/
tags:
- attack.t1021.006
date: '2021-11-11'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name=winrs.exe
          OR
          Processes.original_file_name=winrs.exe
      )
      (Processes.process="*-r:*" OR Processes.process="*-remote:*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `remote_process_instantiation_via_winrm_and_winrs_filter`
splunk_rule_id: 0dd296a2-4338-11ec-ba02-3e22fbd008af
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: winrs.exe
  selection_1:
    OriginalFileName: winrs.exe
  selection_2:
    CommandLine|contains: '-r:'
  selection_3:
    CommandLine|contains: '-remote:'
  condition: selection_0 and selection_1 and selection_2 and selection_3
