title: Remote System Discovery with Wmic
id: d82eced3-b1dc-42ab-859e-a2fc98827359
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `wmic.exe` with specific command-line arguments used to discover remote systems within a domain. It leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential reconnaissance efforts by adversaries to map out network resources
  and Active Directory structures. If confirmed malicious, this behavior could allow attackers to gain situational awareness, identify critical systems, and plan further attacks, potentially leading to
  unauthorized access and data exfiltration.
references:
- https://attack.mitre.org/techniques/T1018/
- https://docs.microsoft.com/en-us/windows/win32/wmisdk/wmic
tags:
- attack.t1018
date: '2021-09-01'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process_name="wmic.exe") (Processes.process=*/NAMESPACE:\\\\root\\directory\\ldap*
  AND Processes.process=*ds_computer* AND Processes.process="*GET ds_samaccountname*") by Processes.action Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
  Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
  Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `remote_system_discovery_with_wmic_filter`'
splunk_rule_id: d82eced3-b1dc-42ab-859e-a2fc98827359
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: wmic.exe
  selection_1:
    CommandLine|contains: /NAMESPACE:\\root\directory\ldap
  selection_2:
    CommandLine|contains: ds_computer
  selection_3:
    CommandLine|contains: GET ds_samaccountname
  condition: selection_0 and selection_1 and selection_2 and selection_3
