title: Remote Desktop Process Running On System
id: f5939373-8054-40ad-8c64-cec478a22a4a
status: experimental
level: medium
author: David Dorsey, Splunk
description: The following analytic detects the execution of the remote desktop process (mstsc.exe) on systems where it is not typically run. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, filtering out systems categorized as common RDP sources. This activity is significant because unauthorized use of mstsc.exe can indicate lateral movement or unauthorized remote access attempts.
  If confirmed malicious, this could allow an attacker to gain remote control of a system, potentially leading to data exfiltration, privilege escalation, or further network compromise.
tags:
- attack.t1021.001
date: '2019-10-16'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process=*mstsc.exe
      AND
      Processes.dest_category!=common_rdp_source
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `drop_dm_object_name(Processes)`
  | `remote_desktop_process_running_on_system_filter`
splunk_rule_id: f5939373-8054-40ad-8c64-cec478a22a4a
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|endswith: mstsc.exe
  selection_1:
    Processes.dest_category: common_rdp_source
  condition: selection_0 and selection_1
