title: Remote System Discovery with Adsisearcher
id: 70803451-0047-4e12-9d63-77fa7eb8649c
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the use of the `[Adsisearcher]` type accelerator in PowerShell scripts to query Active Directory for domain computers. It leverages PowerShell Script Block Logging
  (EventCode=4104) to identify specific script blocks containing `adsisearcher` and `objectcategory=computer` with methods like `findAll()` or `findOne()`. This activity is significant as it may indicate
  an attempt by adversaries or Red Teams to perform Active Directory discovery and gain situational awareness. If confirmed malicious, this could lead to further reconnaissance and potential lateral movement
  within the network.
references:
- https://attack.mitre.org/techniques/T1018/
- https://devblogs.microsoft.com/scripting/use-the-powershell-adsisearcher-type-accelerator-to-search-active-directory/
tags:
- attack.T1018
date: '2021-09-01'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*adsisearcher*'
  selection_2:
    ScriptBlockText|contains: '*objectcategory=computer*'
  selection_3:
    ScriptBlockText|contains:
    - '*findAll()*'
    - '*findOne()*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
