title: Remote Process Instantiation via WinRM and Winrs
id: 0dd296a2-4338-11ec-ba02-3e22fbd008af
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `winrs.exe` with command-line arguments used to start a process on a remote endpoint. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names and command-line executions mapped to the `Processes` node of the `Endpoint` data model. This activity is significant as it may indicate lateral movement or remote
  code execution attempts by adversaries. If confirmed malicious, this could allow attackers to execute arbitrary code on remote systems, potentially leading to further compromise and lateral spread within
  the network.
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/winrs
- https://attack.mitre.org/techniques/T1021/006/
tags:
- attack.T1021_006
date: '2021-11-11'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: winrs.exe
  selection_1:
    OriginalFileName: winrs.exe
  selection_2:
    CommandLine|contains: '*-r:*'
  selection_3:
    CommandLine|contains: '*-remote:*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
