title: Resize ShadowStorage volume
id: bc760ca6-8336-11eb-bcbb-acde48001122
status: stable
level: medium
author: Teoderick Contreras
description: The following analytic identifies the resizing of shadow storage volumes, a technique used by ransomware like CLOP to prevent the recreation of shadow volumes. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on command-line executions involving "vssadmin.exe" with parameters related to resizing shadow storage. This activity is significant as it indicates
  an attempt to hinder recovery efforts by manipulating shadow copies. If confirmed malicious, this could lead to successful ransomware deployment, making data recovery difficult and increasing the potential
  for data loss.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md
- https://redcanary.com/blog/blackbyte-ransomware/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/vssadmin-resize-shadowstorage
tags:
- attack.T1490
date: '2021-03-19'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: cmd.exe
  selection_1:
    ParentImage: powershell.exe
  selection_2:
    ParentImage: powershell_ise.exe
  selection_3:
    ParentImage: wmic.exe
    Image: vssadmin.exe
    CommandLine|contains: '*resize*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
