title: Resize ShadowStorage volume
id: bc760ca6-8336-11eb-bcbb-acde48001122
status: stable
level: medium
author: Teoderick Contreras
description: The following analytic identifies the resizing of shadow storage volumes, a technique used by ransomware like CLOP to prevent the recreation of shadow volumes. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on command-line executions involving "vssadmin.exe" with parameters related to resizing shadow storage. This activity is significant as it indicates
  an attempt to hinder recovery efforts by manipulating shadow copies. If confirmed malicious, this could lead to successful ransomware deployment, making data recovery difficult and increasing the potential
  for data loss.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md
- https://redcanary.com/blog/blackbyte-ransomware/
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/vssadmin-resize-shadowstorage
tags:
- attack.t1490
date: '2021-03-19'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as cmdline values(Processes.parent_process_name) as parent_process values(Processes.process_name) as process_name min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.parent_process_name = "cmd.exe"
      OR
      Processes.parent_process_name = "powershell.exe"
      OR
      Processes.parent_process_name = "powershell_ise.exe"
      OR
      Processes.parent_process_name =  "wmic.exe" Processes.process_name = "vssadmin.exe" Processes.process="*resize*" Processes.process="*shadowstorage*" Processes.process="*/maxsize*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `resize_shadowstorage_volume_filter`
splunk_rule_id: bc760ca6-8336-11eb-bcbb-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: cmd.exe
  selection_1:
    ParentImage: powershell.exe
  selection_2:
    ParentImage: powershell_ise.exe
  selection_3:
    ParentImage: wmic.exe
    Image: vssadmin.exe
    CommandLine|contains: '*resize*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
