title: Revil Common Exec Parameter
id: 85facebe-c382-11eb-9c3e-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of command-line parameters commonly associated with REVIL ransomware, such as "-nolan", "-nolocal", "-fast", and "-full". It leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process execution logs mapped to the `Processes` node of the `Endpoint` data model. This activity is significant because these parameters are
  indicative of ransomware attempting to encrypt files on a compromised machine. If confirmed malicious, this could lead to widespread data encryption, rendering critical files inaccessible and potentially
  causing significant operational disruption.
references:
- https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-what-the-code-tells-us/
tags:
- attack.t1204
date: '2021-06-04'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process = "* -nolan *"
      OR
      Processes.process = "* -nolocal *"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `revil_common_exec_parameter_filter`
splunk_rule_id: 85facebe-c382-11eb-9c3e-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: ' -nolan '
  selection_1:
    CommandLine|contains: ' -nolocal '
  condition: selection_0 and selection_1
