title: Rubeus Command Line Parameters
id: cca37478-8377-11ec-b59a-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the use of Rubeus command line parameters, a toolset for Kerberos attacks within Active Directory environments. It leverages Endpoint Detection and Response (EDR)
  data to identify specific command-line arguments associated with actions like ticket manipulation, kerberoasting, and password spraying. This activity is significant as Rubeus is commonly used by adversaries
  to exploit Kerberos for privilege escalation and lateral movement. If confirmed malicious, this could lead to unauthorized access, persistence, and potential compromise of sensitive information within
  the network.
references:
- https://github.com/GhostPack/Rubeus
- https://web.archive.org/web/20210725005734/http://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/
- https://attack.mitre.org/techniques/T1550/003/
- https://en.hackndo.com/kerberos-silver-golden-tickets/
tags:
- attack.t1550.003
- attack.t1558.003
- attack.t1558.004
date: '2022-02-07'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where (Processes.process = "*ptt /ticket*" OR Processes.process
  = "* monitor /interval*" OR Processes.process ="* asktgt* /user:*" OR Processes.process ="* asktgs* /service:*" OR Processes.process ="* golden* /user:*" OR Processes.process ="* silver* /service:*" OR
  Processes.process ="* kerberoast*" OR Processes.process ="* asreproast*" OR Processes.process = "* renew* /ticket:*" OR Processes.process = "* brute* /password:*" OR Processes.process = "* brute* /passwords:*"
  OR Processes.process ="* harvest*") by Processes.action Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `rubeus_command_line_parameters_filter`'
splunk_rule_id: cca37478-8377-11ec-b59a-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: ptt /ticket
  selection_1:
    CommandLine|contains: ' monitor /interval'
  selection_2:
    CommandLine|contains: ' asktgt* /user:'
  selection_3:
    CommandLine|contains: ' asktgs* /service:'
  selection_4:
    CommandLine|contains: ' golden* /user:'
  selection_5:
    CommandLine|contains: ' silver* /service:'
  selection_6:
    CommandLine|contains: ' kerberoast'
  selection_7:
    CommandLine|contains: ' asreproast'
  selection_8:
    CommandLine|contains: ' renew* /ticket:'
  selection_9:
    CommandLine|contains: ' brute* /password:'
  selection_10:
    CommandLine|contains: ' brute* /passwords:'
  selection_11:
    CommandLine|contains: ' harvest'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6 and selection_7 and selection_8 and selection_9 and selection_10 and selection_11
