title: Rubeus Command Line Parameters
id: cca37478-8377-11ec-b59a-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the use of Rubeus command line parameters, a toolset for Kerberos attacks within Active Directory environments. It leverages Endpoint Detection and Response (EDR)
  data to identify specific command-line arguments associated with actions like ticket manipulation, kerberoasting, and password spraying. This activity is significant as Rubeus is commonly used by adversaries
  to exploit Kerberos for privilege escalation and lateral movement. If confirmed malicious, this could lead to unauthorized access, persistence, and potential compromise of sensitive information within
  the network.
references:
- https://github.com/GhostPack/Rubeus
- https://web.archive.org/web/20210725005734/http://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/
- https://attack.mitre.org/techniques/T1550/003/
- https://en.hackndo.com/kerberos-silver-golden-tickets/
tags:
- attack.T1550_003
- attack.T1558_003
- attack.T1558_004
date: '2022-02-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*ptt /ticket*'
  selection_1:
    CommandLine|contains: '* monitor /interval*'
  selection_2:
    CommandLine|contains: '* asktgt* /user:*'
  selection_3:
    CommandLine|contains: '* asktgs* /service:*'
  selection_4:
    CommandLine|contains: '* golden* /user:*'
  selection_5:
    CommandLine|contains: '* silver* /service:*'
  selection_6:
    CommandLine|contains: '* kerberoast*'
  selection_7:
    CommandLine|contains: '* asreproast*'
  selection_8:
    CommandLine|contains: '* renew* /ticket:*'
  selection_9:
    CommandLine|contains: '* brute* /password:*'
  selection_10:
    CommandLine|contains: '* brute* /passwords:*'
  selection_11:
    CommandLine|contains: '* harvest*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6 and selection_7 and selection_8 and selection_9 and selection_10 and selection_11
