title: Rubeus Kerberos Ticket Exports Through Winlogon Access
id: 5ed8c50a-8869-11ec-876f-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects a process accessing the winlogon.exe system process, indicative of the Rubeus tool attempting to export Kerberos tickets from memory. This detection leverages
  Sysmon EventCode 10 logs, focusing on processes obtaining a handle to winlogon.exe with specific access rights. This activity is significant as it often precedes pass-the-ticket attacks, where adversaries
  use stolen Kerberos tickets to move laterally within an environment. If confirmed malicious, this could allow attackers to bypass normal access controls, escalate privileges, and persist within the network,
  posing a severe security risk.
references:
- https://github.com/GhostPack/Rubeus
- https://web.archive.org/web/20210725005734/http://www.harmj0y.net/blog/redteaming/from-kekeo-to-rubeus/
- https://attack.mitre.org/techniques/T1550/003/
tags:
- attack.T1550_003
date: '2022-02-07'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage: C:\Windows\system32\winlogon.exe
  selection_2:
    GrantedAccess: '0x1f3fff'
  selection_3:
    SourceImage!: C:\Windows\system32\svchost.exe
  selection_4:
    SourceImage!: C:\Windows\system32\lsass.exe
  selection_5:
    SourceImage!: C:\Windows\system32\LogonUI.exe
  selection_6:
    SourceImage!: C:\Windows\system32\smss.exe
  selection_7:
    SourceImage!: C:\Windows\system32\wbem\wmiprvse.exe
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6 and selection_7
