title: Runas Execution in CommandLine
id: 4807e716-43a4-11ec-a0e7-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the runas.exe process with administrator user options. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line
  executions and process details. This activity is significant as it may indicate an attempt to gain elevated privileges, a common tactic in privilege escalation and lateral movement. If confirmed malicious,
  this could allow an attacker to execute commands with higher privileges, potentially leading to unauthorized access, data exfiltration, or further compromise of the target host.
references:
- https://app.any.run/tasks/ad4c3cda-41f2-4401-8dba-56cc2d245488/
tags:
- attack.t1134.001
date: '2021-11-17'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  (Processes.process_name="runas.exe" OR Processes.original_file_name="runas.exe")
  Processes.process ="*/user:*"
  Processes.process = "*admin*"
  by Processes.action Processes.dest
     Processes.original_file_name Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
     Processes.parent_process_path Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name
     Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `runas_execution_in_commandline_filter`
splunk_rule_id: 4807e716-43a4-11ec-a0e7-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: runas.exe
  selection_1:
    OriginalFileName: runas.exe
  selection_2:
    CommandLine|contains: '/user:'
  selection_3:
    CommandLine|contains: admin
  condition: selection_0 and selection_1 and selection_2 and selection_3
