title: Rundll32 Process Creating Exe Dll Files
id: 6338266a-ee2a-11eb-bf68-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a rundll32 process creating executable (.exe) or dynamic link library (.dll) files. It leverages Sysmon EventCode 11 to identify instances where rundll32.exe
  generates these file types. This activity is significant because rundll32 is often exploited by malware, such as IcedID, to drop malicious payloads in directories like Temp, AppData, or ProgramData. If
  confirmed malicious, this behavior could allow an attacker to execute arbitrary code, establish persistence, or escalate privileges within the environment.
references:
- https://any.run/malware-trends/icedid
tags:
- attack.T1218_011
date: '2021-08-03'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 11
  selection_1:
    Image|contains: '*rundll32.exe'
  selection_2:
    TargetFilename|contains:
    - '*.exe'
    - '*.dll'
  condition: selection_0 and selection_1 and selection_2
