title: Scheduled Task Initiation on Remote Endpoint
id: 95cf4608-4302-11ec-8194-3e22fbd008af
status: stable
level: medium
author: Mauricio Velazco, Splunk, Badoodish, Github Community
description: The following analytic detects the use of 'schtasks.exe' to start a Scheduled Task on a remote endpoint. This detection leverages Endpoint Detection and Response (EDR) data, focusing on process
  details such as process name, parent process, and command-line executions. This activity is significant as adversaries often abuse Task Scheduler for lateral movement and remote code execution. If confirmed
  malicious, this behavior could allow attackers to execute arbitrary code remotely, potentially leading to further compromise of the network.
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks
- https://attack.mitre.org/techniques/T1053/005/
tags:
- attack.t1053.005
date: '2021-11-11'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name=schtasks.exe
          OR
          Processes.original_file_name=schtasks.exe
      )
      (Processes.process= "* /S *" AND Processes.process=*/run*)
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `scheduled_task_initiation_on_remote_endpoint_filter`
splunk_rule_id: 95cf4608-4302-11ec-8194-3e22fbd008af
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: schtasks.exe
  selection_1:
    OriginalFileName: schtasks.exe
  selection_2:
    CommandLine|contains: ' /S '
  selection_3:
    CommandLine|contains: /run
  condition: selection_0 and selection_1 and selection_2 and selection_3
