title: Scheduled Task Deleted Or Created via CMD
id: d5af132c-7c17-439c-9d31-13d55340f36c
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the creation or deletion of scheduled tasks via schtasks.exe when invoked with create or delete flags, specifically focusing on those executions where the process
  includes additional parameters such as /tr, /sc, or /ru. The detection uses Endpoint Detection and Response (EDR) telemetry mapped to the Endpoint data model, and filters out events originating from trusted
  system paths like C:\Windows\System32 or C:\Program Files. It further narrows results to cases where schtasks.exe is launched by potentially suspicious parent processes such as cmd.exe, wscript.exe, or
  cscript.exe, and excludes service accounts. This behavior may indicate adversary efforts to gain persistence or evade detection by manipulating scheduled tasks using scripts or command shells. If confirmed
  malicious, such activity could lead to unauthorized code execution or the removal of monitoring mechanisms on endpoints.
references:
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
- https://www.joesandbox.com/analysis/691823/0/html
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-delete
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
tags:
- attack.T1053_005
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: cmd.exe
  selection_1:
    Image: schtasks.exe
  selection_2:
    CommandLine|contains:
    - '*/create*'
    - '*-create*'
    - '*/delete*'
    - '*-delete*'
  filter_3:
    CommandLine:
    - '* \"C:\Program Files (x86)\*'
    - '* \"C:\Program Files\*'
    - '* \"C:\Windows\System32\*'
    - '* \"C:\Windows\SysWOW64\*'
    - '* C:\Program Files (x86)\*'
    - '* C:\Program Files\*'
    - '* C:\Windows\System32\*'
    - '* C:\Windows\SysWOW64\*'
  filter_4:
    User|contains: '*$'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3 and filter_4)
