title: Schtasks scheduling job on remote system
id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
status: stable
level: medium
author: David Dorsey, Mauricio Velazco, Splunk
description: The following analytic detects the use of 'schtasks.exe' to create a scheduled task on a remote system, indicating potential lateral movement or remote code execution. It leverages process
  data from Endpoint Detection and Response (EDR) agents, focusing on specific command-line arguments and flags. This activity is significant as it may signify an adversary's attempt to persist or execute
  code remotely. If confirmed malicious, this could allow attackers to maintain access, execute arbitrary commands, or further infiltrate the network, posing a severe security risk.
tags:
- attack.T1053_005
date: '2019-10-16'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: schtasks.exe
  selection_1:
    OriginalFileName: schtasks.exe
  selection_2:
    CommandLine|contains: '*/create*'
  selection_3:
    CommandLine|contains: '*/s *'
  condition: selection_0 and selection_1 and selection_2 and selection_3
