title: Schtasks scheduling job on remote system
id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
status: stable
level: medium
author: David Dorsey, Mauricio Velazco, Splunk
description: The following analytic detects the use of 'schtasks.exe' to create a scheduled task on a remote system, indicating potential lateral movement or remote code execution. It leverages process
  data from Endpoint Detection and Response (EDR) agents, focusing on specific command-line arguments and flags. This activity is significant as it may signify an adversary's attempt to persist or execute
  code remotely. If confirmed malicious, this could allow attackers to maintain access, execute arbitrary commands, or further infiltrate the network, posing a severe security risk.
tags:
- attack.t1053.005
date: '2019-10-16'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name = schtasks.exe
          OR
          Processes.original_file_name=schtasks.exe
      )
      (Processes.process="*/create*" AND Processes.process="*/s *")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `schtasks_scheduling_job_on_remote_system_filter`
splunk_rule_id: 1297fb80-f42a-4b4a-9c8a-88c066237cf6
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: schtasks.exe
  selection_1:
    OriginalFileName: schtasks.exe
  selection_2:
    CommandLine|contains: /create
  selection_3:
    CommandLine|contains: '/s '
  condition: selection_0 and selection_1 and selection_2 and selection_3
