title: Script Execution via WMI
id: aa73f80d-d728-4077-b226-81ea0c8be589
status: stable
level: medium
author: Rico Valdez, Michael Haag, Splunk
description: The following analytic detects the execution of scripts via Windows Management Instrumentation (WMI) by monitoring the process 'scrcons.exe'. This detection leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process creation events. WMI-based script execution is significant because adversaries often use it to perform malicious activities stealthily, such as system compromise,
  data exfiltration, or establishing persistence. If confirmed malicious, this activity could allow attackers to execute arbitrary code, escalate privileges, or maintain long-term access to the environment.
  Analysts should differentiate between legitimate administrative use and potential threats.
references:
- https://redcanary.com/blog/child-processes/
tags:
- attack.T1047
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: scrcons.exe
  condition: selection_0
