title: Sdelete Application Execution
id: 31702fc0-2682-11ec-85c3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the sdelete.exe application, a Sysinternals tool often used by adversaries to securely delete files and remove forensic evidence from a targeted
  host. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. Monitoring this activity is crucial as sdelete.exe is not commonly used in regular
  operations and its presence may indicate an attempt to cover malicious activities. If confirmed malicious, this could lead to the loss of critical forensic data, hindering incident response and investigation
  efforts.
references:
- https://app.any.run/tasks/956f50be-2c13-465a-ac00-6224c14c5f89/
tags:
- attack.T1070_004
- attack.T1485
date: '2021-10-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: sdelete.exe
  selection_1:
    OriginalFileName: sdelete.exe
  condition: selection_0 and selection_1
