title: SecretDumps Offline NTDS Dumping Tool
id: 5672819c-be09-11eb-bbfb-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the potential use of the secretsdump.py tool to dump NTLM hashes from a copy of ntds.dit and the SAM, SYSTEM, and SECURITY registry hives. It leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on specific command-line patterns and process names associated with secretsdump.py. This activity is significant because it indicates an attempt
  to extract sensitive credential information offline, which is a common post-exploitation technique. If confirmed malicious, this could allow an attacker to obtain NTLM hashes, facilitating further lateral
  movement and potential privilege escalation within the network.
references:
- https://github.com/SecureAuthCorp/impacket/blob/master/examples/secretsdump.py
tags:
- attack.t1003.003
date: '2021-05-26'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name = "python*.exe" Processes.process = "*.py*" Processes.process = "*-ntds*" (Processes.process = "*-system*"
      OR
      Processes.process = "*-sam*"
      OR
      Processes.process = "*-security*"
      OR
      Processes.process = "*-bootkey*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `secretdumps_offline_ntds_dumping_tool_filter`
splunk_rule_id: 5672819c-be09-11eb-bbfb-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: python*.exe
  selection_1:
    CommandLine|contains: .py
  selection_2:
    CommandLine|contains: -ntds
  selection_3:
    CommandLine|contains: -system
  selection_4:
    CommandLine|contains: -sam
  selection_5:
    CommandLine|contains: -security
  selection_6:
    CommandLine|contains: -bootkey
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6
