title: Services LOLBAS Execution Process Spawn
id: ba9e1954-4c04-11ec-8b74-3e22fbd008af
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies `services.exe` spawning a LOLBAS (Living Off the Land Binaries and Scripts) execution process. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process creation events where `services.exe` is the parent process. This activity is significant because adversaries often abuse the Service Control Manager to execute malicious code
  via native Windows binaries, facilitating lateral movement. If confirmed malicious, this behavior could allow attackers to execute arbitrary code, escalate privileges, or maintain persistence within the
  environment, posing a severe security risk.
references:
- https://attack.mitre.org/techniques/T1543/003/
- https://pentestlab.blog/2020/07/21/lateral-movement-services/
- https://lolbas-project.github.io/
tags:
- attack.t1543.003
date: '2021-11-23'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.parent_process_name=services.exe
      )
      (Processes.process_name IN ("Regsvcs.exe", "Ftp.exe", "OfflineScannerShell.exe", "Rasautou.exe", "Schtasks.exe", "Xwizard.exe", "Dllhost.exe", "Pnputil.exe", "Atbroker.exe", "Pcwrun.exe", "Ttdinject.exe","Mshta.exe", "Bitsadmin.exe", "Certoc.exe", "Ieexec.exe", "Microsoft.Workflow.Compiler.exe", "Runscripthelper.exe", "Forfiles.exe", "Msbuild.exe", "Register-cimprovider.exe", "Tttracer.exe", "Ie4uinit.exe", "Bash.exe", "Hh.exe", "SettingSyncHost.exe", "Cmstp.exe", "Mmc.exe", "Stordiag.exe", "Scriptrunner.exe", "Odbcconf.exe", "Extexport.exe", "Msdt.exe", "WorkFolders.exe", "Diskshadow.exe", "Mavinject.exe", "Regasm.exe", "Gpscript.exe", "Rundll32.exe", "Regsvr32.exe", "Msiexec.exe", "Wuauclt.exe", "Presentationhost.exe", "Wmic.exe", "Runonce.exe", "Syncappvpublishingserver.exe", "Verclsid.exe", "Infdefaultinstall.exe", "Explorer.exe", "Installutil.exe", "Netsh.exe", "Wab.exe", "Dnscmd.exe", "At.exe", "Pcalua.exe", "Msconfig.exe"))
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `services_lolbas_execution_process_spawn_filter`
splunk_rule_id: ba9e1954-4c04-11ec-8b74-3e22fbd008af
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: services.exe
  selection_1:
    Image:
    - Regsvcs.exe
    - Ftp.exe
    - OfflineScannerShell.exe
    - Rasautou.exe
    - Schtasks.exe
    - Xwizard.exe
    - Dllhost.exe
    - Pnputil.exe
    - Atbroker.exe
    - Pcwrun.exe
    - Ttdinject.exe
    - Mshta.exe
    - Bitsadmin.exe
    - Certoc.exe
    - Ieexec.exe
    - Microsoft.Workflow.Compiler.exe
    - Runscripthelper.exe
    - Forfiles.exe
    - Msbuild.exe
    - Register-cimprovider.exe
    - Tttracer.exe
    - Ie4uinit.exe
    - Bash.exe
    - Hh.exe
    - SettingSyncHost.exe
    - Cmstp.exe
    - Mmc.exe
    - Stordiag.exe
    - Scriptrunner.exe
    - Odbcconf.exe
    - Extexport.exe
    - Msdt.exe
    - WorkFolders.exe
    - Diskshadow.exe
    - Mavinject.exe
    - Regasm.exe
    - Gpscript.exe
    - Rundll32.exe
    - Regsvr32.exe
    - Msiexec.exe
    - Wuauclt.exe
    - Presentationhost.exe
    - Wmic.exe
    - Runonce.exe
    - Syncappvpublishingserver.exe
    - Verclsid.exe
    - Infdefaultinstall.exe
    - Explorer.exe
    - Installutil.exe
    - Netsh.exe
    - Wab.exe
    - Dnscmd.exe
    - At.exe
    - Pcalua.exe
    - Msconfig.exe
  condition: selection_0 and selection_1
