title: Shim Database Installation With Suspicious Parameters
id: 404620de-46d8-48b6-90cc-8a8d7b0876a3
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects the execution of sdbinst.exe with parameters indicative of silently creating a shim database. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names, parent processes, and command-line arguments. This activity is significant because shim databases can be used to intercept and manipulate API calls, potentially allowing attackers
  to bypass security controls or achieve persistence. If confirmed malicious, this could enable unauthorized code execution, privilege escalation, or persistent access to the compromised system.
tags:
- attack.T1546_011
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: sdbinst.exe
  filter_1:
    CommandLine:
    - \"C:\Windows\System32\sdbinst.exe\"
    - C:\Windows\System32\sdbinst.exe
    - '*-mm'
    - '*-?'
    - '*-m -bg'
  condition: (selection_0) and not (filter_1)
