title: Single Letter Process On Endpoint
id: a4214f0b-e01c-41bc-8cc4-d2b71e3056b4
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects processes with names consisting of a single letter, which is often indicative of malware or an attacker attempting to evade detection. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant because attackers use such techniques to obscure their presence
  and carry out malicious activities like data theft or ransomware attacks. If confirmed malicious, this behavior could lead to unauthorized access, data exfiltration, or system compromise. Immediate investigation
  is required to determine the legitimacy of the process.
tags:
- attack.T1204_002
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - _.exe
    - -.exe
    - ',.exe'
    - ;.exe
    - '!.exe'
    - '''.exe'
    - (.exe
    - (.exe
    - ).exe
    - ).exe
    - '@.exe'
    - '&.exe'
    - '#.exe'
    - '%.exe'
    - '`.exe'
    - ^.exe
    - +.exe
    - =.exe
    - ~.exe
    - $.exe
    - 0.exe
    - 1.exe
    - 2.exe
    - 3.exe
    - 4.exe
    - 5.exe
    - 6.exe
    - 7.exe
    - 8.exe
    - 9.exe
    - a.exe
    - b.exe
    - c.exe
    - d.exe
    - e.exe
    - f.exe
    - g.exe
    - h.exe
    - i.exe
    - j.exe
    - k.exe
    - l.exe
    - m.exe
    - N.exe
    - o.exe
    - p.exe
    - q.exe
    - r.exe
    - s.exe
    - t.exe
    - u.exe
    - v.exe
    - w.exe
    - x.exe
    - y.exe
    - z.exe
  condition: selection_0
