title: SLUI RunAs Elevated
id: 8d124810-b3e4-11eb-96c7-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of the Microsoft Software Licensing User Interface Tool (`slui.exe`) with elevated privileges using the `-verb runas` function. This activity is
  identified through logs from Endpoint Detection and Response (EDR) agents, focusing on specific registry keys and command-line parameters. This behavior is significant as it indicates a potential privilege
  escalation attempt, which could allow an attacker to gain elevated access and execute malicious actions with higher privileges. If confirmed malicious, this could lead to unauthorized system changes,
  data exfiltration, or further compromise of the affected endpoint.
references:
- https://www.exploit-db.com/exploits/46998
- https://mattharr0ey.medium.com/privilege-escalation-uac-bypass-in-changepk-c40b92818d1b
- https://gist.github.com/r00t-3xp10it/0c92cd554d3156fd74f6c25660ccc466
- https://www.rapid7.com/db/modules/exploit/windows/local/bypassuac_sluihijack/
- https://www.mandiant.com/resources/shining-a-light-on-darkside-ransomware-operations
tags:
- attack.t1548.002
date: '2021-05-13'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name=slui.exe (Processes.process=*-verb* Processes.process=*runas*)
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `slui_runas_elevated_filter`
splunk_rule_id: 8d124810-b3e4-11eb-96c7-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: slui.exe
  selection_1:
    CommandLine|contains: -verb
  selection_2:
    CommandLine|contains: runas
  condition: selection_0 and selection_1 and selection_2
