title: SLUI Spawning a Process
id: 879c4330-b3e0-11eb-b1b1-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the Microsoft Software Licensing User Interface Tool (`slui.exe`) spawning a child process. This behavior is identified using Endpoint Detection and Response
  (EDR) telemetry, focusing on process creation events where `slui.exe` is the parent process. This activity is significant because `slui.exe` should not typically spawn child processes, and doing so may
  indicate a UAC bypass attempt, leading to elevated privileges. If confirmed malicious, an attacker could leverage this to execute code with elevated privileges, potentially compromising the system's security
  and gaining unauthorized access.
references:
- https://www.exploit-db.com/exploits/46998
- https://www.rapid7.com/db/modules/exploit/windows/local/bypassuac_sluihijack/
- https://www.mandiant.com/resources/shining-a-light-on-darkside-ransomware-operations
tags:
- attack.T1548_002
date: '2021-05-13'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: slui.exe
  filter_1:
    Image: slui.exe
  condition: (selection_0) and not (filter_1)
