title: Splunk RCE Through Arbitrary File Write to Windows System Root
id: c97e0704-d9c6-454d-89ba-1510a987bf72
status: stable
level: medium
author: Rod Soto
description: In Splunk Enterprise for Windows versions below 9.3.0, 9.2.3, and 9.1.6, a low-privileged user that does not hold the “admin” or “power” Splunk roles could write a file to the Windows system
  root directory, which has a default location of C:\Windows\System32, when Splunk Enterprise for Windows is installed on a separate drive. Additionally, this user may be able to upload and execute code
  due to insecure session storage configuration.
references:
- https://advisory.splunk.com/advisories/SVD-2024-1001
- https://advisory.splunk.com/advisories/SVD-2024-1003
tags:
- attack.T1210
date: '2024-10-14'
logsource:
  category: application
  product: windows
detection:
  selection_0:
    sc-status: 200
  selection_1:
    uri_path|contains: '*/search/apps/local/_new'
  condition: selection_0 and selection_1
