title: Spoolsv Suspicious Process Access
id: 799b606e-da81-11eb-93f8-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Michael Haag, Teoderick Contreras, Splunk
description: The following analytic detects suspicious process access by spoolsv.exe, potentially indicating exploitation of the PrintNightmare vulnerability (CVE-2021-34527). It leverages Sysmon EventCode
  10 to identify when spoolsv.exe accesses critical system files or processes like rundll32.exe with elevated privileges. This activity is significant as it may signal an attempt to gain unauthorized privilege
  escalation on a vulnerable machine. If confirmed malicious, an attacker could achieve elevated privileges, leading to further system compromise, persistent access, or unauthorized control over the affected
  environment.
references:
- https://github.com/cube0x0/impacket/commit/73b9466c17761384ece11e1028ec6689abad6818
- https://www.truesec.com/hub/blog/fix-for-printnightmare-cve-2021-1675-exploit-to-keep-your-print-servers-running-while-a-patch-is-not-available
- https://www.truesec.com/hub/blog/exploitable-critical-rce-vulnerability-allows-regular-users-to-fully-compromise-active-directory-printnightmare-cve-2021-1675
- https://www.reddit.com/r/msp/comments/ob6y02/critical_vulnerability_printnightmare_exposes
tags:
- attack.T1068
date: '2021-07-01'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    SourceImage|contains: '*\spoolsv.exe'
  selection_2:
    CallTrace|contains: '*\Windows\system32\spool\DRIVERS\x64\*'
  selection_3:
    TargetImage|contains:
    - '*\rundll32.exe'
    - '*\spoolsv.exe'
  selection_4:
    GrantedAccess: '0x1fffff'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
