title: Spoolsv Suspicious Loaded Modules
id: a5e451f8-da81-11eb-b245-acde48001122
status: stable
level: medium
author: Mauricio Velazco, Michael Haag, Teoderick Contreras, Splunk
description: The following analytic detects the suspicious loading of DLLs by spoolsv.exe, potentially indicating PrintNightmare exploitation. It leverages Sysmon EventCode 7 to identify instances where
  spoolsv.exe loads multiple DLLs from the Windows System32 spool drivers x64 directory. This activity is significant as it may signify an attacker exploiting the PrintNightmare vulnerability to execute
  arbitrary code. If confirmed malicious, this could lead to unauthorized code execution, privilege escalation, and persistent access within the environment, posing a severe security risk.
references:
- https://raw.githubusercontent.com/hieuttmmo/sigma/dceb13fe3f1821b119ae495b41e24438bd97e3d0/rules/windows/image_load/sysmon_cve_2021_1675_print_nightmare.yml
tags:
- attack.T1547_012
date: '2021-07-01'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image|contains: '*\spoolsv.exe'
  selection_2:
    ImageLoaded|contains: '*\Windows\System32\spool\drivers\x64\*'
  selection_3:
    ImageLoaded|contains: '*.dll'
  condition: selection_0 and selection_1 and selection_2 and selection_3
