title: Spring4Shell Payload URL Request
id: 9d44d649-7d67-4559-95c1-8022ff49420b
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects attempts to exploit the Spring4Shell vulnerability (CVE-2022-22963) by identifying specific URL patterns associated with web shell payloads. It leverages web
  traffic data, focusing on HTTP GET requests with URLs containing indicators like "tomcatwar.jsp," "poc.jsp," and "shell.jsp." This activity is significant as it suggests an attacker is trying to deploy
  a web shell, which can lead to remote code execution. If confirmed malicious, this could allow the attacker to gain persistent access, execute arbitrary commands, and potentially escalate privileges within
  the compromised environment.
references:
- https://www.microsoft.com/security/blog/2022/04/04/springshell-rce-vulnerability-guidance-for-protecting-against-and-detecting-cve-2022-22965/
- https://github.com/TheGejr/SpringShell
- https://www.tenable.com/blog/spring4shell-faq-spring-framework-remote-code-execution-vulnerability
tags:
- attack.T1133
- attack.T1190
- attack.T1505_003
date: '2022-04-05'
logsource:
  category: webserver
  product: windows
detection:
  selection_0:
    cs-method|contains: GET
  selection_1:
    cs-uri|contains:
    - '*tomcatwar.jsp*'
    - '*poc.jsp*'
    - '*shell.jsp*'
  condition: selection_0 and selection_1
