title: Suspicious Copy on System32
id: ce633e56-25b2-11ec-9e76-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects potentially suspicious file copy operations targeting the
  System32 or SysWow64 directories as source, often indicative of malicious activity.
  It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on activity initiated by command-line tools like cmd.exe or PowerShell.
  This behavior is significant as it may indicate an attempt to evade defenses by copying
  an existing binary from the system directory and renaming it.
  If confirmed malicious, this activity could allow an attacker to execute
  code undetected and potentially leading to system compromise or further lateral movement
  within the network.
references:
- https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
- attack.t1036.003
date: '2021-10-05'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  Processes.parent_process_name IN (
    "cmd.exe",
    "powershell.exe",
    "pwsh.exe",
    "sqlps.exe",
    "sqltoolsps.exe"
  )
  (
    Processes.process_name IN ("copy.exe", "xcopy.exe")
    OR
    Processes.original_file_name IN ("copy.exe", "xcopy.exe")
  )
  Processes.process IN (
    "* \"C:\\Windows\\System32\\*",
    "* \'C:\\Windows\\System32\\*",
    "* C:\\Windows\\System32\\*",
    "* \"C:\\Windows\\SysWow64\\*",
    "* \'C:\\Windows\\SysWow64\\*",
    "* C:\\Windows\\SysWow64\\*"
  )
  by Processes.action Processes.dest Processes.original_file_name
  Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
  Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
  Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
  Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
  Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `suspicious_copy_on_system32_filter`
splunk_rule_id: ce633e56-25b2-11ec-9e76-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - sqlps.exe
    - sqltoolsps.exe
  selection_1:
    Image:
    - copy.exe
    - xcopy.exe
  selection_2:
    OriginalFileName:
    - copy.exe
    - xcopy.exe
  selection_3:
    CommandLine|contains:
    - ' \"C:\Windows\System32\'
    - ' \''C:\Windows\System32\'
    - ' C:\Windows\System32\'
    - ' \"C:\Windows\SysWow64\'
    - ' \''C:\Windows\SysWow64\'
    - ' C:\Windows\SysWow64\'
  condition: selection_0 and selection_1 and selection_2 and selection_3
