title: Suspicious microsoft workflow compiler usage
id: 9bbc62e8-55d8-11eb-ae93-0242ac130002
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies the usage of microsoft.workflow.compiler.exe, a rarely utilized executable typically found in C:\Windows\Microsoft.NET\Framework64\v4.0.30319. This detection
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution telemetry. The significance of this activity lies in its uncommon usage, which may indicate malicious intent
  such as code execution or persistence mechanisms. If confirmed malicious, an attacker could leverage this process to execute arbitrary code, potentially leading to unauthorized access or further compromise
  of the system.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msbuild/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218/T1218.md#atomic-test-6---microsoftworkflowcompilerexe-payload-execution
tags:
- attack.T1127
date: '2021-01-19'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: microsoft.workflow.compiler.exe
  selection_1:
    OriginalFileName: Microsoft.Workflow.Compiler.exe
  condition: selection_0 and selection_1
