title: Suspicious SearchProtocolHost no Command Line Arguments
id: f52d2db8-31f9-4aa7-a176-25779effe55c
status: stable
level: medium
author: Michael Haag, Splunk
description: |-
  The following analytic detects instances of searchprotocolhost.exe running without command line arguments.
  This behavior is unusual and often associated with malicious activities, such as those performed by Cobalt Strike.
  The detection leverages Endpoint Detection and Response (EDR) telemetry, focusing on process execution data.
  This activity is significant because searchprotocolhost.exe typically runs with specific arguments, and its absence may indicate an attempt to evade detection.
  If confirmed malicious, this could lead to unauthorized code execution, potential credential dumping, or other malicious actions within the environment.
references:
- https://github.com/mandiant/red_team_tool_countermeasures/blob/master/rules/PGF/supplemental/hxioc/SUSPICIOUS%20EXECUTION%20OF%20SEARCHPROTOCOLHOST%20(METHODOLOGY).ioc
tags:
- attack.t1055
date: '2021-02-23'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  FROM datamodel=Endpoint.Processes WHERE

  (
      Processes.process_name=searchprotocolhost.exe
      OR
      Processes.original_file_name=searchprotocolhost.exe
  )
  Processes.process IN ("*searchprotocolhost","*searchprotocolhost.exe", "*searchprotocolhost.exe\"")

  BY Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `suspicious_searchprotocolhost_no_command_line_arguments_filter`
splunk_rule_id: f52d2db8-31f9-4aa7-a176-25779effe55c
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: searchprotocolhost.exe
  selection_1:
    OriginalFileName: searchprotocolhost.exe
  selection_2:
    CommandLine|endswith:
    - searchprotocolhost
    - searchprotocolhost.exe
    - searchprotocolhost.exe\"
  condition: selection_0 and selection_1 and selection_2
