title: Suspicious Rundll32 no Command Line Arguments
id: e451bd16-e4c5-4109-8eb1-c4c6ecf048b4
status: stable
level: medium
author: Michael Haag, Splunk
description: |-
  The following analytic detects the execution of rundll32.exe without any command line arguments.
  This behavior is identified using Endpoint Detection and Response (EDR) telemetry, focusing on process execution logs.
  It is significant because rundll32.exe typically requires command line arguments to function properly, and its absence is often associated with malicious activities, such as those performed by Cobalt Strike.
  If confirmed malicious, this activity could indicate an attempt to execute arbitrary code, potentially leading to credential dumping, unauthorized file writes, or other malicious actions.
references:
- https://attack.mitre.org/techniques/T1218/011/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.011/T1218.011.md
- https://lolbas-project.github.io/lolbas/Binaries/Rundll32/
- https://bohops.com/2018/02/26/leveraging-inf-sct-fetch-execute-techniques-for-bypass-evasion-persistence/
tags:
- attack.T1218_011
date: '2021-02-09'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '*rundll32'
    - '*rundll32.exe'
    - '*rundll32.exe\"'
  condition: selection_0
