title: Suspicious SearchProtocolHost no Command Line Arguments
id: f52d2db8-31f9-4aa7-a176-25779effe55c
status: stable
level: medium
author: Michael Haag, Splunk
description: |-
  The following analytic detects instances of searchprotocolhost.exe running without command line arguments.
  This behavior is unusual and often associated with malicious activities, such as those performed by Cobalt Strike.
  The detection leverages Endpoint Detection and Response (EDR) telemetry, focusing on process execution data.
  This activity is significant because searchprotocolhost.exe typically runs with specific arguments, and its absence may indicate an attempt to evade detection.
  If confirmed malicious, this could lead to unauthorized code execution, potential credential dumping, or other malicious actions within the environment.
references:
- https://github.com/mandiant/red_team_tool_countermeasures/blob/master/rules/PGF/supplemental/hxioc/SUSPICIOUS%20EXECUTION%20OF%20SEARCHPROTOCOLHOST%20(METHODOLOGY).ioc
tags:
- attack.T1055
date: '2021-02-23'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: searchprotocolhost.exe
  selection_1:
    OriginalFileName: searchprotocolhost.exe
  selection_2:
    CommandLine|contains:
    - '*searchprotocolhost'
    - '*searchprotocolhost.exe'
    - '*searchprotocolhost.exe\"'
  condition: selection_0 and selection_1 and selection_2
