title: Suspicious Process Executed From Container File
id: d8120352-3b62-411c-8cb6-7b47584dd5e8
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies a suspicious process executed from within common container/archive file types such as ZIP, ISO, IMG, and others. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it is a common technique used by adversaries to execute scripts or evade defenses. If
  confirmed malicious, this behavior could allow attackers to execute arbitrary code, escalate privileges, or persist within the environment, posing a significant security risk.
references:
- https://www.mandiant.com/resources/blog/tracking-evolution-gootloader-operations
- https://www.crowdstrike.com/blog/weaponizing-disk-image-files-analysis/
- https://attack.mitre.org/techniques/T1204/002/
tags:
- attack.T1204_002
- attack.T1036_008
date: '2023-07-11'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '*.ZIP\*'
    - '*.ISO\*'
    - '*.IMG\*'
    - '*.CAB\*'
    - '*.TAR\*'
    - '*.GZ\*'
    - '*.RAR\*'
    - '*.7Z\*'
  selection_1:
    action: allowed
  condition: selection_0 and selection_1
