title: Suspicious Copy on System32
id: ce633e56-25b2-11ec-9e76-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects potentially suspicious file copy operations targeting the
  System32 or SysWow64 directories as source, often indicative of malicious activity.
  It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on activity initiated by command-line tools like cmd.exe or PowerShell.
  This behavior is significant as it may indicate an attempt to evade defenses by copying
  an existing binary from the system directory and renaming it.
  If confirmed malicious, this activity could allow an attacker to execute
  code undetected and potentially leading to system compromise or further lateral movement
  within the network.
references:
- https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
- attack.T1036_003
date: '2021-10-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - sqlps.exe
    - sqltoolsps.exe
  selection_1:
    Image|contains:
    - copy.exe
    - xcopy.exe
  selection_2:
    OriginalFileName|contains:
    - copy.exe
    - xcopy.exe
  selection_3:
    CommandLine|contains:
    - '* \"C:\Windows\System32\*'
    - '* \''C:\Windows\System32\*'
    - '* C:\Windows\System32\*'
    - '* \"C:\Windows\SysWow64\*'
    - '* \''C:\Windows\SysWow64\*'
    - '* C:\Windows\SysWow64\*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
