title: Suspicious MSBuild Spawn
id: a115fba6-5514-11eb-ae93-0242ac130002
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies instances where wmiprvse.exe spawns msbuild.exe, which is unusual and indicative of potential misuse of a COM object. This detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process relationships and command-line executions. This activity is significant because msbuild.exe is typically spawned by devenv.exe during legitimate
  Visual Studio use, not by wmiprvse.exe. If confirmed malicious, this behavior could indicate an attacker executing arbitrary code or scripts, potentially leading to system compromise or further malicious
  activities.
references:
- https://lolbas-project.github.io/lolbas/Binaries/Msbuild/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1127.001/T1127.001.md
tags:
- attack.T1127_001
date: '2021-01-15'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: wmiprvse.exe
  condition: selection_0
