title: Suspicious PlistBuddy Usage via OSquery
id: 20ba6c32-c733-4a32-b64e-2688cf231399
status: experimental
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of the PlistBuddy utility on macOS to create or modify property list (.plist) files. It leverages OSQuery to monitor process events, specifically looking
  for commands that interact with LaunchAgents and set properties like RunAtLoad. This activity is significant because PlistBuddy can be used to establish persistence mechanisms, as seen in malware like
  Silver Sparrow. If confirmed malicious, this could allow an attacker to maintain persistence, execute arbitrary commands, and potentially escalate privileges on the compromised system.
references:
- https://www.marcosantadev.com/manage-plist-files-plistbuddy/
tags:
- attack.T1543_001
date: '2021-02-25'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    cmdline"|contains: '*LaunchAgents*'
  selection_1:
    cmdline"|contains: '*RunAtLoad*'
  selection_2:
    cmdline"|contains: '*true*'
  condition: selection_0 and selection_1 and selection_2
