title: Suspicious DLLHost no Command Line Arguments
id: ff61e98c-0337-4593-a78f-72a676c56f26
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances of DLLHost.exe executing without command line arguments. This behavior is unusual and often associated with malicious activities, such as those performed
  by Cobalt Strike. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. This activity is significant because DLLHost.exe typically requires
  arguments to function correctly, and its absence may indicate an attempt to evade detection. If confirmed malicious, this could lead to unauthorized actions like credential dumping or file manipulation,
  posing a severe threat to the environment.
references:
- https://raw.githubusercontent.com/threatexpress/malleable-c2/c3385e481159a759f79b8acfe11acf240893b830/jquery-c2.4.2.profile
- https://www.cobaltstrike.com/blog/learn-pipe-fitting-for-all-of-your-offense-projects/
tags:
- attack.t1055
date: '2021-02-23'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes where
  (Processes.process_name=dllhost.exe OR Processes.original_file_name=dllhost.exe)
  Processes.process IN ("*dllhost","*dllhost.exe", "*dllhost.exe\"")
  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
     Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
     Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `suspicious_dllhost_no_command_line_arguments_filter`
splunk_rule_id: ff61e98c-0337-4593-a78f-72a676c56f26
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: dllhost.exe
  selection_1:
    OriginalFileName: dllhost.exe
  selection_2:
    CommandLine|endswith:
    - dllhost
    - dllhost.exe
    - dllhost.exe\"
  condition: selection_0 and selection_1 and selection_2
