title: Suspicious Process DNS Query Known Abuse Web Services
id: 3cf0dc36-484d-11ec-a6bc-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a suspicious process making DNS queries to known, abused text-paste web services, VoIP, instant messaging, and digital distribution platforms. It leverages Sysmon
  EventID 22 logs to identify queries from processes like cmd.exe, powershell.exe, and others. This activity is significant as it may indicate an attempt to download malicious files, a common initial access
  technique. If confirmed malicious, this could lead to unauthorized code execution, data exfiltration, or further compromise of the target host.
references:
- https://urlhaus.abuse.ch/url/1798923/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.T1059_005
date: '2021-11-18'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 22
    QueryName:
    - '*pastebin*'
    - '*discord*'
    - '*api.telegram*'
    - '*t.me*'
    Image:
    - cmd.exe
    - '*powershell*'
    - pwsh.exe
    - wscript.exe
    - cscript.exe
  selection_1:
    Image|contains:
    - '*\users\public\*'
    - '*\programdata\*'
    - '*\temp\*'
    - '*\Windows\Tasks\*'
    - '*\appdata\*'
    - '*\perflogs\*'
  condition: selection_0 and selection_1
