title: Suspicious Reg exe Process
id: a6b3ab4e-dd77-4213-95fa-fc94701995e0
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic identifies instances of reg.exe being launched from a command prompt (cmd.exe) that was not initiated by the user, as indicated by a parent process other than explorer.exe.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process names. This activity is significant because reg.exe is often used in registry manipulation,
  which can be indicative of malicious behavior such as persistence mechanisms or system configuration changes. If confirmed malicious, this could allow an attacker to modify critical system settings, potentially
  leading to privilege escalation or persistent access.
references:
- https://car.mitre.org/wiki/CAR-2013-03-001/
tags:
- attack.t1112
date: '2020-04-29'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.parent_process_name != explorer.exe Processes.process_name =cmd.exe
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | search [
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
    WHERE Processes.parent_process_name=cmd.exe Processes.process_name= reg.exe
    BY Processes.parent_process_id Processes.dest Processes.process_name
  | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | rename parent_process_id as process_id
  | dedup process_id
  | table process_id dest]
  | `suspicious_reg_exe_process_filter`
splunk_rule_id: a6b3ab4e-dd77-4213-95fa-fc94701995e0
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: explorer.exe
  selection_1:
    Image: cmd.exe
  condition: selection_0 and selection_1
