title: Suspicious mshta spawn
id: 4d33a488-5b5f-11eb-ae93-0242ac130002
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the spawning of mshta.exe by wmiprvse.exe or svchost.exe. This behavior is identified using Endpoint Detection and Response (EDR) data, focusing on process creation
  events where the parent process is either wmiprvse.exe or svchost.exe. This activity is significant as it may indicate the use of a DCOM object to execute malicious scripts via mshta.exe, a common tactic
  in sophisticated attacks. If confirmed malicious, this could allow an attacker to execute arbitrary code, potentially leading to system compromise and further malicious activities.
references:
- https://codewhitesec.blogspot.com/2018/07/lethalhta.html
- https://github.com/redcanaryco/AtomicTestHarnesses
- https://redcanary.com/blog/introducing-atomictestharnesses/
tags:
- attack.T1218_005
date: '2021-01-20'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: svchost.exe
  selection_1:
    ParentImage: wmiprvse.exe
  condition: selection_0 and selection_1
