title: Suspicious DLLHost no Command Line Arguments
id: ff61e98c-0337-4593-a78f-72a676c56f26
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances of DLLHost.exe executing without command line arguments. This behavior is unusual and often associated with malicious activities, such as those performed
  by Cobalt Strike. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. This activity is significant because DLLHost.exe typically requires
  arguments to function correctly, and its absence may indicate an attempt to evade detection. If confirmed malicious, this could lead to unauthorized actions like credential dumping or file manipulation,
  posing a severe threat to the environment.
references:
- https://raw.githubusercontent.com/threatexpress/malleable-c2/c3385e481159a759f79b8acfe11acf240893b830/jquery-c2.4.2.profile
- https://www.cobaltstrike.com/blog/learn-pipe-fitting-for-all-of-your-offense-projects/
tags:
- attack.T1055
date: '2021-02-23'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: dllhost.exe
  selection_1:
    OriginalFileName: dllhost.exe
  selection_2:
    CommandLine|contains:
    - '*dllhost'
    - '*dllhost.exe'
    - '*dllhost.exe\"'
  condition: selection_0 and selection_1 and selection_2
