title: Suspicious writes to windows Recycle Bin
id: b5541828-8ffd-4070-9d95-b3da4de924cb
status: stable
level: medium
author: Rico Valdez, Splunk
description: The following analytic detects when a process other than explorer.exe writes to the Windows Recycle Bin. It leverages the Endpoint.Filesystem and Endpoint.Processes data models in Splunk to
  identify any process writing to the "*$Recycle.Bin*" file path, excluding explorer.exe. This activity is significant because it may indicate an attacker attempting to hide their actions, potentially leading
  to data theft, ransomware, or other malicious outcomes. If confirmed malicious, this behavior could allow an attacker to persist in the environment and evade detection by security tools.
tags:
- attack.T1036
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    TargetFilename|contains: '*$Recycle.Bin*'
  condition: selection_0
