title: Suspicious Reg exe Process
id: a6b3ab4e-dd77-4213-95fa-fc94701995e0
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic identifies instances of reg.exe being launched from a command prompt (cmd.exe) that was not initiated by the user, as indicated by a parent process other than explorer.exe.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process names. This activity is significant because reg.exe is often used in registry manipulation,
  which can be indicative of malicious behavior such as persistence mechanisms or system configuration changes. If confirmed malicious, this could allow an attacker to modify critical system settings, potentially
  leading to privilege escalation or persistent access.
references:
- https://car.mitre.org/wiki/CAR-2013-03-001/
tags:
- attack.T1112
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: explorer.exe
  selection_1:
    Image: cmd.exe
  condition: selection_0 and selection_1
