title: Suspicious mshta child process
id: 60023bb6-5500-11eb-ae93-0242ac130002
status: stable
level: medium
author: Michael Haag, Teoderick Contreras Splunk
description: The following analytic identifies child processes spawned from "mshta.exe". It leverages data from Endpoint Detection and Response (EDR) agents, focusing on specific child processes like "powershell.exe"
  and "cmd.exe". This activity is significant because "mshta.exe" is often exploited by attackers to execute malicious scripts or commands. If confirmed malicious, this behavior could allow an attacker
  to execute arbitrary code, escalate privileges, or maintain persistence within the environment. Monitoring this activity helps in early detection of potential threats leveraging "mshta.exe" for malicious
  purposes.
references:
- https://github.com/redcanaryco/AtomicTestHarnesses
- https://redcanary.com/blog/introducing-atomictestharnesses/
tags:
- attack.T1218_005
date: '2021-01-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: mshta.exe
  selection_1:
    Image|contains:
    - powershell.exe
    - colorcpl.exe
    - msbuild.exe
    - microsoft.workflow.compiler.exe
    - searchprotocolhost.exe
    - scrcons.exe
    - cscript.exe
    - wscript.exe
    - cmd.exe
    - bitsadmin.exe
  condition: selection_0 and selection_1
