title: Suspicious PlistBuddy Usage
id: c3194009-e0eb-4f84-87a9-4070f8688f00
status: experimental
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies the use of the native macOS utility, PlistBuddy, to create or modify property list (.plist) files. This detection leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process names and command-line executions involving PlistBuddy. This activity is significant because PlistBuddy can be used to establish persistence by modifying LaunchAgents,
  as seen in the Silver Sparrow malware. If confirmed malicious, this could allow an attacker to maintain persistence, execute arbitrary commands, and potentially escalate privileges on the compromised
  macOS system.
references:
- https://www.marcosantadev.com/manage-plist-files-plistbuddy/
tags:
- attack.t1543.001
date: '2021-02-25'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name=PlistBuddy (Processes.process=*LaunchAgents*
      OR
      Processes.process=*RunAtLoad*
      OR
      Processes.process=*true*)
    BY Processes.dest Processes.user Processes.parent_process
       Processes.process_name Processes.process Processes.process_id
       Processes.parent_process_id
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `suspicious_plistbuddy_usage_filter`
splunk_rule_id: c3194009-e0eb-4f84-87a9-4070f8688f00
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: PlistBuddy
  selection_1:
    CommandLine|contains: LaunchAgents
  selection_2:
    CommandLine|contains: RunAtLoad
  selection_3:
    CommandLine|contains: 'true'
  condition: selection_0 and selection_1 and selection_2 and selection_3
