title: System Info Gathering Using Dxdiag Application
id: f92d74f2-4921-11ec-b685-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the execution of the dxdiag.exe process with specific command-line arguments, which is used to gather system information. This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process creation events and command-line details. This activity is significant because dxdiag.exe is rarely used in corporate environments and
  its execution may indicate reconnaissance efforts by malicious actors. If confirmed malicious, this activity could allow attackers to collect detailed system information, aiding in further exploitation
  or lateral movement within the network.
references:
- https://app.any.run/tasks/df0baf9f-8baf-4c32-a452-16562ecb19be/
tags:
- attack.t1592
date: '2021-11-19'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  (Processes.process_name=dxdiag.exe OR Processes.original_file_name=dxdiag.exe)
  Processes.process = "* /t *"
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `system_info_gathering_using_dxdiag_application_filter`
splunk_rule_id: f92d74f2-4921-11ec-b685-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: dxdiag.exe
  selection_1:
    OriginalFileName: dxdiag.exe
  selection_2:
    CommandLine|contains: ' /t '
  condition: selection_0 and selection_1 and selection_2
