title: System User Discovery With Whoami
id: 894fc43e-6f50-47d5-a68b-ee9ee23e18f4
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the execution of `whoami.exe` without any arguments. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs.
  This activity is significant because both Red Teams and adversaries use `whoami.exe` to identify the current logged-in user, aiding in situational awareness and Active Directory discovery. If confirmed
  malicious, this behavior could indicate an attacker is gathering information to further compromise the system, potentially leading to privilege escalation or lateral movement within the network.
references:
- https://attack.mitre.org/techniques/T1033/
tags:
- attack.T1033
date: '2021-08-24'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: whoami.exe
  selection_1:
    process_original_file_name: whoami.exe
  condition: selection_0 and selection_1
