title: System Processes Run From Unexpected Locations
id: a34aae96-ccf8-4aef-952c-3ea21444444d
status: stable
level: medium
author: David Dorsey, Michael Haag, Nasreddine Bencherchali, Splunk
description: The following analytic identifies system processes running from unexpected locations outside of paths such as `C:\Windows\System32\` or `C:\Windows\SysWOW64`. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process paths, names, and hashes. This activity is significant as it may indicate a malicious process attempting to masquerade as a legitimate system process.
  If confirmed malicious, this behavior could allow an attacker to execute code, escalate privileges, or maintain persistence within the environment, posing a significant security risk.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1036.003/T1036.003.yaml
- https://attack.mitre.org/techniques/T1036/003/
tags:
- attack.T1036_003
date: '2019-10-16'
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    Image:
    - '*:\$WINDOWS.~BT\*'
    - '*:\$WinREAgent\*'
    - '*:\Program Files \(x86\)\Windows Kits\10\App Certification Kit\*'
    - '*:\Windows\SoftwareDistribution\*'
    - '*:\Windows\System32\*'
    - '*:\Windows\SystemTemp\*'
    - '*:\Windows\SysWOW64\*'
    - '*:\Windows\uus\*'
    - '*:\Windows\WinSxS\*'
  condition: filter_0
