title: UAC Bypass MMC Load Unsigned Dll
id: 7f04349c-e30d-11eb-bc7f-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the loading of an unsigned DLL by the MMC.exe application, which is indicative of a potential UAC bypass or privilege escalation attempt. It leverages Sysmon
  EventCode 7 to identify instances where MMC.exe loads a non-Microsoft, unsigned DLL. This activity is significant because attackers often use this technique to modify CLSID registry entries, causing MMC.exe
  to load malicious DLLs, thereby bypassing User Account Control (UAC) and gaining elevated privileges. If confirmed malicious, this could allow an attacker to execute arbitrary code with higher privileges,
  leading to further system compromise and persistence.
references:
- https://offsec.almond.consulting/UAC-bypass-dotnet.html
tags:
- attack.T1218_014
- attack.T1548_002
date: '2021-07-12'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains: '*.dll'
  selection_2:
    Image|contains: '*\mmc.exe'
  selection_3:
    Signed: 'false'
  selection_4:
    Company: Microsoft Corporation
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
