title: Uninstall App Using MsiExec
id: 1fca2b28-f922-11eb-b2dd-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the uninstallation of applications using msiexec with specific command-line arguments. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on process execution logs that include command-line details. This activity is significant because it is an uncommon practice in enterprise environments and has been associated with malicious behavior,
  such as disabling antivirus software. If confirmed malicious, this could allow an attacker to remove security software, potentially leading to further compromise and persistence within the network.
references:
- https://threadreaderapp.com/thread/1423361119926816776.html
tags:
- attack.t1218.007
date: '2021-08-09'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name=msiexec.exe Processes.process= "* /qn *" Processes.process= "*/X*" Processes.process= "*REBOOT=*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `uninstall_app_using_msiexec_filter`
splunk_rule_id: 1fca2b28-f922-11eb-b2dd-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: msiexec.exe
  selection_1:
    CommandLine|contains: ' /qn '
  selection_2:
    CommandLine|contains: /X
  selection_3:
    CommandLine|contains: REBOOT=
  condition: selection_0 and selection_1 and selection_2 and selection_3
