title: Unload Sysmon Filter Driver
id: e5928ff3-23eb-4d8b-b8a4-dcbc844fdfbe
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the use of `fltMC.exe` to unload the Sysmon driver, which stops Sysmon from collecting data. It leverages Endpoint Detection and Response (EDR) logs, focusing
  on process names and command-line executions. This activity is significant because disabling Sysmon can blind security monitoring, allowing malicious actions to go undetected. If confirmed malicious,
  this could enable attackers to execute further attacks without being logged, leading to potential data breaches, privilege escalation, or persistent access within the environment.
references:
- https://www.ired.team/offensive-security/defense-evasion/unloading-sysmon-driver
tags:
- attack.t1685
date: '2019-10-16'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime values(Processes.process) as process max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name=fltMC.exe
      AND
      Processes.process=*unload*
      AND
      Processes.process=*SysmonDrv*
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | table firstTime lastTime dest user count process_name process_id parent_process_name process
  | `unload_sysmon_filter_driver_filter`
splunk_rule_id: e5928ff3-23eb-4d8b-b8a4-dcbc844fdfbe
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: fltMC.exe
  selection_1:
    CommandLine|contains: unload
  selection_2:
    CommandLine|contains: SysmonDrv
  condition: selection_0 and selection_1 and selection_2
