title: USN Journal Deletion
id: b6e0ff70-b122-4227-9368-4cf322ab43c3
status: stable
level: medium
author: David Dorsey, Splunk
description: The following analytic detects the deletion of the USN Journal using the fsutil.exe utility. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution
  logs that include command-line details. This activity is significant because the USN Journal maintains a log of all changes made to files on the disk, and its deletion can be an indicator of an attempt
  to cover tracks or hinder forensic investigations. If confirmed malicious, this action could allow an attacker to obscure their activities, making it difficult to trace file modifications and potentially
  compromising incident response efforts.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/fsutil-usn
tags:
- attack.t1070
date: '2020-04-29'
original_spl: |-
  | tstats `security_content_summariesonly`
    count values(Processes.process) as process
          values(Processes.parent_process) as parent_process
          min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.process_name=fsutil.exe
  Processes.process = "*usn*"
  Processes.process = "*deletejournal*"

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
     Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `usn_journal_deletion_filter`
splunk_rule_id: b6e0ff70-b122-4227-9368-4cf322ab43c3
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: fsutil.exe
  selection_1:
    CommandLine|contains: usn
  selection_2:
    CommandLine|contains: deletejournal
  condition: selection_0 and selection_1 and selection_2
