title: Vbscript Execution Using Wscript App
id: 35159940-228f-11ec-8a49-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of VBScript using the wscript.exe application. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and command-line
  telemetry. This activity is significant because wscript.exe is typically not used to execute VBScript, which is usually associated with cscript.exe. This deviation can indicate an attempt to evade traditional
  process monitoring and antivirus defenses. If confirmed malicious, this technique could allow attackers to execute arbitrary code, potentially leading to system compromise, data exfiltration, or further
  lateral movement within the network.
references:
- https://www.joesandbox.com/analysis/369332/0/html
- https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
tags:
- attack.T1059_005
date: '2021-09-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: wscript.exe
    ParentCommandLine|contains: '*//e:vbscript*'
  selection_1:
    Image: wscript.exe
    CommandLine|contains: '*//e:vbscript*'
  condition: selection_0 and selection_1
