title: Verclsid CLSID Execution
id: 61e9a56a-20fa-11ec-8ba3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the potential abuse of the verclsid.exe utility to execute malicious files via generated CLSIDs. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on specific command-line patterns associated with verclsid.exe. This activity is significant because verclsid.exe is a legitimate Windows application used to verify CLSID COM objects,
  and its misuse can indicate an attempt to bypass security controls. If confirmed malicious, this technique could allow an attacker to execute arbitrary code, potentially leading to system compromise or
  further malicious activities.
references:
- https://gist.github.com/NickTyrer/0598b60112eaafe6d07789f7964290d5
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
tags:
- attack.t1218.012
date: '2021-09-29'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as process
  values(Processes.parent_process) as parent_process values(Processes.process_id)
  as process_id count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where
  (Processes.process_name="verclsid.exe" OR Processes.original_file_name="verclsid.exe")
  Processes.process="*/S*"
  Processes.process="*/C*"
  Processes.process="*{*"
  Processes.process="*}*"
  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
     Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
     Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `verclsid_clsid_execution_filter`
splunk_rule_id: 61e9a56a-20fa-11ec-8ba3-acde48001122
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: verclsid.exe
  selection_1:
    OriginalFileName: verclsid.exe
  selection_2:
    CommandLine|contains: /S
  selection_3:
    CommandLine|contains: /C
  selection_4:
    CommandLine|contains: '{'
  selection_5:
    CommandLine|contains: '}'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5
