title: Wbemprox COM Object Execution
id: 9d911ce0-c3be-11eb-b177-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a suspicious process loading a COM object from wbemprox.dll, fastprox.dll, or wbemcomn.dll. It leverages Sysmon EventCode 7 to identify instances where these
  DLLs are loaded by processes not typically associated with them, excluding known legitimate processes and directories. This activity is significant as it may indicate an attempt by threat actors to abuse
  COM objects for privilege escalation or evasion of detection mechanisms. If confirmed malicious, this could allow attackers to gain elevated privileges or maintain persistence within the environment,
  posing a significant security risk.
references:
- https://krebsonsecurity.com/2021/05/a-closer-look-at-the-darkside-ransomware-gang/
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/mcafee-atr-analyzes-sodinokibi-aka-revil-ransomware-as-a-service-what-the-code-tells-us/
tags:
- attack.T1218_003
date: '2021-06-04'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains:
    - '*\fastprox.dll'
    - '*\wbemprox.dll'
    - '*\wbemcomn.dll'
  filter_2:
    Image:
    - wmiprvse.exe
    - WmiApSrv.exe
    - unsecapp.exe
  filter_3:
    Image:
    - '*\windows\*'
    - '*\program files*'
    - '*\wbem\*'
  condition: (selection_0 and selection_1) and not (filter_2 and filter_3)
