title: Web Servers Executing Suspicious Processes
id: ec3b7601-689a-4463-94e0-c9f45638efb9
status: experimental
level: medium
author: David Dorsey, Splunk
description: The following analytic detects the execution of suspicious processes on systems identified as web servers. It leverages the Splunk data model "Endpoint.Processes" to search for specific process
  names such as "whoami", "ping", "iptables", "wget", "service", and "curl". This activity is significant because these processes are often used by attackers for reconnaissance, persistence, or data exfiltration.
  If confirmed malicious, this could lead to data theft, deployment of additional malware, or even ransomware attacks. Immediate investigation is required to determine the legitimacy of the activity and
  mitigate potential threats.
tags:
- attack.T1082
date: '2019-10-16'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    dest_category: web_server
  condition: selection_0
