title: Wermgr Process Connecting To IP Check Web Services
id: ed313326-a0f9-11eb-a89c-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: The following analytic detects the wermgr.exe process attempting to connect to known IP check web services. It leverages Sysmon EventCode 22 to identify DNS queries made by wermgr.exe to specific
  IP check services. This activity is significant because wermgr.exe is typically used for Windows error reporting, and its connection to these services may indicate malicious code injection, often associated
  with malware like Trickbot. If confirmed malicious, this behavior could allow attackers to recon the infected machine's IP address, aiding in further exploitation and evasion tactics.
references:
- https://labs.vipre.com/trickbot-and-its-modules/
- https://whitehat.eu/incident-response-case-study-featuring-ryuk-and-trickbot-part-2/
tags:
- attack.T1590_005
date: '2021-04-26'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 22
  selection_1:
    Image: wermgr.exe
  selection_2:
    QueryName|contains:
    - '*wtfismyip.com'
    - '*checkip.amazonaws.com'
    - '*ipecho.net'
    - '*ipinfo.io'
    - '*api.ipify.org'
    - '*icanhazip.com'
    - '*ip.anysrc.com'
    - '*api.ip.sb'
    - ident.me
    - www.myexternalip.com
    - '*zen.spamhaus.org'
    - '*cbl.abuseat.org'
    - '*b.barracudacentral.org'
    - '*dnsbl-1.uceprotect.net'
    - '*spam.dnsbl.sorbs.net'
  condition: selection_0 and selection_1 and selection_2
