title: Windows Crowdstrike RTR Script Execution
id: be2bbfff-77c9-4d65-9b7c-97726051534a
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects usage of Crowdstrike Real Time Response (RTR) to execute a "runscript" command.
  This can be used by malicious actors with access to the Crowdstrike Dashboard to execute commands on remote managed hosts.
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications
tags:
- attack.t1059.001
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.parent_process_name="dllhost.exe"
  Processes.parent_process="*/Processid:{BD07DDB9-1C61-4DCE-9202-A2BA1757CDB2}*"
  Processes.process_name="powershell.exe"
  Processes.process="* -Version 5.1 -s -NoLogo -NoProfile -EncodedCommand*"

  by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name Processes.parent_process
     Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_crowdstrike_rtr_script_execution_filter`
splunk_rule_id: be2bbfff-77c9-4d65-9b7c-97726051534a
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: dllhost.exe
  selection_1:
    ParentCommandLine|contains: /Processid:{BD07DDB9-1C61-4DCE-9202-A2BA1757CDB2}
  selection_2:
    Image: powershell.exe
  selection_3:
    CommandLine|contains: ' -Version 5.1 -s -NoLogo -NoProfile -EncodedCommand'
  condition: selection_0 and selection_1 and selection_2 and selection_3
