title: Windows App Layer Protocol Wermgr Connect To NamedPipe
id: 2f3a4092-548b-421c-9caa-84918e1787ef
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the wermgr.exe process creating or connecting to a named pipe. It leverages Sysmon EventCodes 17 and 18 to identify these actions. This activity is significant
  because wermgr.exe, a legitimate Windows OS Problem Reporting application, is often abused by malware such as Trickbot and Qakbot to execute malicious code. If confirmed malicious, this behavior could
  indicate that an attacker has injected code into wermgr.exe, potentially allowing them to communicate covertly, escalate privileges, or persist within the environment.
references:
- https://strontic.github.io/xcyclopedia/library/wermgr.exe-0F652BF7ADA772981E8AAB0D108FCC92.html
- https://www.trellix.com/en-us/about/newsroom/stories/research/demystifying-qbot-malware.html
tags:
- attack.T1071
date: '2022-10-28'
logsource:
  product: windows
  service: sysmon
detection:
  selection_1:
    Image|contains: '*\wermgr.exe'
  selection_2:
    EventType|contains:
    - CreatePipe
    - ConnectPipe
  condition: selection_1 and selection_2
