title: Windows Wmic Systeminfo Discovery
id: 97937ece-cb13-4dbc-9684-c0dc3afd400a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of Windows Management Instrumentation Command-line (WMIC) commands used for computer system discovery on a Windows system. Specifically, it monitors
  for commands such as “wmic computersystem” that retrieve detailed information about the computer’s model, manufacturer, name, domain, and other system attributes. While these commands are commonly used
  by administrators for inventory and troubleshooting, they may also be exploited by adversaries to gain insight into the target environment during the reconnaissance phase of an attack. Identifying and
  alerting on WMIC computer system queries helps security teams recognize unauthorized information gathering and take steps to mitigate potential threats.
references:
- https://cert.gov.ua/article/6284730
tags:
- attack.T1082
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '* computersystem*'
  condition: selection_0
