title: Windows Archive Collected Data via Rar
id: 2015de95-fe91-413d-9d62-2fe011b67e82
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the execution of RAR utilities to archive files on a system. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names,
  GUIDs, and command-line arguments. This activity is significant as threat actors, including red-teamers and malware like DarkGate, use RAR archiving to compress and exfiltrate collected data from compromised
  hosts. If confirmed malicious, this behavior could lead to the unauthorized transfer of sensitive information to command and control servers, posing a severe risk to data confidentiality and integrity.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
tags:
- attack.T1560_001
date: '2022-12-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: Rar.exe
  selection_1:
    OriginalFileName: Rar.exe
    CommandLine|contains: '*a*'
  condition: selection_0 and selection_1
