title: Windows Account Access Removal via Logoff Exec
id: 223572ab-8768-4e20-9b39-c38707af80dc
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the process of logging off a user through the use of the quser and logoff commands. By monitoring for these commands, the analytic identifies actions where a
  user session is forcibly terminated, which could be part of an administrative task or a potentially unauthorized access attempt. This detection helps identify potential misuse or malicious activity where
  a user’s access is revoked without proper authorization, providing insight into potential security incidents involving account management or session manipulation.
references:
- https://devblogs.microsoft.com/scripting/automating-quser-through-powershell/
tags:
- attack.t1059.001
- attack.t1531
date: '2024-12-13'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name = logoff.exe Processes.parent_process_name IN ("cmd.exe", "powershell.exe", "pwsh.exe")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_account_access_removal_via_logoff_exec_filter`
splunk_rule_id: 223572ab-8768-4e20-9b39-c38707af80dc
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: logoff.exe
  selection_1:
    ParentImage:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
  condition: selection_0 and selection_1
