title: Windows Compatibility Telemetry Suspicious Child Process
id: 56fe46ca-ffef-46fe-8f0e-5cd4b7b4cc0c
status: stable
level: medium
author: Steven Dick
description: The following analytic detects the execution of CompatTelRunner.exe with parameters indicative of a process not part of the normal "Microsoft Compatibility Appraiser" telemetry collection.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names, parent processes, and command-line arguments. This activity is significant because CompatTelRunner.exe and
  the "Microsoft Compatibility Appraiser" task always run as System and can be used to elevate privileges or establish a highly privileged persistence mechanism. If confirmed malicious, this could enable
  unauthorized code execution, privilege escalation, or persistent access to the compromised system.
references:
- https://attack.mitre.org/techniques/T1546/
- https://scythe.io/threat-thursday/windows-telemetry-persistence
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence
tags:
- attack.T1546
- attack.T1053_005
date: '2025-02-13'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: CompatTelRunner.exe
  selection_1:
    CommandLine|contains: '* -cv:*'
  filter_2:
    CommandLine: '* -m:*'
  condition: (selection_0 and selection_1) and not (filter_2)
