title: Windows Indirect Command Execution Via forfiles
id: 1fdf31c9-ff4d-4c48-b799-0e8666e08787
status: stable
level: medium
author: Eric McGinnis, Splunk
description: The following analytic detects the execution of programs initiated by forfiles.exe. This command is typically used to run commands on multiple files, often within batch scripts. The detection
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where forfiles.exe is the parent process. This activity is significant because forfiles.exe can be
  exploited to bypass command line execution protections, making it a potential vector for malicious activity. If confirmed malicious, this could allow attackers to execute arbitrary commands, potentially
  leading to unauthorized access or further system compromise.
references:
- https://twitter.com/KyleHanslovan/status/912659279806640128
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/forfiles
tags:
- attack.T1202
date: '2022-03-04'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentCommandLine|contains: '*forfiles* /c *'
  condition: selection_0
