title: Windows PsTools Recon Usage
id: 9a5f4b3e-1d2b-4c6f-9a8e-3b7d2f5c1a6e
status: stable
level: medium
author: Nasreddine Bencherchali
description: |
  The following analytic identifies execution of Sysinternals PsTools and Sysinternals Suit binaries that are commonly used for reconnaissance and information gathering on
  Windows endpoints.
  PsTools (PsExec, PsFile, PsGetSid, PsInfo, PsPing, etc.) or Sysinternals Suit tools, are frequently used by administrators for legitimate maintenance but are also leveraged by threat actors to collect system, account, network and service information during discovery and lateral movement.
  This detection focuses on process execution and PE metadata telemetry (OriginalFileName).
  If confirmed malicious, this activity can indicate targeted reconnaissance and foothold escalation, enabling subsequent lateral movement or credential abuse.
references:
- https://learn.microsoft.com/sysinternals/downloads/pstools
- https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.09.17.Operation_Iron_Tiger/wp-operation-iron-tiger.pdf
- https://go.crowdstrike.com/rs/281-OBQ-266/images/Report2018OverwatchReport.pdf
tags:
- attack.t1082
- attack.t1046
- attack.t1018
date: '2025-10-24'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

    from datamodel=Endpoint.Processes where

    Processes.process_name IN (
        "PsGetsid.exe",
        "PsGetsid64.exe",
        "PsInfo.exe",
        "PsInfo64.exe",
        "pslist.exe",
        "pslist64.exe",
        "PsLoggedon.exe",
        "PsLoggedon64.exe",
        "psloglist.exe",
        "psloglist64.exe",
        "PsPing.exe",
        "PsPing64.exe",
        "PsService.exe",
        "PsService64.exe",
        "Tcpvcon.exe",
        "Tcpvcon64.exe",
        "Tcpvcon64a.exe"
    )
    OR
    Processes.original_file_name IN (
        "PsGetSid.exe",
        "Psinfo.exe",
        "pslist.exe",
        "psloggedon.exe",
        "psloglist.exe",
        "psping.exe",
        "psservice.exe",
        "Tcpvcon.exe"
    )

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
     Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user Processes.user_id
     Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_pstools_recon_usage_filter`
splunk_rule_id: 9a5f4b3e-1d2b-4c6f-9a8e-3b7d2f5c1a6e
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image:
    - PsGetsid.exe
    - PsGetsid64.exe
    - PsInfo.exe
    - PsInfo64.exe
    - pslist.exe
    - pslist64.exe
    - PsLoggedon.exe
    - PsLoggedon64.exe
    - psloglist.exe
    - psloglist64.exe
    - PsPing.exe
    - PsPing64.exe
    - PsService.exe
    - PsService64.exe
    - Tcpvcon.exe
    - Tcpvcon64.exe
    - Tcpvcon64a.exe
  selection_1:
    OriginalFileName:
    - PsGetSid.exe
    - Psinfo.exe
    - pslist.exe
    - psloggedon.exe
    - psloglist.exe
    - psping.exe
    - psservice.exe
    - Tcpvcon.exe
  condition: selection_0 and selection_1
