title: Windows Potential Cloudflared Tunnel Execution
id: 2e29b58e-0f5a-42fc-b435-0fdce8862831
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects command-line arguments associated with the cloudflared client used to create Cloudflare tunnels.
  Cloudflared is functionally very similar to ngrok, an ingress-as-a-service tool.
  Cloudflared reaches out to the Cloudflare Edge Servers, creating an outbound connection over HTTPS(HTTP2/QUIC), where the tunnel's controller makes services or private networks accessible.
references:
- https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
- https://github.com/cloudflare/cloudflared
- https://www-bleepingcomputer-com.cdn.ampproject.org/c/s/www.bleepingcomputer.com/news/security/hackers-increasingly-abuse-cloudflare-tunnels-for-stealthy-connections/amp/
tags:
- attack.T1572
date: '2026-05-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*tunnel*'
  selection_1:
    CommandLine|contains: '*run*'
  selection_2:
    CommandLine|contains: '*--url*'
  condition: selection_0 and selection_1 and selection_2
