title: Windows TOR Client Execution
id: f164bc6f-ecbe-45e0-aaa6-f5c4d8c84b9a
status: stable
level: medium
author: Vignesh Subramanian, Splunk
description: |
  The following analytic detects the execution of the TOR Browser and related TOR components on Windows endpoints by monitoring process creation activity.
  Adversaries and insider threats leverage TOR to anonymize command-and-control traffic, facilitate data exfiltration, and evade network monitoring and policy enforcement.
  While TOR can be used for legitimate research and privacy purposes, its presence on enterprise endpoints is often unusual and should be investigated to determine intent, scope, and any associated malicious behavior.
references:
- https://unit42.paloaltonetworks.com/tor-traffic-enterprise-networks/
- https://attack.mitre.org/software/S0183/
- https://attack.mitre.org/techniques/T1090/003/
tags:
- attack.T1090_003
date: '2026-02-02'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: tor.exe
  selection_1:
    Image|contains: '*\BraveSoftware\Brave-Browser*'
  condition: selection_0 and selection_1
