title: Windows Entra User Management Via Azure CLI
id: f6332409-abeb-42f8-b6a7-76201bdc7a0a
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects the usage of the Azure CLI to interact with user accounts such as creating or deleting a user.
  Adversaries create new users so that their malicious activity does not interrupt the normal functions of the compromised users and can remain undetected.
  While legitimate administrative use is expected, anomalous execution patterns, unexpected users, or unusual parent processes should be treated as potential indicators of compromise and investigated promptly.
references:
- https://atomicredteam.io/persistence/T1136.003/#atomic-test-3---azure-ad---create-a-new-user-via-azure-cli
- https://learn.microsoft.com/en-us/cli/azure/?view=azure-cli-latest
tags:
- attack.T1136
- attack.T1078_004
- attack.T1098
date: '2026-05-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '*az.cmd*'
    - '*azure.cli*'
  selection_1:
    CommandLine|contains: '*ad *'
  selection_2:
    CommandLine|contains: '* user*'
  condition: selection_0 and selection_1 and selection_2
