title: Windows Process Executed From Removable Media
id: b483804a-4cc0-49a4-9f00-ac29ba844d08
status: stable
level: medium
author: Steven Dick
description: This analytic is used to identify when a removable media device is attached to a machine and then a process is executed from the same drive letter assigned to the removable media device. Adversaries
  and Insider Threats may use removable media devices for several malicious activities, including initial access, execution, and exfiltration.
references:
- https://attack.mitre.org/techniques/T1200/
- https://www.cisa.gov/news-events/news/using-caution-usb-drives
- https://www.bleepingcomputer.com/news/security/fbi-hackers-use-badusb-to-target-defense-firms-with-ransomware/
tags:
- attack.t1200
- attack.t1025
- attack.t1091
date: '2025-01-17'
original_spl: |-
  | tstats `security_content_summariesonly` count values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_current_directory=*
      AND
      NOT Processes.process_current_directory IN ("C:\\*","*\\sysvol\\*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product Processes.process_current_directory
  | `drop_dm_object_name(Processes)`
  | rex field=process_current_directory "^(?<object_handle>[^\\\]+\\\)"
  | where isnotnull(object_handle)
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | join dest,object_handle
  [
  | tstats `security_content_summariesonly` count values(Registry.action) as action values(Registry.process_guid) as process_guid values(Registry.process_id) as process_id values(Registry.registry_hive) as registry_hive values(Registry.registry_key_name) as registry_key_name values(Registry.registry_value_name) as registry_value_name values(Registry.registry_value_type) as registry_value_type values(Registry.status) as status values(Registry.user) as user values(Registry.vendor_product) as vendor_product FROM datamodel=Endpoint.Registry
    WHERE Registry.registry_value_data="*:\\*"
      AND
      Registry.registry_path="*USBSTOR*"
      AND
      Registry.registry_path IN ("HKLM\\SOFTWARE\\Microsoft\\Windows Portable Devices\\Devices\\*","HKLM\\System\\CurrentControlSet\\Enum\\SWD\\WPDBUSENUM\\*")
    BY Registry.dest,Registry.registry_value_data, Registry.registry_path
  | `drop_dm_object_name(Registry)`
  | eval object_handle = registry_value_data, object_name = replace(mvindex(split(mvindex(split(registry_path, "??"),1),"&"),2),"PROD_","")
      ]
  | `windows_process_executed_from_removable_media_filter`
splunk_rule_id: b483804a-4cc0-49a4-9f00-ac29ba844d08
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Processes.process_current_directory|contains: ''
  filter_1:
    Processes.process_current_directory:
    - C:\*
    - '*\sysvol\*'
  condition: (selection_0) and not (filter_1)
