title: Windows SQL Spawning CertUtil
id: dfc18a5a-946e-44ee-a373-c0f60d06e676
status: experimental
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of certutil to download software, specifically when spawned by SQL-related processes. This detection leverages Endpoint Detection and Response (EDR) data,
  focusing on command-line executions involving certutil with parameters like *urlcache* and *split*. This activity is significant as it may indicate a compromise by threat actors, such as Flax Typhoon,
  who use certutil to establish persistent VPN connections. If confirmed malicious, this behavior could allow attackers to maintain access, monitor system availability, and potentially escalate to data
  theft or ransomware deployment.
references:
- https://www.microsoft.com/en-us/security/blog/2023/08/24/flax-typhoon-using-legitimate-software-to-quietly-access-taiwanese-organizations/
tags:
- attack.T1105
date: '2023-08-25'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - sqlservr.exe
    - sqlagent.exe
    - sqlps.exe
    - launchpad.exe
    - sqldumper.exe
  selection_1:
    CommandLine|contains: '*urlcache*'
  selection_2:
    CommandLine|contains: '*verifyctl*'
  condition: selection_0 and selection_1 and selection_2
