title: Windows Privilege Escalation Suspicious Process Elevation
id: 6a80300a-9f8a-4f22-bd3e-09ca577cfdfc
status: stable
level: medium
author: Steven Dick
description: |
  The following analytic detects when a process running with low or medium integrity from a user account spawns an elevated process with high or system integrity in suspicious locations.
  This behavior is identified using process execution data from Windows process monitoring.
  This activity is significant as it may indicate a threat actor successfully elevating privileges, which is a common tactic in advanced attacks.
  If confirmed malicious, this could allow the attacker to execute code with higher privileges, potentially leading to full system compromise and persistent access.
references:
- https://attack.mitre.org/techniques/T1068/
- https://vuls.cert.org/confluence/display/Wiki/2021/06/21/Finding+Privilege+Escalation+Vulnerabilities+in+Windows+using+Process+Monitor
- https://redcanary.com/blog/getsystem-offsec/
- https://atomicredteam.io/privilege-escalation/T1134.001/
tags:
- attack.T1068
- attack.T1548
- attack.T1134
date: '2024-02-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    IntegrityLevel|contains:
    - low
    - medium
    - high
  filter_1:
    User:
    - '*SYSTEM'
    - '*LOCAL SERVICE'
    - '*NETWORK SERVICE'
    - DWM-*
    - '*$'
  condition: (selection_0) and not (filter_1)
