title: Windows System Network Config Discovery Display DNS
id: e24f0a0e-41a9-419f-9999-eacab15efc36
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the execution of the "ipconfig /displaydns" command, which retrieves DNS reply information using the built-in Windows tool IPConfig. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process command-line executions. Monitoring this activity is significant as threat actors and post-exploitation tools like WINPEAS often
  abuse this command to gather network information. If confirmed malicious, this activity could allow attackers to map the network, identify DNS servers, and potentially facilitate further network-based
  attacks or lateral movement.
references:
- https://superuser.com/questions/230308/explain-output-of-ipconfig-displaydns
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
- attack.T1016
date: '2022-12-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: ipconfig.exe
  selection_1:
    OriginalFileName: ipconfig.exe
    CommandLine|contains: '*/displaydns*'
  condition: selection_0 and selection_1
