title: Windows Credential Target Information Structure in Commandline
id: f79c5d7a-dd99-4263-93e1-49ace5634c82
status: stable
level: medium
author: Raven Tait, Splunk
description: Detects DNS-based Kerberos coercion attacks where adversaries inject marshaled credential structures into DNS records to spoof SPNs and redirect authentication such as in CVE-2025-33073. This
  detection leverages process creation events looking for specific CREDENTIAL_TARGET_INFORMATION structures.
references:
- https://web.archive.org/web/20250617122747/https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx
- https://www.guidepointsecurity.com/blog/the-birth-and-death-of-loopyticket/
tags:
- attack.T1557_001
- attack.T1187
- attack.T1071_004
date: '2021-12-08'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*1UWhRCA*'
  selection_1:
    CommandLine|contains: '*AAAAA*'
  selection_2:
    CommandLine|contains: '*YBAAAA*'
  condition: selection_0 and selection_1 and selection_2
