title: Windows UAC Bypass Suspicious Escalation Behavior
id: 00d050d3-a5b4-4565-a6a5-a31f69681dc3
status: stable
level: medium
author: Steven Dick
description: |-
  The following analytic detects when a process spawns an executable known for User Account Control (UAC) bypass exploitation and subsequently monitors for any child processes with a higher integrity level than the original process.
  This detection leverages Sysmon EventID 1 data, focusing on process integrity levels and known UAC bypass executables.
  This activity is significant as it may indicate an attacker has successfully used a UAC bypass exploit to escalate privileges.
  If confirmed malicious, the attacker could gain elevated privileges, potentially leading to further system compromise and persistent access.
references:
- https://attack.mitre.org/techniques/T1548/002/
- https://atomicredteam.io/defense-evasion/T1548.002/
- https://hadess.io/user-account-control-uncontrol-mastering-the-art-of-bypassing-windows-uac/
- https://enigma0x3.net/2016/08/15/fileless-uac-bypass-using-eventvwr-exe-and-registry-hijacking/
tags:
- attack.T1548_002
date: '2024-01-10'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    IntegrityLevel|contains:
    - low
    - medium
  condition: selection_0
