title: Windows Create Local Administrator Account Via Net
id: 2c568c34-bb57-4b43-9d75-19c605b98e70
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the creation of a local administrator account using the "net.exe" command. It leverages Endpoint Detection and Response (EDR) data to identify processes named
  "net.exe" with the "/add" parameter and keywords related to administrator accounts. This activity is significant as it may indicate an attacker attempting to gain persistent access or escalate privileges.
  If confirmed malicious, this could lead to unauthorized access, data theft, or further system compromise. Review the process details, user context, and related artifacts to determine the legitimacy of
  the activity.
tags:
- attack.T1136_001
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*/add*'
  selection_1:
    CommandLine|contains:
    - '*administrators*'
    - '*administratoren*'
    - '*administrateurs*'
    - '*administrador*'
    - '*amministratori*'
    - '*administratorer*'
    - '*Rendszergazda*'
    - '*Администратор*'
    - '*Administratör*'
  condition: selection_0 and selection_1
