title: Windows Terminating Lsass Process
id: 7ab3c319-a4e7-4211-9e8c-40a049d0dba6
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a suspicious process attempting to terminate the Lsass.exe process. It leverages Sysmon EventCode 10 logs to identify processes granted PROCESS_TERMINATE access
  to Lsass.exe. This activity is significant because Lsass.exe is a critical process responsible for enforcing security policies and handling user credentials. If confirmed malicious, this behavior could
  indicate an attempt to perform credential dumping, privilege escalation, or evasion of security policies, potentially leading to unauthorized access and persistence within the environment.
references:
- https://blog.talosintelligence.com/2022/03/threat-advisory-doublezero.html
tags:
- attack.T1685
date: '2022-03-28'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains: '*lsass.exe'
  selection_2:
    GrantedAccess: '0x1'
  condition: selection_0 and selection_1 and selection_2
