title: Windows Netspy Network Scanner Execution
id: f3ee1ff4-38ab-451e-8dfc-659dea57045f
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects usage of the Netspy scanner on an endpoint.
  Netspy is a lightweight, fast, and cross-platform tool designed for internal network segment discovery.
  The tool supports various protocols, including ICMP, ARP, TCP, and UDP, allowing users to scan for active hosts and services within predefined IP ranges.
references:
- https://www.securonix.com/blog/from-cobalt-strike-to-mimikatz-slowtempest/
- https://github.com/shmilylty/netspy
tags:
- attack.t1595
- attack.t1018
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.process_name="netspy.exe"
  Processes.process IN (
      "*arpspy*",
      "*as*",
      "*icmpspy*",
      "*is*",
      "*pingspy*",
      "*ps*",
      "*tcpspy*",
      "*ts*",
      "*udpspy*",
      "*us*"
  )

  by Processes.process Processes.process_name Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name Processes.parent_process
     Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id Processes.user Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_netspy_network_scanner_execution_filter`
splunk_rule_id: f3ee1ff4-38ab-451e-8dfc-659dea57045f
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: netspy.exe
  selection_1:
    CommandLine|contains:
    - arpspy
    - as
    - icmpspy
    - is
    - pingspy
    - ps
    - tcpspy
    - ts
    - udpspy
    - us
  condition: selection_0 and selection_1
