title: Windows Raw Access To Disk Volume Partition
id: a85aa37e-9647-11ec-90c5-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious raw access reads to the device disk partition of a host machine. It leverages Sysmon EventCode 9 logs to identify processes attempting to read or write
  to the boot sector, excluding legitimate system processes. This activity is significant as it is commonly associated with destructive actions by adversaries, such as wiping, encrypting, or overwriting
  the boot sector, as seen in attacks involving malware like HermeticWiper. If confirmed malicious, this behavior could lead to severe impacts, including system inoperability, data loss, or compromised
  boot integrity.
references:
- https://blog.talosintelligence.com/2022/02/threat-advisory-hermeticwiper.html
tags:
- attack.T1561_002
date: '2022-02-25'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 9
  selection_1:
    Device|contains: \Device\HarddiskVolume*
  filter_2:
    Image:
    - '*\Windows\System32\*'
    - '*\Windows\SysWOW64\*'
  condition: (selection_0 and selection_1) and not (filter_2)
