title: Windows Set Custom DNS ServerLevelPlugin Via Dnscmd
id: 9add7765-4af5-45aa-a078-3b32de303e3e
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  The following analytic detects command-line usage of dnscmd.exe to configure the Microsoft DNS ServerLevelPluginDll setting.
  This setting allows the DNS service to load an arbitrary DLL, which can be abused by attackers with DNS administrative privileges to execute code in the context of the DNS service.
  If confirmed malicious, this activity could enable persistence, privilege escalation, or domain controller compromise through malicious DLL loading.
references:
- https://medium.com/@esnesenon/feature-not-bug-dnsadmin-to-dc-compromise-in-one-line-a0f779b8dc83
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/dnscmd
tags:
- attack.T1574
date: '2026-05-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: dnscmd.exe
  selection_1:
    CommandLine|contains: '*/config *'
  selection_2:
    CommandLine|contains: '*/serverlevelplugindll *'
  condition: selection_0 and selection_1 and selection_2
