title: Windows Service Execution RemCom
id: 7e3d68db-ea4d-419b-adbd-e14a525ecf09
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies the execution of RemCom.exe, an open-source alternative to PsExec, used for lateral movement and remote command execution. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process names, original file names, and command-line arguments. This activity is significant as it indicates potential lateral movement within the network.
  If confirmed malicious, this could allow an attacker to execute commands remotely, potentially leading to further compromise and control over additional systems within the network.
references:
- https://www.crowdstrike.com/blog/bears-midst-intrusion-democratic-national-committee/
- https://github.com/kavika13/RemCom
tags:
- attack.T1569_002
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: remcom.exe
  selection_1:
    OriginalFileName: RemCom.exe
  selection_2:
    CommandLine|contains: '*\*'
  selection_3:
    CommandLine|contains:
    - '*/user:*'
    - '*/pwd:*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
