title: Windows Password Managers Discovery
id: a3b3bc96-1c4f-4eba-8218-027cac739a48
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies command-line activity that searches for files related to password manager software, such as "*.kdbx*" and "*credential*". It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process execution logs. This activity is significant because attackers often target password manager databases to extract stored credentials, which can be used for
  further exploitation. If confirmed malicious, this behavior could lead to unauthorized access to sensitive information, enabling attackers to escalate privileges, move laterally, or exfiltrate critical
  data.
references:
- https://attack.mitre.org/techniques/T1555/005/
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
- attack.T1555_005
date: '2022-12-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*dir *'
  selection_1:
    CommandLine|contains: '*findstr*'
    CommandLine:
    - '*.kdbx*'
    - '*credential*'
    - '*key3.db*'
    - '*pass*'
    - '*cred*'
    - '*key4.db*'
    - '*accessTokens*'
    - '*access_tokens*'
    - '*.htpasswd*'
    - '*Ntds.dit*'
  condition: selection_0 and selection_1
