title: Windows System Discovery Using ldap Nslookup
id: 2418780f-7c3e-4c45-b8b4-996ea850cd49
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of nslookup.exe to query domain information using LDAP. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names and command-line arguments. This activity is significant as nslookup.exe can be abused by malware like Qakbot to gather critical domain details, such as SRV records and server names. If confirmed
  malicious, this behavior could allow attackers to map the network, identify key servers, and plan further attacks, potentially leading to data exfiltration or lateral movement within the network.
references:
- https://securelist.com/qakbot-technical-analysis/103931/
- https://learn.microsoft.com/en-us/troubleshoot/windows-server/networking/verify-srv-dns-records-have-been-created
tags:
- attack.t1033
date: '2022-10-21'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name = "nslookup.exe"
          OR
          Processes.original_file_name = "nslookup.exe"
      )
      AND Processes.process = "*_ldap._tcp.dc._msdcs*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_system_discovery_using_ldap_nslookup_filter`
splunk_rule_id: 2418780f-7c3e-4c45-b8b4-996ea850cd49
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: nslookup.exe
  selection_1:
    OriginalFileName: nslookup.exe
  selection_2:
    CommandLine|contains: _ldap._tcp.dc._msdcs
  condition: selection_0 and selection_1 and selection_2
