title: Windows LOLBAS Executed Outside Expected Path
id: 326fdf44-b90c-4d2e-adca-1fd140b10536
status: stable
level: medium
author: Steven Dick
description: |
  The following analytic identifies a LOLBAS process being executed outside of it's expected location.
  Processes being executed outside of expected locations may be an indicator that an adversary is attempting to evade defenses or execute malicious code.
  The LOLBAS project documents Windows native binaries that can be abused by threat actors to perform tasks like executing malicious code.
references:
- https://attack.mitre.org/techniques/T1036/
- https://attack.mitre.org/techniques/T1036/005/
tags:
- attack.t1036.005
- attack.t1218.011
date: '2024-05-03'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
    FROM datamodel=Endpoint.Processes where

    NOT Processes.process_path IN (
      "*\\PROGRA~*",
      "*\\Program Files \(x86\)\\",
      "*\\Program Files\\",
      "*:\\Windows\\System32\\*",
      "*:\\Windows\\SysWOW64\\*",
      "*:\\Windows\\WinSxS\\*"
    )

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process
     Processes.process_exec Processes.process_guid Processes.process_hash
     Processes.process_id Processes.process_integrity_level Processes.process_name
     Processes.process_path Processes.user Processes.user_id Processes.vendor_product

  |`drop_dm_object_name(Processes)`
  | lookup lolbas_file_path lolbas_file_name as process_name OUTPUT description as desc
  | lookup lolbas_file_path lolbas_file_name as process_name lolbas_file_path as process_path OUTPUT description as is_lolbas_path
  | search desc!="false" AND is_lolbas_path="false"
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_lolbas_executed_outside_expected_path_filter`
splunk_rule_id: 326fdf44-b90c-4d2e-adca-1fd140b10536
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    Image:
    - '*\PROGRA~*'
    - '*\Program Files \(x86\)\'
    - '*\Program Files\'
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWOW64\*'
    - '*:\Windows\WinSxS\*'
  condition: filter_0
