title: Windows Process Injection into Notepad
id: b8340d0f-ba48-4391-bea7-9e793c5aae36
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects process injection into Notepad.exe using Sysmon EventCode 10. It identifies suspicious GrantedAccess requests (0x40 and 0x1fffff) to Notepad.exe, excluding common
  system paths like System32, Syswow64, and Program Files. This behavior is often associated with the SliverC2 framework by BishopFox. Monitoring this activity is crucial as it may indicate an initial payload
  attempting to execute malicious code within Notepad.exe. If confirmed malicious, this could allow attackers to execute arbitrary code, potentially leading to privilege escalation or persistent access
  within the environment.
references:
- https://dominicbreuker.com/post/learning_sliver_c2_08_implant_basics/
- https://www.cybereason.com/blog/sliver-c2-leveraged-by-many-threat-actors
tags:
- attack.T1055_002
date: '2023-02-24'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains: '*\notepad.exe'
  filter_2:
    SourceImage:
    - '*\system32\*'
    - '*\syswow64\*'
    - '*\Program Files\*'
  selection_3:
    GrantedAccess|contains:
    - '0x40'
    - '0x1fffff'
  condition: (selection_0 and selection_1 and selection_3) and not (filter_2)
