title: Windows Indicator Removal Via Rmdir
id: c4566d2c-b094-48a1-9c59-d66e22065560
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the 'rmdir' command with '/s' and '/q' options to delete files and directory trees. This detection leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on command-line executions and process metadata. This activity is significant as it may indicate malware attempting to remove traces or components during cleanup operations.
  If confirmed malicious, this behavior could allow attackers to eliminate forensic evidence, hinder incident response efforts, and maintain persistence by removing indicators of compromise.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
tags:
- attack.T1070
date: '2022-12-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*rmdir*'
  selection_1:
    CommandLine|contains: '* /s *'
  selection_2:
    CommandLine|contains: '* /q *'
  filter_3:
    ParentImage:
    - explorer.exe
    - '*HPDock*'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
