title: Windows Cached Domain Credentials Reg Query
id: 40ccb8e0-1785-466e-901e-6a8b75c04ecd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies a process command line querying the CachedLogonsCount registry value in the Winlogon registry. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on command-line executions and registry queries. Monitoring this activity is significant as it can indicate the use of post-exploitation tools like Winpeas, which gather information
  about login caching settings. If confirmed malicious, this activity could help attackers understand login caching configurations, potentially aiding in credential theft or lateral movement within the
  network.
references:
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
- https://learn.microsoft.com/de-de/troubleshoot/windows-server/user-profiles-and-logon/cached-domain-logon-information
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
tags:
- attack.T1003_005
date: '2022-12-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '* query *'
  selection_1:
    CommandLine|contains: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\Winlogon*'
  selection_2:
    CommandLine|contains: '*CACHEDLOGONSCOUNT*'
  condition: selection_0 and selection_1 and selection_2
