title: Windows Audit Policy Restored via Auditpol
id: d7d1795b-ea18-47e5-9ca6-2c330d052d21
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: The following analytic identifies the execution of `auditpol.exe` with the "/restore" command-line argument used to restore the audit policy from a file. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions. This activity can be significant as it indicates potential defense evasion by adversaries or Red Teams, aiming to limit
  data that can be leveraged for detections and audits. Attackers can provide an audit policy file that disables certain or all audit policy configuration. If confirmed malicious, this behavior could allow
  attackers to bypass defenses, and plan further attacks, potentially leading to full machine compromise or lateral movement.
references:
- https://www.microsoft.com/en-us/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
- https://www.cybereason.com/blog/research/prometei-botnet-exploiting-microsoft-exchange-vulnerabilities
- https://attack.mitre.org/techniques/T1562/002/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/auditpol-restore
tags:
- attack.t1685.001
date: '2025-02-19'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE `process_auditpol` Processes.process="*/restore*" Processes.process="*/file*"
      AND
      NOT Processes.process="*/?*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_audit_policy_restored_via_auditpol_filter`
splunk_rule_id: d7d1795b-ea18-47e5-9ca6-2c330d052d21
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: /restore
  selection_1:
    CommandLine|contains: /file
  filter_2:
    CommandLine|contains: '*/?*'
  condition: (selection_0 and selection_1) and not (filter_2)
