title: Windows DISM Install PowerShell Web Access
id: fa6142a7-c364-4d11-9954-895dd9efb2d4
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the installation of PowerShell Web Access using the Deployment Image Servicing and Management (DISM) tool. It leverages Sysmon EventID 1 to identify the execution
  of `dism.exe` with specific parameters related to enabling the WindowsPowerShellWebAccess feature. This activity is significant because enabling PowerShell Web Access can facilitate remote execution of
  PowerShell commands, potentially allowing an attacker to gain unauthorized access to systems and networks. If confirmed malicious, this action could lead to further exploitation and compromise of the
  affected system.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-241a
- https://gist.github.com/MHaggis/7e67b659af9148fa593cf2402edebb41
tags:
- attack.t1548.002
date: '2024-09-03'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name=dism.exe (Processes.process="*WindowsPowerShellWebAccess*"
      AND
      Processes.process="*/online*"
      AND
      Processes.process="*/enable-feature*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_dism_install_powershell_web_access_filter`
splunk_rule_id: fa6142a7-c364-4d11-9954-895dd9efb2d4
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: dism.exe
  selection_1:
    CommandLine|contains: WindowsPowerShellWebAccess
  selection_2:
    CommandLine|contains: /online
  selection_3:
    CommandLine|contains: /enable-feature
  condition: selection_0 and selection_1 and selection_2 and selection_3
