title: Windows Network Connection Discovery Via Net
id: 86a5b949-679b-4197-8d4c-9c180a818c45
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies the execution of `net.exe` with command-line arguments used to list or display information about computer connections. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions. This activity can be significant as it indicates potential network reconnaissance by adversaries or Red Teams, aiming
  to gather situational awareness and Active Directory information. If confirmed malicious, this behavior could allow attackers to map the network, identify critical assets, and plan further attacks, potentially
  leading to data exfiltration or lateral movement.
references:
- https://attack.mitre.org/techniques/T1049/
tags:
- attack.t1049
date: '2021-08-24'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          `process_net`
          OR
          (Processes.process_name="net.exe"
          OR
          Processes.original_file_name="net.exe")
      )
      AND (Processes.process=*use)
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_network_connection_discovery_via_net_filter`
splunk_rule_id: 86a5b949-679b-4197-8d4c-9c180a818c45
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: net.exe
  selection_1:
    OriginalFileName: net.exe
  condition: selection_0 and selection_1
