title: Windows Linked Policies In ADSI Discovery
id: 510ea428-4731-4d2f-8829-a28293e427aa
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of the `[Adsisearcher]` type accelerator in PowerShell Script Block Logging (EventCode=4104) to query Active Directory for domain organizational units.
  This detection leverages PowerShell operational logs to identify script blocks containing `[adsisearcher]`, `objectcategory=organizationalunit`, and `findAll()`. This activity is significant as it indicates
  potential reconnaissance efforts by adversaries to gain situational awareness of the domain structure. If confirmed malicious, this could lead to further exploitation, such as privilege escalation or
  lateral movement within the network.
references:
- https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/
- https://medium.com/@pentesttas/discover-hidden-gpo-s-on-active-directory-using-ps-adsi-a284b6814c81
tags:
- attack.T1087_002
date: '2021-08-25'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*[adsisearcher]*'
  selection_2:
    ScriptBlockText|contains: '*objectcategory=organizationalunit*'
  selection_3:
    ScriptBlockText|contains: '*findAll()*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
