title: Windows List ENV Variables Via SET Command From Uncommon Parent
id: aec157f4-8783-4584-aca6-754c4dc7fba9
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies a suspicious process command line fetching environment variables using the cmd.exe "set" command, with a non-shell parent process. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on command-line executions and parent process names. This activity could be significant as it is commonly associated with malware like Qakbot, which uses
  this technique to gather system information. If confirmed malicious, this behavior could indicate that the parent process has been compromised, potentially allowing attackers to execute arbitrary commands,
  escalate privileges, or persist within the environment.
references:
- https://twitter.com/pr0xylife/status/1585612370441031680?s=46&t=Dc3CJi4AnM-8rNoacLbScg
tags:
- attack.T1055
date: '2022-10-27'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: cmd.exe
  selection_1:
    CommandLine|contains:
    - '*/c set'
    - '*/c \"set'
  filter_2:
    ParentImage:
    - cmd.exe
    - explorer.exe
    - powershell*
    - pwsh.exe
  condition: (selection_0 and selection_1) and not (filter_2)
