title: Windows Apache Benchmark Binary
id: 894f48ea-8d85-4dcd-9132-c66cdb407c9b
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of the Apache Benchmark binary (ab.exe), commonly used by MetaSploit payloads. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process creation events where the original file name is ab.exe. This activity is significant as it may indicate the presence of a MetaSploit attack, which uses Apache Benchmark to generate
  malicious payloads. If confirmed malicious, this could lead to unauthorized network connections, further system compromise, and potential data exfiltration. Immediate investigation is required to determine
  the intent and scope of the activity.
references:
- https://seclists.org/metasploit/2013/q3/13
tags:
- attack.T1059
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: ab.exe
  condition: selection_0
