title: Windows PuTTY Suite Utility Execution
id: 64d5263e-0f29-4641-81ed-03b39c27ecd4
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects the execution of programs associated with the PuTTY SSH client suite, including putty.exe, pscp.exe, plink.exe, psftp.exe, and puttygen.exe.
  This activity is significant because these tools can be used to establish unauthorized remote connections, transfer files, or execute commands on remote systems.
  If identified in an unusual context, such as non-administrative accounts or unexpected systems, it may indicate attempts to bypass security controls, perform lateral movement, or exfiltrate data, which could lead to further network compromise.
tags:
- attack.T1021_004
date: '2026-05-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - putty.exe
    - pscp.exe
    - plink.exe
    - psftp.exe
    - puttygen.exe
  selection_1:
    OriginalFileName|contains:
    - PuTTY
    - PSCP
    - Plink
    - PSFTP
    - PuTTYgen
  condition: selection_0 and selection_1
