title: Windows TeamCity Payload Execution from Temp Directory
id: 937c59be-0975-4097-ae45-f07c894f9ff4
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the bundled TeamCity java executing a payload out of the temp directory.
  This activity can be associated with a malicious plugin installed by metasploit for remote code execution.
references:
- https://thehackernews.com/2024/03/critical-jetbrains-teamcity-on-premises.html
- https://github.com/sfewer-r7/metasploit-framework/blob/CVE-2024-27198/modules/exploits/multi/http/jetbrains_teamcity_rce_cve_2024_27198.rb
- https://www.rapid7.com/blog/post/2024/03/04/etr-cve-2024-27198-and-cve-2024-27199-jetbrains-teamcity-multiple-authentication-bypass-vulnerabilities-fixed/
tags:
- attack.T1190
- attack.T1505_003
- attack.T1059
date: '2026-05-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*-classpath *'
  selection_1:
    CommandLine|contains: '*:\Windows\TEMP\~spawn*'
  selection_2:
    CommandLine|contains: '*.tmp.dir *'
  selection_3:
    CommandLine|contains: '*.Payload*'
  selection_4:
    CommandLine|contains: '*TeamCity*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
