title: Windows Unsigned DLL Side-Loading In Same Process Path
id: 3cf85c02-f9d6-4186-bf3c-e70ee99fbc7f
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This detection identifies unsigned DLLs loaded through DLL side-loading with same file path with the process loaded the DLL, a technique observed in DarkGate malware. This detection monitors
  DLL loading, verifies signatures, and flags unsigned DLLs. Suspicious file paths and known executable associations are checked. Detecting such suspicious DLLs is crucial in preventing privilege escalation
  attacks and other potential security breaches. Regular security assessments, thorough monitoring, and implementing security best practices are essential in safeguarding systems from such threats.
references:
- https://www.splunk.com/en_us/blog/security/enter-the-gates-an-analysis-of-the-darkgate-autoit-loader.html
- https://www.trendmicro.com/en_us/research/23/b/investigating-the-plugx-trojan-disguised-as-a-legitimate-windows.html
tags:
- attack.T1574_001
date: '2024-06-26'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Signed: 'false'
  selection_2:
    SignatureStatus: Valid
  filter_3:
    Image:
    - '*:\windows\system32\*'
    - '*:\windows\syswow64\*'
    - c:\Program Files*
  filter_4:
    ImageLoaded:
    - '*:\windows\system32\*'
    - '*:\windows\syswow64\*'
    - c:\Program Files*
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3 and filter_4)
