title: Windows AppCertDLL Modification Via Command Line
id: 3ba73a2b-3396-47e4-bdef-c80e6a7895c0
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects attempts to modify AppCertDLL registry keys via some command line utility. Values under this key are used to specify DLLs loaded by the Windows Session Manager.
  Such modifications can be abused by attackers to load malicious code early in the system startup process, enabling persistent malware execution with high privileges.
  If confirmed malicious, this behavior may lead to system compromise, persistence, and the evasion of security controls.
tags:
- attack.t1546.009
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.process="*\\Control\\Session Manager\\AppCertDLLs*"

  by Processes.process Processes.vendor_product Processes.user_id
     Processes.process_hash Processes.parent_process_name
     Processes.parent_process_exec Processes.action Processes.dest
     Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name
     Processes.parent_process Processes.parent_process_path
     Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id
     Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_appcertdll_modification_via_command_line_filter`
splunk_rule_id: 3ba73a2b-3396-47e4-bdef-c80e6a7895c0
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: \Control\Session Manager\AppCertDLLs
  condition: selection_0
