title: Windows Potential Cloudflared Network Connection
id: 29798d45-c9c7-4240-a5ef-d7648c016024
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects network connection events possibly associated with the Cloudflared tool, a tool used to create tunnels via Cloudflare.
  Cloudflared is functionally very similar to ngrok, an ingress-as-a-service tool.
  It reaches out to the Cloudflare Edge Servers, creating an outbound connection over HTTPS(HTTP2/QUIC), where the tunnel's controller makes services or private networks accessible.
references:
- https://www-bleepingcomputer-com.cdn.ampproject.org/c/s/www.bleepingcomputer.com/news/security/hackers-increasingly-abuse-cloudflare-tunnels-for-stealthy-connections/amp/
- https://github.com/cloudflare/cloudflared
- https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
tags:
- attack.T1572
date: '2026-05-05'
logsource:
  category: all_traffic
  product: windows
detection:
  selection_0:
    DestinationPort: 7844
  condition: selection_0
