title: Windows Guest Account Enabled Via Net.EXE
id: 4f8cd681-7583-47a0-9f38-6337b7adf48a
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  By default, the Windows guest account is heavily restricted, with limited permissions and access to system resources.
  However, if the guest account is activated, it can potentially be used to perform malicious activities such as installing malware, deleting files, stealing data, or even taking control of the system.
tags:
- attack.t1078.001
date: '2021-09-02'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  `process_net`
  Processes.process="*user *"
  Processes.process="*guest *"
  Processes.process="*/active:yes*"

  by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name Processes.parent_process
     Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_guest_account_enabled_via_net_exe_filter`
splunk_rule_id: 4f8cd681-7583-47a0-9f38-6337b7adf48a
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: 'user '
  selection_1:
    CommandLine|contains: 'guest '
  selection_2:
    CommandLine|contains: /active:yes
  condition: selection_0 and selection_1 and selection_2
