title: Windows Scheduled Task Created Via XML
id: 7e03b682-3965-4598-8e91-a60a40a3f7e4
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects the creation of scheduled tasks in Windows using schtasks.exe with the "XML" parameter.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions and process details.
  This activity is significant as it is a common technique for establishing persistence or achieving privilege escalation, often used by malware like Trickbot and Winter-Vivern. While creating a scheduled task via XML may be legitimate, it can also be abused by attackers. If confirmed malicious, this could allow attackers to maintain access, execute additional payloads, and potentially lead to data theft or ransomware deployment.
references:
- https://twitter.com/_CERT_UA/status/1620781684257091584
- https://cert.gov.ua/article/3761104
tags:
- attack.t1053.005
date: '2023-04-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  (Processes.process_name=schtasks.exe OR Processes.original_file_name=schtasks.exe)
  Processes.process IN ("* /create *", "* -create *")
  Processes.process IN ("* /xml *", "* -xml *")

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
     Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_scheduled_task_created_via_xml_filter`
splunk_rule_id: 7e03b682-3965-4598-8e91-a60a40a3f7e4
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: schtasks.exe
  selection_1:
    OriginalFileName: schtasks.exe
  selection_2:
    CommandLine|contains:
    - ' /create '
    - ' -create '
  selection_3:
    CommandLine|contains:
    - ' /xml '
    - ' -xml '
  condition: selection_0 and selection_1 and selection_2 and selection_3
