title: Windows Input Capture Using Credential UI Dll
id: 406c21d6-6c75-4e9f-9ca9-48049a1dd90e
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a process loading the credui.dll or wincredui.dll module. This detection leverages Sysmon EventCode 7 to identify instances where these DLLs are loaded by processes
  outside typical system directories. This activity is significant because adversaries often abuse these modules to create fake credential prompts or dump credentials, posing a risk of credential theft.
  If confirmed malicious, this activity could allow attackers to harvest user credentials, leading to unauthorized access and potential lateral movement within the network.
references:
- https://docs.microsoft.com/en-us/windows/win32/api/wincred/nf-wincred-creduipromptforcredentialsa
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1056.002/T1056.002.md#atomic-test-2---powershell---prompt-user-for-password
tags:
- attack.T1056_002
date: '2022-08-31'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
    ImageLoaded|contains: '*\credui.dll'
    OriginalFileName: credui.dll
  selection_1:
    ImageLoaded|contains: '*\wincredui.dll'
    OriginalFileName: wincredui.dll
    Image:
    - '*\windows\explorer.exe'
    - '*\windows\system32\*'
    - '*\windows\sysWow64\*'
    - '*:\program files*'
  condition: selection_0 and selection_1
