title: Windows Command and Scripting Interpreter Path Traversal Exec
id: 58fcdeb1-728d-415d-b0d7-3ab18a275ec2
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects path traversal command-line execution, often used in malicious documents to execute code via msdt.exe for defense evasion. It leverages Endpoint Detection and
  Response (EDR) data, focusing on specific patterns in process paths. This activity is significant as it can indicate an attempt to bypass security controls and execute unauthorized code. If confirmed
  malicious, this behavior could lead to code execution, privilege escalation, or persistence within the environment, potentially allowing attackers to deploy malware or leverage other living-off-the-land
  binaries (LOLBins).
references:
- https://app.any.run/tasks/713f05d2-fe78-4b9d-a744-f7c133e3fafb/
tags:
- attack.T1059
date: '2022-05-30'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    os: Linux
    CommandLine|contains: '*\/..\/..\/..\/*'
  selection_1:
    CommandLine|contains: '*\..\..\..\*'
  selection_2:
    CommandLine|contains: '*\/\/..\/\/..\/\/..\/\/*'
  condition: selection_0 and selection_1 and selection_2
