title: Windows LOLBAS Executed As Renamed File
id: fd496996-7d9e-4894-8d40-bb85b6192dc6
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies a LOLBAS process being executed where it's process name does not match it's original file name attribute. Processes that have been renamed and executed may
  be an indicator that an adversary is attempting to evade defenses or execute malicious code. The LOLBAS project documents Windows native binaries that can be abused by threat actors to perform tasks like
  executing malicious code.
references:
- https://attack.mitre.org/techniques/T1036/
- https://attack.mitre.org/techniques/T1036/003/
tags:
- attack.T1036_003
- attack.T1218_011
date: '2024-05-03'
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    OriginalFileName:
    - '-'
    - unknown
  filter_1:
    Image:
    - '*\Program Files*'
    - '*\PROGRA~*'
    - '*\Windows\System32\*'
    - '*\Windows\Syswow64\*'
  condition: not (filter_0 and filter_1)
