title: Windows Devtunnels Execution
id: b2630bb6-97df-405a-88b5-de6bb2c12cc3
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the execution of Microsoft devtunnels.exe.
  Microsoft Devtunnels is a feature within Visual Studio that allows developers to expose their local development environment to the internet via secure, temporary tunnels, enabling external access for testing webhooks, APIs, and other services.
  While designed for legitimate development purposes, an attacker could exploit this feature to expose a compromised system or service to the internet, creating a covert communication channel that bypasses network security measures.
  By using Dev Tunnels, the attacker can establish a remote connection to the compromised environment, facilitate data exfiltration, or maintain command-and-control communications while avoiding detection by blending their activities with legitimate development traffic.
references:
- https://blueteamops.medium.com/detecting-dev-tunnels-16f0994dc3e2
tags:
- attack.T1090
date: '2026-05-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: devtunnel.dll
  selection_1:
    Image: devtunnel.exe
  condition: selection_0 and selection_1
