title: Windows DLL Search Order Hijacking Hunt with Sysmon
id: 79c7d1fc-64c7-91be-a616-ccda752efe81
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies potential DLL search order hijacking or DLL sideloading by detecting known Windows libraries loaded from non-standard directories. It leverages Sysmon EventCode
  7 to monitor DLL loads and cross-references them with a lookup of known hijackable libraries. This activity is significant as it may indicate an attempt to execute malicious code by exploiting DLL search
  order vulnerabilities. If confirmed malicious, this could allow attackers to gain code execution, escalate privileges, or maintain persistence within the environment.
references:
- https://hijacklibs.net
tags:
- attack.T1574_001
date: '2022-08-19'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  filter_1:
    Image:
    - '*\system32\*'
    - '*\syswow64\*'
    - '*\winsxs\*'
    - '*\wbem\*'
  condition: (selection_0) and not (filter_1)
