title: Windows Phishing PDF File Executes URL Link
id: 2fa9dec8-9d8e-46d3-96c1-202c06f0e6e1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious PDF viewer processes spawning browser application child processes. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process and parent process names. This activity is significant as it may indicate a PDF spear-phishing attempt where a malicious URL link is executed, leading to potential payload download. If confirmed
  malicious, this could allow attackers to execute code, escalate privileges, or persist in the environment by exploiting the user's browser to connect to a malicious site.
references:
- https://twitter.com/pr0xylife/status/1615382907446767616?s=20
tags:
- attack.T1566_001
date: '2023-01-18'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - AcroRd32.exe
    - FoxitPDFReader.exe
  selection_1:
    Image|contains:
    - firefox.exe
    - chrome.exe
    - iexplore.exe
  condition: selection_0 and selection_1
