title: Windows MSIExec Spawn Discovery Command
id: e9d05aa2-32f0-411b-930c-5b8ca5c4fcee
status: stable
level: medium
author: Michael Haag, Nasreddine Bencherchali, Splunk
description: |-
  The following analytic detects MSIExec spawning multiple discovery commands.
  This behavior is identified using data from Endpoint Detection and Response (EDR) agents, focusing on process creation events where MSIExec is the parent process.
  If confirmed malicious, an attacker could use these discovery commands to gather system information, potentially leading to further exploitation or lateral movement within the network.
references:
- https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.007/T1218.007.md
tags:
- attack.T1218_007
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: msiexec.exe
  selection_1:
    Image|contains:
    - arp.exe
    - dsget.exe
    - hostname.exe
    - ipconfig.exe
    - nbtstat.exe
    - netdom.exe
    - nltest.exe
    - ntdsutil.exe
    - qprocess.exe
    - qwinsta.exe
    - systeminfo.exe
    - wmic.exe
  selection_2:
    Image:
    - bash.exe
    - cmd.exe
    - powershell.exe
    - powershell_ise.exe
    - pwsh.exe
  condition: selection_0 and selection_1 and selection_2
