title: Windows New Deny Permission Set On Service SD Via Sc.EXE
id: d0f6a5e5-dbfd-46e1-8bd5-2e2905947c33
status: stable
level: medium
author: Nasreddine Bencherchali, Michael Haag, Splunk
description: |
  The following analytic detects changes in a service security descriptor where a new deny ace has been added.
  It leverages data from Endpoint Detection and Response (EDR) agents, specifically searching for any process execution involving the "sc.exe" binary with the "sdset" flag targeting any service and adding a dedicated deny ace to specific groups.
  If confirmed malicious, this could allow an attacker to escalate their privileges, blind defenses and more.
  Investigate appropariate services and groups to determine if the behavior is malicious.
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://news.sophos.com/wp-content/uploads/2020/06/glupteba_final-1.pdf
- https://attack.mitre.org/techniques/T1564/
tags:
- attack.t1564
date: '2024-12-06'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
          values(Processes.process) as process
  FROM datamodel=Endpoint.Processes WHERE
  (
      Processes.process_name=sc.exe
      OR
      Processes.original_file_name=sc.exe
  )
  Processes.process="*sdset *"
  Processes.process="*(D;*"
  Processes.process IN (
      "*;IU*",
      "*;S-1-5-4*",
      "*;SU*",
      "*;S-1-5-6*",
      "*;BA*",
      "*;S-1-5-32-544*",
      "*;SY*",
      "*;S-1-5-18*",
      "*;WD*",
      "*;S-1-1-0*",
      "*;AU*",
      "*;S-1-5-11*",
      "*;LS*",
      "*;S-1-5-19*"
  )
  NOT Processes.process IN (
      "*macmnsvc*",
      "*masvc*",
      "*McAfeeFramework*",
      "*mfefire*",
      "*mfemms*",
      "*mfevtp*",
  )
  BY Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_new_deny_permission_set_on_service_sd_via_sc_exe_filter`
splunk_rule_id: d0f6a5e5-dbfd-46e1-8bd5-2e2905947c33
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: sc.exe
  selection_1:
    OriginalFileName: sc.exe
  selection_2:
    CommandLine|contains: 'sdset '
  selection_3:
    CommandLine|contains: (D;
  selection_4:
    CommandLine|contains:
    - ;IU
    - ;S-1-5-4
    - ;SU
    - ;S-1-5-6
    - ;BA
    - ;S-1-5-32-544
    - ;SY
    - ;S-1-5-18
    - ;WD
    - ;S-1-1-0
    - ;AU
    - ;S-1-5-11
    - ;LS
    - ;S-1-5-19
  filter_5:
    CommandLine:
    - '*macmnsvc*'
    - '*masvc*'
    - '*McAfeeFramework*'
    - '*mfefire*'
    - '*mfemms*'
    - '*mfevtp*'
  condition: (selection_0 and selection_1 and selection_2 and selection_3 and selection_4) and not (filter_5)
