title: Windows Network Connection Discovery Via Net
id: 86a5b949-679b-4197-8d4c-9c180a818c45
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies the execution of `net.exe` with command-line arguments used to list or display information about computer connections. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions. This activity can be significant as it indicates potential network reconnaissance by adversaries or Red Teams, aiming
  to gather situational awareness and Active Directory information. If confirmed malicious, this behavior could allow attackers to map the network, identify critical assets, and plan further attacks, potentially
  leading to data exfiltration or lateral movement.
references:
- https://attack.mitre.org/techniques/T1049/
tags:
- attack.T1049
date: '2021-08-24'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: net.exe
  selection_1:
    OriginalFileName: net.exe
  condition: selection_0 and selection_1
