title: Windows Wmic CPU Discovery
id: 6fc46cae-a8c0-4296-b07a-8e52d4322587
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of WMIC (Windows Management Instrumentation Command-line) for CPU discovery, often executed with commands such as “wmic cpu get name” This behavior is
  commonly associated with reconnaissance, where adversaries seek to gather details about system hardware, assess processing power, or determine if the environment is virtualized. While WMIC is a legitimate
  administrative tool, its use for CPU queries outside of normal inventory or management scripts can indicate malicious intent. Monitoring command-line executions of WMIC with CPU-related arguments and
  correlating with other discovery activity can help identify attacker reconnaissance.
references:
- https://cert.gov.ua/article/6284730
tags:
- attack.T1082
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '* cpu*'
  condition: selection_0
