title: Windows MsiExec HideWindow Rundll32 Execution
id: 9683271d-92e4-43b5-a907-1983bfb9f7fd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the msiexec.exe process with the /HideWindow and rundll32 command-line parameters. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process creation events and command-line arguments. This activity is significant because it is a known tactic used by malware like QakBot to mask malicious operations under legitimate
  system processes. If confirmed malicious, this behavior could allow an attacker to download additional payloads, execute malicious code, or establish communication with remote servers, thereby evading
  detection and maintaining persistence.
references:
- https://twitter.com/Max_Mal_/status/1736392741758611607
- https://twitter.com/1ZRR4H/status/1735944522075386332
tags:
- attack.T1218_007
date: '2021-10-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: msiexec.exe
  selection_1:
    CommandLine|contains: '* /HideWindow *'
  selection_2:
    CommandLine|contains: '* rundll32*'
  condition: selection_0 and selection_1 and selection_2
