title: Windows File and Directory Enable ReadOnly Permissions
id: 1ae407b0-a042-4eb0-834a-590da055575e
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects instances where file or folder permissions are modified to grant read-only access. Such changes are characterized by the presence of read-related permissions
  (e.g., R, REA, RA, RD) and the absence of write (W) or execute (E) permissions. Monitoring these events is crucial for tracking access control changes that could be intentional for restricting access
  or indicative of malicious behavior. Alerts generated by this detection help ensure that legitimate security measures are enforced while unauthorized changes are promptly investigated.
references:
- https://www.splunk.com/en_us/blog/security/-applocker-rules-as-defense-evasion-complete-analysis.html
tags:
- attack.T1222_001
date: '2023-04-12'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - icacls.exe
    - cacls.exe
    - xcacls.exe
  selection_1:
    CommandLine|contains:
    - '*/grant*'
    - '*/G*'
  selection_2:
    CommandLine|contains:
    - '*SYSTEM*'
    - '*admin*'
    - '*S-1-1-0*'
    - '*EVERYONE*'
  condition: selection_0 and selection_1 and selection_2
