title: Windows Access Token Winlogon Duplicate Handle In Uncommon Path
id: b8f7ed6b-0556-4c84-bffd-839c262b0278
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a process attempting to duplicate the handle of winlogon.exe from an uncommon or public source path. This is identified using Sysmon EventCode 10, focusing on
  processes targeting winlogon.exe with specific access rights and excluding common system paths. This activity is significant because it may indicate an adversary trying to escalate privileges by leveraging
  the high-privilege tokens associated with winlogon.exe. If confirmed malicious, this could allow the attacker to gain elevated access, potentially leading to full system compromise and persistent control
  over the affected host.
references:
- https://docs.microsoft.com/en-us/windows/win32/api/handleapi/nf-handleapi-duplicatehandle
- https://attack.mitre.org/techniques/T1134/001/
tags:
- attack.T1134_001
date: '2022-09-01'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains:
    - '*\system32\winlogon.exe*'
    - '*\SysWOW64\winlogon.exe*'
  selection_2:
    GrantedAccess: '0x1040'
  filter_3:
    SourceImage:
    - C:\Windows\*
    - C:\Program File*
    - '%systemroot%\*'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
