title: Windows RDP Client Launched with Admin Session
id: 1af84ac8-05ea-4f11-8541-b2d1e45a7744
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This detection identifies the execution of the Windows Remote Desktop Client (mstsc.exe) with the "/v" and /admin command-line arguments. The "/v" flag specifies the remote host to connect
  to, while the /admin flag initiates a connection to the target system’s console session, often used for administrative purposes. This combination may indicate that a user or attacker is performing privileged
  remote access, potentially to manage a system without disrupting existing user sessions. While such usage may be legitimate for IT administrators, it is less common in typical user behavior. Threat actors
  may abuse this capability during lateral movement to maintain stealthy access to high-value systems. Monitoring for this pattern can help detect interactive hands-on-keyboard activity, privilege abuse,
  or attempts to access critical infrastructure without leaving typical login traces associated with non-admin RDP sessions.
references:
- https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
- https://thelocalh0st.github.io/posts/rdp/
tags:
- attack.T1021_001
date: '2021-08-25'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: mstsc.exe
  selection_1:
    CommandLine|contains: '*/v:*'
  selection_2:
    CommandLine|contains: '*/admin*'
  condition: selection_0 and selection_1 and selection_2
