title: Windows Execution of Microsoft MSC File In Suspicious Path
id: ac30858b-7c25-4f0a-a7fa-bef036e49dc3
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects when a Microsoft Management Console (MMC) process executes an .msc file in a suspicious path on a Windows system. While .msc files are legitimate components used
  for system administration, unexpected execution of these files by non-administrative processes or in unusual contexts can indicate malicious activity, such as living-off-the-land attacks, persistence
  mechanisms, or automated administrative abuse. This detection monitors process creation events, command-line arguments, and parent process relationships to help distinguish normal administrative usage
  from potential threats. Alerts should be investigated in the context of the process initiating the .msc file, the target system, and any subsequent network or system activity, as routine administrative
  tasks may also trigger this behavior.
references:
- https://www.securonix.com/blog/analyzing-fluxconsole-using-tax-themed-lures-threat-actors-exploit-windows-management-console-to-deliver-backdoor-payloads/
- https://research.checkpoint.com/2019/microsoft-management-console-mmc-vulnerabilities/
tags:
- attack.T1218_014
date: '2021-07-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: mmc.exe
  selection_1:
    CommandLine|contains: '*.msc*'
  selection_2:
    CommandLine|contains:
    - '*\PerfLogs\*'
    - '*\programdata\*'
    - '*Recycle.bin*'
    - '*\Download*'
    - '*\temp\*'
    - '*\Users\Administrator\Music\*'
    - '*\Users\Default\*'
    - '*\Users\Public\*'
    - '*\Users\Administrator\Music\*'
    - '*:\Windows\Prefetch\*'
    - '*:\Windows\Cursors\*'
    - '*:\Windows\INF\*'
    - '*:\Windows\debug\*'
    - '*:\Windows\fonts\*'
    - '*:\Windows\Media\*'
    - '*:\Windows\repair\*'
    - '*:\Windows\servicing\*'
  filter_3:
    CommandLine:
    - '*C:\Windows\System32\eventvwr.msc*'
    - '*C:\Windows\System32\certmgr.msc*'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
