title: Windows Service Stop By Deletion
id: 196ff536-58d9-4d1b-9686-b176b04e430b
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of `sc.exe` to delete a Windows service. It leverages Endpoint Detection and Response (EDR) data, focusing on process execution logs that capture command-line
  arguments. This activity is significant because adversaries often delete services to disable security mechanisms or critical system functions, aiding in evasion and persistence. If confirmed malicious,
  this action could lead to the termination of essential security services, allowing attackers to operate undetected and potentially escalate their privileges or maintain long-term access to the compromised
  system.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1543.003/T1543.003.md
tags:
- attack.t1489
date: '2022-06-22'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name = sc.exe
          OR
          Processes.original_file_name = sc.exe
      )
      Processes.process="* delete *"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_service_stop_by_deletion_filter`
splunk_rule_id: 196ff536-58d9-4d1b-9686-b176b04e430b
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: sc.exe
  selection_1:
    OriginalFileName: sc.exe
  selection_2:
    CommandLine|contains: ' delete '
  condition: selection_0 and selection_1 and selection_2
