title: Windows Mustang Panda USB Tool Execution
id: e66a167f-6506-4e5b-8e4d-1b04940c70be
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects known executables used for infection or DLL side loading by Mustang Panda being launched from a non-C:\ location.
  This can indicate a compromise via USB, or external storage device.
  You will have to adapt this detection if you do not use C:\ as the root device.
references:
- https://decoded.avast.io/threatintel/apt-treasure-trove-avast-suspects-chinese-apt-group-mustang-panda-is-collecting-data-from-burmese-government-agencies-and-opposition-groups/
tags:
- attack.t1574.001
- attack.t1204.002
- attack.t1020
date: '2026-05-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  NOT Processes.process_path="C:\\*"
  Processes.process_path IN (
      "*atkexComSvcRes.exe",
      "*AtlTraceTool8.exe",
      "*browser.ex",
      "*CefSub.exe",
      "*dabs.ex",
      "*FacialFeatureDemo.exe",
      "*GoogleUpdate*.exe",
      "*GUP.exe",
      "*HPCustParticUI.exe",
      "*install_.exe",
      "*mcsync.ex",
      "*melt_64.exe",
      "*mscorsvw.exe",
      "*OleView.exe",
      "*piz.exe",
      "*PlugInInstallerUtility2.exe",
      "*rar330.exe",
      "*Samvd.exe",
      "*scx.exe",
      "*spoololk.exe",
      "*Symantec.exe",
      "*SymantecHp.exe",
      "*Symantecs.exe",
      "*Symantecsy.exe",
      "*upservice.exe",
      "*vivaldi.exe",
      "*wsc_proxy.exe",
      "*ygfdt.exe"
  )

  by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name Processes.parent_process
     Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_mustang_panda_usb_tool_execution_filter`
splunk_rule_id: e66a167f-6506-4e5b-8e4d-1b04940c70be
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    Image|startswith: C:\*
  selection_1:
    Image|endswith:
    - atkexComSvcRes.exe
    - AtlTraceTool8.exe
    - browser.ex
    - CefSub.exe
    - dabs.ex
    - FacialFeatureDemo.exe
    - GoogleUpdate*.exe
    - GUP.exe
    - HPCustParticUI.exe
    - install_.exe
    - mcsync.ex
    - melt_64.exe
    - mscorsvw.exe
    - OleView.exe
    - piz.exe
    - PlugInInstallerUtility2.exe
    - rar330.exe
    - Samvd.exe
    - scx.exe
    - spoololk.exe
    - Symantec.exe
    - SymantecHp.exe
    - Symantecs.exe
    - Symantecsy.exe
    - upservice.exe
    - vivaldi.exe
    - wsc_proxy.exe
    - ygfdt.exe
  condition: (selection_1) and not (filter_0)
