title: Windows Netspy Network Scanner Execution
id: f3ee1ff4-38ab-451e-8dfc-659dea57045f
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects usage of the Netspy scanner on an endpoint.
  Netspy is a lightweight, fast, and cross-platform tool designed for internal network segment discovery.
  The tool supports various protocols, including ICMP, ARP, TCP, and UDP, allowing users to scan for active hosts and services within predefined IP ranges.
references:
- https://www.securonix.com/blog/from-cobalt-strike-to-mimikatz-slowtempest/
- https://github.com/shmilylty/netspy
tags:
- attack.T1595
- attack.T1018
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: netspy.exe
  selection_1:
    CommandLine|contains:
    - '*arpspy*'
    - '*as*'
    - '*icmpspy*'
    - '*is*'
    - '*pingspy*'
    - '*ps*'
    - '*tcpspy*'
    - '*ts*'
    - '*udpspy*'
    - '*us*'
  condition: selection_0 and selection_1
