title: Windows Process Injection Wermgr Child Process
id: 360ae6b0-38b5-4328-9e2b-bc9436cddb17
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies a suspicious instance of wermgr.exe spawning a child process unrelated to error or fault handling. This detection leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process relationships and command-line executions. This activity is significant as it can indicate Qakbot malware, which injects malicious code into wermgr.exe to evade
  detection and execute malicious actions. If confirmed malicious, this behavior could allow an attacker to conduct reconnaissance, execute arbitrary code, and persist within the network, posing a severe
  security risk.
references:
- https://twitter.com/pr0xylife/status/1585612370441031680?s=46&t=Dc3CJi4AnM-8rNoacLbScg
tags:
- attack.T1055
date: '2022-10-27'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: wermgr.exe
  filter_1:
    Image:
    - WerFaultSecure.exe
    - wermgr.exe
    - WerFault.exe
  condition: (selection_0) and not (filter_1)
