title: Windows Data Destruction Recursive Exec Files Deletion
id: 3596a799-6320-4a2f-8772-a9e98ddb2960
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic identifies a suspicious process that is recursively deleting executable files on a compromised host. It leverages Sysmon Event Codes 23 and 26 to detect this activity
  by monitoring for a high volume of deletions or overwrites of files with extensions like .exe, .sys, and .dll. This behavior is significant as it is commonly associated with destructive malware such as
  CaddyWiper, DoubleZero, and SwiftSlicer, which aim to make file recovery impossible. If confirmed malicious, this activity could lead to significant data loss and system instability, severely impacting
  business operations.
references:
- https://www.welivesecurity.com/2023/01/27/swiftslicer-new-destructive-wiper-malware-ukraine/
tags:
- attack.T1485
date: '2023-02-03'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID|contains:
    - '23'
    - '26'
  selection_1:
    TargetFilename|contains:
    - '*.exe'
    - '*.sys'
    - '*.dll'
  condition: selection_0 and selection_1
