title: Windows Scheduled Task Service Spawned Shell
id: d8120352-3b62-4e3c-8cb6-7b47584dd5e8
status: stable
level: medium
author: Steven Dick
description: |
  The following analytic detects when the Task Scheduler service ("svchost.exe -k netsvcs -p -s Schedule") spawns common command line, scripting, or shell execution binaries such as "powershell.exe" or "cmd.exe".
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships.
  This activity is significant as attackers often abuse the Task Scheduler for execution and persistence, blending in with legitimate Windows operations.
  If confirmed malicious, this could allow attackers to execute arbitrary code, maintain persistence, or escalate privileges within the environment.
references:
- https://www.mandiant.com/resources/blog/tracking-evolution-gootloader-operations
- https://nasbench.medium.com/a-deep-dive-into-windows-scheduled-tasks-and-the-processes-running-them-218d1eed4cce
- https://attack.mitre.org/techniques/T1053/005/
tags:
- attack.T1053_005
- attack.T1059
date: '2023-07-11'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: svchost.exe
  selection_1:
    ParentCommandLine|contains: '*-k*'
  selection_2:
    ParentCommandLine|contains: '*netsvcs*'
  selection_3:
    ParentCommandLine|contains: '*-p*'
  selection_4:
    ParentCommandLine|contains: '*-s*'
  selection_5:
    ParentCommandLine|contains: '*Schedule*'
  selection_6:
    Image|contains:
    - bash.exe
    - cmd.exe
    - cscript.exe
    - ksh.exe
    - powershell.exe
    - pwsh.exe
    - scrcons.exe
    - sh.exe
    - wscript.exe
    - zsh.exe
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6
