title: Windows Chrome Enable Extension Loading via Command-Line
id: da355155-1d23-48f9-bf95-e534ae273ab0
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects instances where Google Chrome is started with the --disable-features=DisableLoadExtensionCommandLineSwitch flag, effectively enabling the loading of extensions via the command line.
  This may indicate attempts to bypass enterprise extension policies, load unauthorized or malicious extensions, or manipulate browser behavior.
  Monitoring this activity helps identify potential security policy violations, malware persistence techniques, or other suspicious Chrome modifications.
references:
- https://www.gdatasoftware.com/blog/2025/11/38298-learning-about-browser-hijacking
tags:
- attack.T1185
date: '2026-01-12'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: Chrome.exe
  selection_1:
    CommandLine|contains: '*--disable-features*'
  selection_2:
    CommandLine|contains: '*DisableLoadExtensionCommandLineSwitch*'
  condition: selection_0 and selection_1 and selection_2
