title: Windows WSUS Spawning Shell
id: 76ea28ac-6f10-43fd-b5fe-340022ad0fd3
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies instances where a shell (PowerShell.exe or Cmd.exe) is spawned from wsusservice.exe, the Windows Server Update Services process. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process creation events where the parent process is wsusservice.exe. This activity is significant as it may indicate exploitation of CVE-2025-59287,
  a critical deserialization vulnerability in WSUS that allows unauthenticated remote code execution. If confirmed malicious, this behavior could allow attackers to execute arbitrary commands on WSUS servers,
  potentially leading to system compromise, data exfiltration, domain enumeration, or further lateral movement within the network.
references:
- https://www.huntress.com/blog/exploitation-of-windows-server-update-services-remote-code-execution-vulnerability
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-59287
- https://hawktrace.com/blog/CVE-2025-59287-UNAUTH
tags:
- attack.T1190
- attack.T1505_003
date: '2021-03-04'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: wsusservice.exe
  condition: selection_0
