title: Windows Compatibility Telemetry Suspicious Child Process
id: 56fe46ca-ffef-46fe-8f0e-5cd4b7b4cc0c
status: stable
level: medium
author: Steven Dick
description: The following analytic detects the execution of CompatTelRunner.exe with parameters indicative of a process not part of the normal "Microsoft Compatibility Appraiser" telemetry collection.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names, parent processes, and command-line arguments. This activity is significant because CompatTelRunner.exe and
  the "Microsoft Compatibility Appraiser" task always run as System and can be used to elevate privileges or establish a highly privileged persistence mechanism. If confirmed malicious, this could enable
  unauthorized code execution, privilege escalation, or persistent access to the compromised system.
references:
- https://attack.mitre.org/techniques/T1546/
- https://scythe.io/threat-thursday/windows-telemetry-persistence
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence
tags:
- attack.t1546
- attack.t1053.005
date: '2025-02-13'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) AS firstTime, max(_time) AS lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.parent_process_name = "CompatTelRunner.exe"
      AND
      Processes.process="* -cv:*" NOT Processes.process IN ("* -m:*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_compatibility_telemetry_suspicious_child_process_filter`
splunk_rule_id: 56fe46ca-ffef-46fe-8f0e-5cd4b7b4cc0c
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: CompatTelRunner.exe
  selection_1:
    CommandLine|contains: ' -cv:'
  filter_2:
    CommandLine: '* -m:*'
  condition: (selection_0 and selection_1) and not (filter_2)
