title: Windows Disable Windows Event Logging Disable HTTP Logging
id: 23fb6787-255f-4d5b-9a66-9fd7504032b5
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of AppCmd.exe to disable HTTP logging on IIS servers. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution
  events where AppCmd.exe is used with specific parameters to alter logging settings. This activity is significant because disabling HTTP logging can help adversaries hide their tracks and avoid detection
  by removing evidence of their actions. If confirmed malicious, this could allow attackers to operate undetected, making it difficult to trace their activities and respond to the intrusion effectively.
references:
- https://www.crowdstrike.com/wp-content/uploads/2022/05/crowdstrike-iceapple-a-novel-internet-information-services-post-exploitation-framework-1.pdf
- https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
- https://www.secureworks.com/research/bronze-union
- https://strontic.github.io/xcyclopedia/library/appcmd.exe-055B2B09409F980BF9B5A3969D01E5B2.html
tags:
- attack.T1505_004
- attack.T1685_001
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    ParentImage:
    - msiexec.exe
    - iissetup.exe
  selection_1:
    Image: appcmd.exe
  selection_2:
    CommandLine|contains:
    - '*httplogging*'
    - '*dontlog:true*'
  condition: (selection_1 and selection_2) and not (filter_0)
