title: Windows WinPEAS PowerShell Script Execution
id: 5cb208df-e1aa-478d-ab2f-8270ff9999b9
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the execution of the WinPEAS PowerShell script via default function names used within the script.
  winPEAS is a Windows tool that stands for Windows Privilege Escalation Awesome Script.
  Similar to its Linux counterpart, linpeas.sh, winPEAS is designed to automate the process of identifying potential privilege escalation paths on Windows systems.
references:
- https://raw.githubusercontent.com/carlospolop/PEASS-ng/master/winPEAS/winPEASps1/winPEAS.ps1
tags:
- attack.T1590
- attack.T1007
- attack.T1082
- attack.T1033
- attack.T1592_002
- attack.T1592_004
- attack.T1016
- attack.T1615
date: '2026-05-05'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains:
    - '*returnHotFixID*'
    - '*Start-ACLCheck*'
    - '*UnquotedServicePathCheck*'
    - '*Get-ClipBoardText*'
  condition: selection_0 and selection_1
