title: Windows Shell or Script Execution From IIS Directory
id: f058f7f9-d5cf-4a79-a720-24e93e87c8bf
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects Windows command tools such as cmd, PowerShell, or pwsh being executed from the IIS installation directory.
  This can be indicative of exploitation of software reliant on IIS such as Exchange.
tags:
- attack.T1190
- attack.T1505_004
date: '2021-09-02'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_current_directory|contains: '*:\Windows\System32\inetsrv\*'
  selection_1:
    ParentImage|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
  condition: selection_0 and selection_1
