title: Windows Create Local Account
id: 3fb2e8e3-7bc0-4567-9722-c5ab9f8595eb
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of a new local user account on a Windows system. It leverages Windows Security Audit logs, specifically event ID 4720, to identify this activity.
  Monitoring the creation of local accounts is crucial for a SOC as it can indicate unauthorized access or lateral movement within the network. If confirmed malicious, this activity could allow an attacker
  to establish persistence, escalate privileges, or gain unauthorized access to sensitive systems and data.
references:
- https://thedfirreport.com/2022/03/21/apt35-automates-initial-access-using-proxyshell/
tags:
- attack.T1136_001
date: '2022-10-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    result_id: 4720
  condition: selection_0
