title: Windows Process With NetExec Command Line Parameters
id: adbff89c-c1f2-4a2e-88a4-b5e645856510
status: stable
level: medium
author: Steven Dick, Github Community
description: The following analytic detects the use of NetExec (formally CrackmapExec) a toolset used for post-exploitation enumeration and attack within Active Directory environments through command line
  parameters. It leverages Endpoint Detection and Response (EDR) data to identify specific command-line arguments associated with actions like ticket manipulation, kerberoasting, and password spraying.
  This activity is significant as NetExec is used by adversaries to exploit Kerberos for privilege escalation and lateral movement. If confirmed malicious, this could lead to unauthorized access, persistence,
  and potential compromise of sensitive information within the network.
references:
- https://www.netexec.wiki/
- https://www.johnvictorwolfe.com/2024/07/21/the-successor-to-crackmapexec/
- https://attack.mitre.org/software/S0488/
tags:
- attack.T1550_003
- attack.T1558_003
- attack.T1558_004
date: '2024-12-27'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    os: Linux
    Image: nxc.exe
  selection_1:
    OriginalFileName|contains: nxc.exe
  selection_2:
    CommandLine:
    - '* smb *'
    - '* ssh *'
    - '* ldap *'
    - '* ftp *'
    - '* wmi *'
    - '* winrm *'
    - '* rdp *'
    - '* vnc *'
    - '* mssql *'
    - '* nfs *'
  condition: selection_0 and selection_1 and selection_2
