title: Windows MSIExec Remote Download
id: 6aa49ff2-3c92-4586-83e0-d83eb693dfda
status: stable
level: medium
author: Michael Haag, Splunk
description: |
  The following analytic detects the use of msiexec.exe with an HTTP or
  HTTPS URL in the command line, indicating a remote file download attempt. This detection
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  execution logs that include command-line details. This activity is significant as
  it may indicate an attempt to download and execute potentially malicious software
  from a remote server. If confirmed malicious, this could lead to unauthorized code
  execution, system compromise, or further malware deployment within the network.
references:
- https://thedfirreport.com/2022/06/06/will-the-real-msiexec-please-stand-up-exploit-leads-to-data-exfiltration/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.007/T1218.007.md
tags:
- attack.t1218.007
date: '2022-06-17'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  `process_msiexec`
  Processes.process IN ("*http://*", "*https://*")
  by Processes.action Processes.dest Processes.original_file_name
  Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
  Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
  Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
  Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
  Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_msiexec_remote_download_filter`
splunk_rule_id: 6aa49ff2-3c92-4586-83e0-d83eb693dfda
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - http://
    - https://
  condition: selection_0
