title: Windows Credentials Access via VaultCli Module
id: c0d89118-3f89-4cd7-8140-1f39e7210681
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects potentially abnormal interactions with VaultCLI.dll, particularly those initiated by processes located in publicly writable Windows folder paths. The VaultCLI.dll
  module allows processes to extract credentials from the Windows Credential Vault. It was seen being abused by information stealers such as Meduza. The analytic monitors suspicious API calls, unauthorized
  credential access patterns, and anomalous process behaviors indicative of malicious activity. By leveraging a combination of signature-based detection and behavioral analysis, it effectively flags attempts
  to misuse the vault for credential theft, enabling swift response to protect sensitive user data and ensure system security.
references:
- https://hijacklibs.net/entries/microsoft/built-in/vaultcli.html
- https://www.fortinet.com/blog/threat-research/exploiting-cve-2024-21412-stealer-campaign-unleashed
- https://cert.gov.ua/article/6276652
- https://cert.gov.ua/article/6281018
- https://g0njxa.medium.com/approaching-stealers-devs-a-brief-interview-with-meduza-f1bbd2efb84f
tags:
- attack.T1555_004
date: '2024-12-02'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains: '*\vaultcli.dll'
  selection_2:
    Image|contains:
    - '*\windows\fonts\*'
    - '*\windows\temp\*'
    - '*\users\public\*'
    - '*\windows\debug\*'
    - '*\Users\Administrator\Music\*'
    - '*\Windows\servicing\*'
    - '*\Users\Default\*'
    - '*Recycle.bin*'
    - '*\Windows\Media\*'
    - \Windows\repair\*
    - '*\appdata\local\temp\*'
    - '*\PerfLogs\*'
    - '*:\temp\*'
  condition: selection_0 and selection_1 and selection_2
