title: Windows AppCertDLL Modification Via Command Line
id: 3ba73a2b-3396-47e4-bdef-c80e6a7895c0
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects attempts to modify AppCertDLL registry keys via some command line utility. Values under this key are used to specify DLLs loaded by the Windows Session Manager.
  Such modifications can be abused by attackers to load malicious code early in the system startup process, enabling persistent malware execution with high privileges.
  If confirmed malicious, this behavior may lead to system compromise, persistence, and the evasion of security controls.
tags:
- attack.T1546_009
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*\Control\Session Manager\AppCertDLLs*'
  condition: selection_0
