title: Windows Office Product Spawned Rundll32 With No DLL
id: f28e787e-69ca-480e-9f98-ab970e6d4bcc
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects any Windows Office Product spawning `rundll32.exe` without a `.dll` file extension. This behavior is identified using Endpoint Detection and Response (EDR) telemetry,
  focusing on process and parent process relationships. This activity is significant as it is a known tactic of the IcedID malware family, which can lead to unauthorized code execution. If confirmed malicious,
  this could allow attackers to execute arbitrary code, potentially leading to data exfiltration, system compromise, or further malware deployment. Immediate investigation and containment are recommended.
references:
- https://www.joesandbox.com/analysis/395471/0/html
- https://app.any.run/tasks/cef4b8ba-023c-4b3b-b2ef-6486a44f6ed9/
- https://any.run/malware-trends/icedid
tags:
- attack.T1566_001
date: '2021-04-22'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process!|contains: '*.dll*'
  condition: selection_0
