title: Windows Chromium Browser No Security Sandbox Process
id: 314cb263-7eeb-4d45-b693-bb21699c73d2
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects instances where a Chrome or Chromium-based browser is launched with the --no-sandbox flag, a known indicator of potentially malicious or suspicious behavior. While this flag is occasionally used during software development or testing, it is rarely seen in normal user activity. Threat actors often abuse this setting to disable Chrome's built-in security sandbox, making it easier to execute malicious code or escape browser isolation. This behavior is commonly observed in malware droppers or loaders that embed Chromium components for command and control, credential theft, or UI spoofing. Analysts should investigate such events, especially if they originate from unusual parent processes (e.g., powershell.exe, cmd.exe, or unknown binaries), or if accompanied by other indicators such as file drops, process injection, or outbound network activity. Filtering by command-line arguments and process ancestry can help reduce false positives and surface high-fidelity detections.
references:
- https://unix.stackexchange.com/questions/68832/what-does-the-chromium-option-no-sandbox-mean
tags:
- attack.T1497
date: '2025-05-28'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - Chrome.exe
    - Brave.exe
    - Opera.exe
    - Vivaldi.exe
    - msedge.exe
  selection_1:
    CommandLine|contains:
    - '*--no-sandbox*'
    - '*--allow-no-sandbox-job*'
  condition: selection_0 and selection_1
