title: Windows ComputerDefaults Spawning a Process
id: 697eb4c0-1008-4c3c-b5ae-7bd9b39adbd6
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the spawning of ComputerDefaults.exe, a Windows system process used to manage default application associations. While normally legitimate, this process can be
  exploited by attackers to bypass User Account Control (UAC) and execute unauthorized code with elevated privileges. Detection focuses on abnormal execution patterns, unusual parent-child process relationships,
  or deviations from standard paths. Such behavior may indicate attempts to modify system defaults or run malicious scripts undetected. Monitoring ComputerDefaults.exe is critical to identify potential
  security threats, prevent privilege escalation, and maintain system integrity by distinguishing normal operations from suspicious activity.
references:
- https://www.recordedfuture.com/research/from-castleloader-to-castlerat-tag-150-advances-operations
tags:
- attack.T1548_002
date: '2023-09-19'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: ComputerDefaults.exe
  condition: selection_0
