title: Windows Office Product Loaded MSHTML Module
id: 4cc015c9-687c-40d2-adcc-46350f66e10c
status: stable
level: medium
author: Michael Haag, Mauricio Velazco, Splunk
description: The following analytic detects the loading of the mshtml.dll module into an Office product, which is indicative of CVE-2021-40444 exploitation. It leverages Sysmon EventID 7 to monitor image
  loads by specific Office processes. This activity is significant because it can indicate an attempt to exploit a vulnerability in the MSHTML component via a malicious document. If confirmed malicious,
  this could allow an attacker to execute arbitrary code, potentially leading to system compromise, data exfiltration, or further network penetration.
references:
- https://app.any.run/tasks/36c14029-9df8-439c-bba0-45f2643b0c70/
- https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-40444
- https://strontic.github.io/xcyclopedia/index-dll
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
tags:
- attack.T1566_001
date: '2021-09-09'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image|contains:
    - EQNEDT32.exe
    - excel.exe
    - Graph.exe
    - msaccess.exe
    - mspub.exe
    - onenote.exe
    - onenoteim.exe
    - onenotem.exe
    - outlook.exe
    - powerpnt.exe
    - visio.exe
    - winproj.exe
    - winword.exe
    - wordpad.exe
    - wordview.exe
  selection_2:
    loaded_file_path|contains:
    - '*\mshtml.dll'
    - '*\Microsoft.mshtml.dll'
    - '*\IE.Interop.MSHTML.dll'
    - '*\MshtmlDac.dll'
    - '*\MshtmlDed.dll'
    - '*\MshtmlDer.dll'
  condition: selection_0 and selection_1 and selection_2
