title: Windows System Time Discovery W32tm Delay
id: b2cc69e7-11ba-42dc-a269-59c069a48870
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the use of the w32tm.exe utility with the /stripchart function, which is indicative of DCRat malware delaying its payload execution. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on specific command-line arguments used by w32tm.exe. This activity is significant as it may indicate an attempt to evade detection by
  delaying malicious actions such as C2 communication and beaconing. If confirmed malicious, this behavior could allow an attacker to maintain persistence and execute further malicious activities undetected.
references:
- https://cert.gov.ua/article/405538
- https://malpedia.caad.fkie.fraunhofer.de/details/win.dcrat
- https://www.mandiant.com/resources/analyzing-dark-crystal-rat-backdoor
tags:
- attack.T1124
date: '2022-07-27'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: w32tm.exe
  selection_1:
    CommandLine|contains: '* /stripchart *'
  selection_2:
    CommandLine|contains: '* /computer:localhost *'
  selection_3:
    CommandLine|contains: '* /period:*'
  selection_4:
    CommandLine|contains: '* /dataonly *'
  selection_5:
    CommandLine|contains: '* /samples:*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5
