title: Windows Credential Dumping LSASS Memory Createdump
id: b3b7ce35-fce5-4c73-85f4-700aeada81a9
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of CreateDump.exe to perform a process dump. This binary is not native to Windows and is often introduced by third-party applications, including PowerShell
  7. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names, GUIDs, and complete command-line executions. This activity is significant as it may indicate
  an attempt to dump LSASS memory, which can be used to extract credentials. If confirmed malicious, this could lead to unauthorized access and lateral movement within the network.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md#atomic-test-11---dump-lsass-with-createdumpexe-from-net-v5
tags:
- attack.T1003_001
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: createdump.exe
  selection_1:
    OriginalFileName: FX_VER_INTERNALNAME_STR
    CommandLine|contains: '*-u *'
  condition: selection_0 and selection_1
