title: Windows Get-Variable.EXE Execution from WindowsApps Folder
id: 7edb95b6-bccf-4d8c-8ada-d1c5520cf0ed
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  An attacker can obtain persistence by hijacking the PowerShell cmdlet 'Get-Variable' by placing Get-Variable.exe in the WindowsApps folder, which is part of the PowerShell path.
  Whenever a PowerShell window is opened via a scheduled task, the malicious Get-Variable.exe will be run.
  This activity was first associated with the Colibri malware.
references:
- https://thehackernews.com/2022/04/researchers-uncover-how-colibri-malware.html
tags:
- attack.t1574.008
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.process_path="*\\AppData\\Local\\Microsoft\\WindowsApps\\Get-Variable.exe"

  by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name Processes.parent_process
     Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_get_variable_exe_execution_from_windowsapps_folder_filter`
splunk_rule_id: 7edb95b6-bccf-4d8c-8ada-d1c5520cf0ed
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|endswith: \AppData\Local\Microsoft\WindowsApps\Get-Variable.exe
  condition: selection_0
