title: Windows Credentials from Password Stores Creation
id: c0c5a479-bf57-4ca0-af3a-4c7081e5ba05
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the Windows OS tool cmdkey.exe, which is used to create stored usernames, passwords, or credentials. This detection leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on process execution logs and command-line arguments. This activity is significant because cmdkey.exe is often abused by post-exploitation tools and malware,
  such as Darkgate, to gain unauthorized access. If confirmed malicious, this behavior could allow attackers to escalate privileges and maintain persistence on the targeted host, facilitating further attacks
  and potential data breaches.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.darkgate
tags:
- attack.t1555
date: '2022-12-06'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name="cmdkey.exe"
      OR
      Processes.original_file_name = "cmdkey.exe"
      AND
      Processes.process = "*/generic*" Processes.process IN ("*/user*", "*/password*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_credentials_from_password_stores_creation_filter`
splunk_rule_id: c0c5a479-bf57-4ca0-af3a-4c7081e5ba05
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: cmdkey.exe
  selection_1:
    OriginalFileName: cmdkey.exe
    CommandLine|contains: '*/generic*'
    CommandLine:
    - '*/user*'
    - '*/password*'
  condition: selection_0 and selection_1
