title: Windows Scheduled Task with Highest Privileges
id: 2f15e1a4-0fc2-49dd-919e-cbbe60699218
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of a new scheduled task with the highest execution privileges via Schtasks.exe. It leverages Endpoint Detection and Response (EDR) logs to monitor
  for specific command-line parameters ('/rl' and 'highest') in schtasks.exe executions. This activity is significant as it is commonly used in AsyncRAT attacks for persistence and privilege escalation.
  If confirmed malicious, this could allow an attacker to maintain persistent access and execute tasks with elevated privileges, potentially leading to unauthorized system access and data breaches.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
tags:
- attack.T1053_005
date: '2023-01-26'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: schtasks.exe
  selection_1:
    CommandLine|contains: '*/rl *'
  selection_2:
    CommandLine|contains: '* highest *'
  condition: selection_0 and selection_1 and selection_2
