title: Windows PsTools Recon Usage
id: 9a5f4b3e-1d2b-4c6f-9a8e-3b7d2f5c1a6e
status: stable
level: medium
author: Nasreddine Bencherchali
description: |
  The following analytic identifies execution of Sysinternals PsTools and Sysinternals Suit binaries that are commonly used for reconnaissance and information gathering on
  Windows endpoints.
  PsTools (PsExec, PsFile, PsGetSid, PsInfo, PsPing, etc.) or Sysinternals Suit tools, are frequently used by administrators for legitimate maintenance but are also leveraged by threat actors to collect system, account, network and service information during discovery and lateral movement.
  This detection focuses on process execution and PE metadata telemetry (OriginalFileName).
  If confirmed malicious, this activity can indicate targeted reconnaissance and foothold escalation, enabling subsequent lateral movement or credential abuse.
references:
- https://learn.microsoft.com/sysinternals/downloads/pstools
- https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections/raw/master/2015/2015.09.17.Operation_Iron_Tiger/wp-operation-iron-tiger.pdf
- https://go.crowdstrike.com/rs/281-OBQ-266/images/Report2018OverwatchReport.pdf
tags:
- attack.T1082
- attack.T1046
- attack.T1018
date: '2025-10-24'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - PsGetsid.exe
    - PsGetsid64.exe
    - PsInfo.exe
    - PsInfo64.exe
    - pslist.exe
    - pslist64.exe
    - PsLoggedon.exe
    - PsLoggedon64.exe
    - psloglist.exe
    - psloglist64.exe
    - PsPing.exe
    - PsPing64.exe
    - PsService.exe
    - PsService64.exe
    - Tcpvcon.exe
    - Tcpvcon64.exe
    - Tcpvcon64a.exe
  selection_1:
    OriginalFileName|contains:
    - PsGetSid.exe
    - Psinfo.exe
    - pslist.exe
    - psloggedon.exe
    - psloglist.exe
    - psping.exe
    - psservice.exe
    - Tcpvcon.exe
  condition: selection_0 and selection_1
