title: Windows Default Cobalt Strike PowerShell Beacon
id: 25b6329b-d6b7-4ccd-9ac2-6ca1dfd2b0c1
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects default function and variable names known to be used by the Cobalt Strike PowerShell beacon.
  This beacon is used to gain command and control on a victim.
tags:
- attack.T1059_001
- attack.T1204_002
date: '2026-05-05'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains:
    - '*func_get_proc_address*'
    - '*$var_unsafe_native_methods*'
    - '*$var_gpa.Invoke*'
    - '*func_get_delegate_type*'
    - '*$var_type_builder*'
  condition: selection_0 and selection_1
