title: Windows Raw Access To Master Boot Record Drive
id: 7b83f666-900c-11ec-a2d9-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious raw access reads to the drive containing the Master Boot Record (MBR). It leverages Sysmon EventCode 9 to identify processes attempting to read or
  write to the MBR sector, excluding legitimate system processes. This activity is significant because adversaries often target the MBR to wipe, encrypt, or overwrite it as part of their impact payload.
  If confirmed malicious, this could lead to system instability, data loss, or a complete system compromise, severely impacting the organization's operations.
references:
- https://www.splunk.com/en_us/blog/security/threat-advisory-strt-ta02-destructive-software.html
- https://www.crowdstrike.com/blog/technical-analysis-of-whispergate-malware/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.T1561_002
date: '2022-02-18'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 9
  selection_1:
    Device: \Device\Harddisk0\DR0
  filter_2:
    Image:
    - '*\Windows\System32\*'
    - '*\Windows\SysWOW64\*'
  condition: (selection_0 and selection_1) and not (filter_2)
