title: Windows Credentials from Password Stores Query
id: db02d6b4-5d5b-4c33-8d8f-f0577516a8c7
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the Windows OS tool cmdkey.exe, which is often abused by post-exploitation tools like winpeas, commonly used in ransomware attacks to list stored
  usernames, passwords, or credentials. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs. This activity is significant as it indicates
  potential credential harvesting, which can lead to privilege escalation and persistence. If confirmed malicious, attackers could gain unauthorized access to sensitive information and maintain control
  over compromised systems for further exploitation.
references:
- https://ss64.com/nt/cmdkey.html
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
- attack.T1555
date: '2022-12-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: cmdkey.exe
  selection_1:
    OriginalFileName: cmdkey.exe
    CommandLine|contains: '*/list*'
  condition: selection_0 and selection_1
