title: Windows Debugger Tool Execution
id: e14d94a3-07fb-4b47-8406-f5e37180d422
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This analysis detects the use of debugger tools within a production environment. While these tools are legitimate for file analysis and debugging, they are abused by malware like PlugX and
  DarkGate for malicious DLL side-loading. The hunting query aids Security Operations Centers (SOCs) in identifying potentially suspicious tool executions, particularly for non-technical users in the production
  network.
references:
- https://www.splunk.com/en_us/blog/security/enter-the-gates-an-analysis-of-the-darkgate-autoit-loader.html
- https://www.trendmicro.com/en_us/research/23/b/investigating-the-plugx-trojan-disguised-as-a-legitimate-windows.html
tags:
- attack.t1036
date: '2023-12-06'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name = "x32dbg.exe"
      OR
      Processes.process_name = "x64dbg.exe"
      OR
      Processes.process_name = "windbg.exe"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_debugger_tool_execution_filter`
splunk_rule_id: e14d94a3-07fb-4b47-8406-f5e37180d422
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: x32dbg.exe
  selection_1:
    Image: x64dbg.exe
  selection_2:
    Image: windbg.exe
  condition: selection_0 and selection_1 and selection_2
