title: Windows Explorer.exe Spawning PowerShell or Cmd
id: 593854c5-2182-49dd-9f31-18ef697445b9
status: stable
level: medium
author: Michael Haag, AJ King, Splunk, Jesse Hunter, Splunk Community Contributor
description: This detection identifies instances where Windows Explorer.exe spawns PowerShell or cmd.exe processes, particularly focusing on executions initiated by LNK files. This behavior is associated
  with the ZDI-CAN-25373 Windows shortcut zero-day vulnerability, where specially crafted LNK files are used to trigger malicious code execution through cmd.exe or powershell.exe. This technique has been
  actively exploited by multiple APT groups in targeted attacks through both HTTP and SMB delivery methods.
references:
- https://www.zerodayinitiative.com/advisories/ZDI-CAN-25373/
- https://www.trendmicro.com/en_us/research/25/c/windows-shortcut-zero-day-exploit.html
tags:
- attack.T1059_001
- attack.T1204_002
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains: '*\explorer.exe'
  condition: selection_0
