title: Windows Proxy Execution of .NET Utilities via Scripts
id: eb59cf01-1874-4d16-b7e4-54a6eb9b3118
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the launch of common .NET-related utilities—aspnet_compiler.exe, msbuild.exe, regasm.exe, InstallUtil.exe, or vbc.exe when the parent appears to be a script (batch, CMD, PowerShell, JScript, VBScript, or HTML) running from an unusual or user-writable Windows location (for example Public, Temp, Fonts, Debug, Recycle Bin, Prefetch, or similar paths), and the child process shows little or no command-line variation from the image path or name.
  That pattern is consistent with adversaries using trusted .NET binaries as a proxy to run code while hiding execution behind script parents in low-trust folders, behavior associated with techniques such as signed binary proxy execution.
references:
- https://www.joesandbox.com/analysis/1817558/0/pdfexecutive
- https://www.broadcom.com/support/security-center/protection-bulletin/vip-keylogger-spreads-via-multi-org-impersonation-campaign
- https://malpedia.caad.fkie.fraunhofer.de/details/win.vipkeylogger
tags:
- attack.T1218
date: '2026-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - aspnet_compiler.exe
    - InstallUtil.exe
    - msbuild.exe
    - regasm.exe
    - vbc.exe
  selection_1:
    ParentCommandLine|contains:
    - '*.bat*'
    - '*.cmd*'
    - '*.html*'
    - '*.js*'
    - '*.ps1*'
    - '*.vbe*'
    - '*.vbs*'
  selection_2:
    ParentCommandLine|contains:
    - :\Windows\repair\*
    - '*:\Microsoft\Windows\Libraries\*'
    - '*:\Temp\*'
    - '*:\Users\Administrator\Music\*'
    - '*:\Users\Public\*'
    - '*:\Windows\Cursors\*'
    - '*:\Windows\debug\*'
    - '*:\Windows\Fonts\*'
    - '*:\Windows\INF\*'
    - '*:\Windows\Media\*'
    - '*:\Windows\Prefetch\*'
    - '*:\Windows\Temp\*'
    - '*\AppData\Local\Temp\*'
    - '*\PerfLogs\*'
    - '*Recycle.bin*'
  condition: selection_0 and selection_1 and selection_2
