title: Windows Metasploit Confluence Plugin Execution
id: 3a3d1f35-5985-4827-b2ad-965467303c59
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the malicious java plugin execution used by metasploit for Atlassian Confluence exploitation.
  This usually leads to the download of meterpreter giving the actor full control over the Confluence server.
tags:
- attack.T1608
- attack.T1505_003
- attack.T1190
date: '2021-09-02'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains: '*\Atlassian\Confluence\jre\bin\java.exe'
  selection_1:
    CommandLine|contains: '*-classpath *'
  selection_2:
    CommandLine|contains: '*\AppData\Local\Temp\~spawn*'
  selection_3:
    CommandLine|contains: '*.Payload*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
