title: Windows AutoIt3 Execution
id: 0ecb40d9-492b-4a57-9f87-515dd742794c
status: stable
level: medium
author: Michael Haag, Splunk
description: |
  The following analytic detects the execution of AutoIt3, a scripting
  language often used for automating Windows GUI tasks and general scripting.
  It identifies instances where AutoIt3 or its variants are executed by searching for process names
  or original file names matching 'autoit3.exe'.
  This activity is significant because attackers frequently use AutoIt3 to automate malicious actions, such as executing malware.
  If confirmed malicious, this activity could lead to unauthorized code execution,
  system compromise, or further propagation of malware within the environment.
references:
- https://github.com/PaloAltoNetworks/Unit42-timely-threat-intel/blob/main/2023-10-25-IOCs-from-DarkGate-activity.txt
tags:
- attack.t1059
date: '2023-11-16'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
    max(_time) as lastTime
  from datamodel=Endpoint.Processes where
  (
    Processes.process_name = "autoit*.exe"
    OR
    Processes.original_file_name = "autoit*.exe"
  )
  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_autoit3_execution_filter`
splunk_rule_id: 0ecb40d9-492b-4a57-9f87-515dd742794c
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: autoit*.exe
  selection_1:
    OriginalFileName: autoit*.exe
  condition: selection_0 and selection_1
