title: Windows InstallUtil in Non Standard Path
id: dcf74b22-7933-11ec-857c-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of InstallUtil.exe from non-standard paths. It leverages Endpoint Detection and Response (EDR) data, focusing on process names and original file
  names outside typical directories. This activity is significant because InstallUtil.exe is often used by attackers to execute malicious code or scripts. If confirmed malicious, this behavior could allow
  an attacker to bypass security controls, execute arbitrary code, and potentially gain unauthorized access or persist within the environment.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1036.003/T1036.003.yaml
- https://attack.mitre.org/techniques/T1036/003/
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
tags:
- attack.t1036.003
- attack.t1218.004
date: '2022-01-20'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes where `process_installutil` NOT (Processes.process_path IN
  ("*\\Windows\\ADWS\\*","*\\Windows\\SysWOW64*", "*\\Windows\\system32*", "*\\Windows\\NetworkController\\*", "*\\Windows\\SystemApps\\*", "*\\WinSxS\\*", "*\\Windows\\Microsoft.NET\\*")) by Processes.action
  Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
  Processes.process Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user
  Processes.user_id Processes.vendor_product | `drop_dm_object_name("Processes")` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_installutil_in_non_standard_path_filter`'
splunk_rule_id: dcf74b22-7933-11ec-857c-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    Image:
    - '*\Windows\ADWS\*'
    - '*\Windows\SysWOW64*'
    - '*\Windows\system32*'
    - '*\Windows\NetworkController\*'
    - '*\Windows\SystemApps\*'
    - '*\WinSxS\*'
    - '*\Windows\Microsoft.NET\*'
  condition: filter_0
