title: Windows Shell Process from CrushFTP
id: 459628e3-1b00-4e9b-9e5b-7da8961aea35
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies instances where CrushFTP's service process (crushftpservice.exe) spawns shell processes like cmd.exe or powershell.exe. This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process creation events. This activity is significant because CrushFTP should not normally spawn interactive shell processes during regular operations.
  If confirmed malicious, this behavior could indicate successful exploitation of vulnerabilities like CVE-2025-31161, potentially allowing attackers to execute arbitrary commands with the privileges of
  the CrushFTP service.
references:
- https://nvd.nist.gov/vuln/detail/CVE-2025-31161
- https://www.crushftp.com/crush11wiki/Wiki.jsp?page=Update
- https://www.huntress.com/blog/crushftp-cve-2025-31161-auth-bypass-and-post-exploitation
tags:
- attack.T1059_001
- attack.T1059_003
- attack.T1190
- attack.T1505
date: '2025-04-14'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: crushftpservice.exe
  condition: selection_0
