title: Windows Remote Host Computer Management Access
id: 455da527-0047-4610-a3ca-b4a005c2d346
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of mmc.exe to launch Computer Management (compmgmt.msc) and connect to a remote machine. This technique allows administrators to access system management
  tools, including Event Viewer, Services, Shared Folders, and Local Users & Groups, without initiating a full remote desktop session. While commonly used for legitimate administrative purposes, adversaries
  may leverage this method for remote reconnaissance, privilege escalation, or persistence. Monitoring the execution of mmc.exe with the /computer:{hostname/ip} argument can help detect unauthorized system
  administration attempts or lateral movement within a network.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-071a
tags:
- attack.t1021.006
date: '2023-04-12'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name="mmc.exe"
      AND
      Processes.process = "*compmgmt.msc *"
      AND
      Processes.process = "*/computer:*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_remote_host_computer_management_access_filter`
splunk_rule_id: 455da527-0047-4610-a3ca-b4a005c2d346
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: mmc.exe
  selection_1:
    CommandLine|contains: 'compmgmt.msc '
  selection_2:
    CommandLine|contains: '/computer:'
  condition: selection_0 and selection_1 and selection_2
