title: Windows InstallUtil Uninstall Option
id: cfa7b9ac-43f0-11ec-9b48-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of the Windows InstallUtil.exe binary with the `/u` (uninstall) switch, which can execute code while bypassing application control. This detection leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process names, parent processes, and command-line executions. This activity is significant because it can indicate an attempt to execute
  malicious code without administrative privileges. If confirmed malicious, an attacker could achieve code execution, potentially leading to further system compromise or persistence within the environment.
references:
- https://evi1cg.me/archives/AppLocker_Bypass_Techniques.html#menu_index_12
- https://github.com/api0cradle/UltimateAppLockerByPassList/blob/master/md/Installutil.exe.md
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1218.004/T1218.004.md
tags:
- attack.T1218_004
date: '2021-11-12'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '*/u*'
    - '*uninstall*'
  filter_1:
    CommandLine: '*C:\WINDOWS\CCM\*'
  filter_2:
    ParentImage: Microsoft.SharePoint.Migration.ClientInstaller.exe
  condition: (selection_0) and not (filter_1 and filter_2)
