title: Windows MMC Loaded Script Engine DLL
id: 785bbfb5-d404-42d1-ab9d-45c37a2c75cd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies when a Windows process loads scripting libraries like jscript.dll or vbscript.dll to execute script code on a target system. While these DLLs are legitimate
  parts of the operating system, their use by unexpected processes or in unusual contexts can indicate malicious activity, such as script-based malware, living-off-the-land techniques, or automated attacks.
  This detection monitors which processes load these libraries, along with their command-line arguments and parent processes, to help distinguish normal administrative behavior from potential threats. Alerts
  should be investigated with attention to the process context and any subsequent network or system activity, as legitimate tools like MMC snap-ins may also trigger this behavior under routine administrative
  tasks.
references:
- https://www.securonix.com/blog/analyzing-fluxconsole-using-tax-themed-lures-threat-actors-exploit-windows-management-console-to-deliver-backdoor-payloads/
- https://research.checkpoint.com/2019/microsoft-management-console-mmc-vulnerabilities/
tags:
- attack.T1620
date: '2026-02-17'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image: mmc.exe
  selection_2:
    ImageLoaded|contains:
    - '*\jscript.dll'
    - '*\vbscript.dll'
    - '*\jscript9.dll'
  condition: selection_0 and selection_1 and selection_2
