title: Windows Advanced Installer MSIX with AI_STUBS Execution
id: 56b2e58c-5909-49a3-998e-1f4815186ec2
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies the execution of Advanced Installer MSIX Package Support Framework (PSF) components, specifically the AI_STUBS executables with the original filename 'popupwrapper.exe'.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process paths and original filenames. This activity is significant as adversaries have been observed packaging
  malicious content within MSIX files built with Advanced Installer to bypass security controls. These AI_STUBS executables (with original filename 'popupwrapper.exe') are hallmark artifacts of potentially
  malicious MSIX packages. If confirmed malicious, this could allow attackers to execute arbitrary code, establish persistence, or deliver malware while evading traditional detection mechanisms.
references:
- https://redcanary.com/blog/threat-intelligence/msix-installers/
- https://redcanary.com/threat-detection-report/techniques/installer-packages/
- https://learn.microsoft.com/en-us/windows/msix/package/package-support-framework
- https://learn.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes
- https://attack.mitre.org/techniques/T1218/
tags:
- attack.T1218
- attack.T1553_005
- attack.T1204_002
date: '2025-08-18'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - '*\AI_STUBS\AiStubX64Elevated.exe'
    - '*\AI_STUBS\AiStubX86Elevated.exe'
    - '*\AI_STUBS\AiStubX64.exe'
    - '*\AI_STUBS\AiStubX86.exe'
  selection_1:
    OriginalFileName: popupwrapper.exe
  condition: selection_0 and selection_1
