title: Windows Office Product Loading Taskschd DLL
id: d7297cfa-1f04-4714-bfbe-3679e0666959
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects an Office document creating a scheduled task, either through a macro VBA API or by loading `taskschd.dll`. This detection leverages Sysmon EventCode 7 to identify
  when Office applications load the `taskschd.dll` file. This activity is significant as it is a common technique used by malicious macro malware to establish persistence or initiate beaconing. If confirmed
  malicious, this could allow an attacker to maintain persistence, execute arbitrary commands, or schedule future malicious activities, posing a significant threat to the environment.
references:
- https://research.checkpoint.com/2021/irans-apt34-returns-with-an-updated-arsenal/
- https://redcanary.com/threat-detection-report/techniques/scheduled-task-job/
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
tags:
- attack.T1566_001
date: '2021-04-14'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image|contains:
    - EQNEDT32.exe
    - excel.exe
    - Graph.exe
    - msaccess.exe
    - mspub.exe
    - onenote.exe
    - onenoteim.exe
    - onenotem.exe
    - outlook.exe
    - powerpnt.exe
    - visio.exe
    - winproj.exe
    - winword.exe
  selection_2:
    loaded_file_path|contains: '*\taskschd.dll'
  condition: selection_0 and selection_1 and selection_2
