title: Windows Crowdstrike RTR Script Execution
id: be2bbfff-77c9-4d65-9b7c-97726051534a
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects usage of Crowdstrike Real Time Response (RTR) to execute a "runscript" command.
  This can be used by malicious actors with access to the Crowdstrike Dashboard to execute commands on remote managed hosts.
references:
- https://cloud.google.com/blog/topics/threat-intelligence/unc3944-targets-saas-applications
tags:
- attack.T1059_001
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: dllhost.exe
  selection_1:
    ParentCommandLine|contains: '*/Processid:{BD07DDB9-1C61-4DCE-9202-A2BA1757CDB2}*'
  selection_2:
    Image: powershell.exe
  selection_3:
    CommandLine|contains: '* -Version 5.1 -s -NoLogo -NoProfile -EncodedCommand*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
