title: Windows AutoIt3 Execution
id: 0ecb40d9-492b-4a57-9f87-515dd742794c
status: stable
level: medium
author: Michael Haag, Splunk
description: |
  The following analytic detects the execution of AutoIt3, a scripting
  language often used for automating Windows GUI tasks and general scripting.
  It identifies instances where AutoIt3 or its variants are executed by searching for process names
  or original file names matching 'autoit3.exe'.
  This activity is significant because attackers frequently use AutoIt3 to automate malicious actions, such as executing malware.
  If confirmed malicious, this activity could lead to unauthorized code execution,
  system compromise, or further propagation of malware within the environment.
references:
- https://github.com/PaloAltoNetworks/Unit42-timely-threat-intel/blob/main/2023-10-25-IOCs-from-DarkGate-activity.txt
tags:
- attack.T1059
date: '2023-11-16'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains: autoit*.exe
  selection_1:
    OriginalFileName|contains: autoit*.exe
  condition: selection_0 and selection_1
