title: Windows ESX Admins Group Creation via PowerShell
id: f48a5557-be06-4b96-b8e8-be563e387620
status: stable
level: medium
author: Michael Haag, Splunk
description: This analytic detects attempts to create an "ESX Admins" group using PowerShell commands. This activity may indicate an attempt to exploit the VMware ESXi Active Directory Integration Authentication
  Bypass vulnerability (CVE-2024-37085). Attackers can use this method to gain unauthorized access to ESXi hosts by recreating the 'ESX Admins' group after its deletion from Active Directory.
references:
- https://support.broadcom.com/web/ecx/support-content-notification/-/external/content/SecurityAdvisories/0/24505
- https://www.microsoft.com/en-us/security/blog/2024/07/29/ransomware-operators-exploit-esxi-hypervisor-vulnerability-for-mass-encryption/
- https://www.securityweek.com/microsoft-says-ransomware-gangs-exploiting-just-patched-vmware-esxi-flaw/
tags:
- attack.T1136_002
- attack.T1136_001
date: '2024-07-30'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*New-ADGroup*'
  selection_2:
    ScriptBlockText|contains: '*New-LocalGroup*'
  selection_3:
    ScriptBlockText|contains: '*ESX Admins*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
