title: Windows Default RDP File Creation By Non MSTSC Process
id: 692226f1-84e3-4f63-a747-d53e65699608
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This detection monitors the creation or modification of the Default.rdp file by non mstsc.exe process, typically found in the user's Documents folder. This file is automatically generated or
  updated by the Remote Desktop Connection client (mstsc.exe) when a user initiates an RDP session. It stores connection settings such as the last-used hostname, screen size, and other preferences. The
  presence or update of this file strongly suggests that an RDP session has been launched from the system. Since this file is commonly overlooked, it can serve as a valuable artifact in identifying remote
  access activity, including potential lateral movement or attacker-controlled sessions.
references:
- https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
- https://thelocalh0st.github.io/posts/rdp/
- https://iam0xc4t.medium.com/rogue-rdp-via-spear-phishing-initial-access-tactic-d7be328a0b13
tags:
- attack.t1021.001
date: '2025-10-27'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name != mstsc.exe
    BY _time span=1h Processes.action
       Processes.dest Processes.original_file_name Processes.parent_process
       Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
       Processes.parent_process_name Processes.parent_process_path Processes.process
       Processes.process_exec Processes.process_guid Processes.process_hash
       Processes.process_id Processes.process_integrity_level Processes.process_name
       Processes.process_path Processes.user Processes.user_id
       Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | rename process_guid as proc_guid
  | join proc_guid, _time [
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
    WHERE Filesystem.file_name=default.rdp
    BY _time span=1h Filesystem.dest
       Filesystem.file_create_time Filesystem.file_name Filesystem.file_path
       Filesystem.process_guid
  | `drop_dm_object_name(Filesystem)`
  | rename process_guid as proc_guid
  | fields _time dest file_create_time file_name file_path process_name process_path process proc_guid]
  | dedup file_create_time
  | table dest, process_name, process, file_create_time, file_name, file_path, proc_guid
  | `windows_default_rdp_file_creation_by_non_mstsc_process_filter`
splunk_rule_id: 692226f1-84e3-4f63-a747-d53e65699608
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: mstsc.exe
  condition: selection_0
