title: Windows RDP Cache File Deletion
id: f3e86ff3-b1f9-4382-8924-6913385f1019
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This detection identifies the deletion of RDP bitmap cache files—specifically .bmc and .bin files—typically stored in the user profile under the Terminal Server Client\Cache directory. These
  files are created by the native Windows Remote Desktop Client (mstsc.exe) and store graphical elements from remote sessions to improve performance. Deleting these files may indicate an attempt to remove
  forensic evidence of RDP usage. While rare in legitimate user behavior, this action is commonly associated with defense evasion techniques used by attackers or red teamers who wish to hide traces of interactive
  remote access. When observed in conjunction with recent logon activity, RDP session indicators, or script execution, this behavior should be treated as potentially malicious. Monitoring for deletion of
  these files provides valuable visibility into anti-forensic actions that often follow lateral movement or hands-on-keyboard activity.
references:
- https://medium.com/@bonguides25/how-to-clear-rdp-connections-history-in-windows-cf0ffb67f344
- https://thelocalh0st.github.io/posts/rdp/
tags:
- attack.T1070_004
date: '2025-08-06'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID|contains:
    - '23'
    - '26'
  selection_1:
    TargetFilename|contains:
    - '*\Terminal Server Client\Cache\*.bmc'
    - '*\Terminal Server Client\Cache\cache*.bin'
  condition: selection_0 and selection_1
