title: Windows SSH Proxy Command
id: ac520039-21f1-4567-b528-5b7133dba76f
status: stable
level: medium
author: Michael Haag, AJ King, Nasreddine Bencherchali, Splunk, Jesse Hunter, Splunk Community Contributor
description: |
  This detection identifies potential abuse of SSH "ProxyCommand" or "LocalCommand" by monitoring for suspicious process execution patterns.
  Specifically, it looks for instances where ssh.exe (as a parent process) containing "ProxyCommand" or "LocalCommand" in its arguments spawns potentially malicious child processes like mshta, powershell, wscript, or cscript, or processes containing "http" in their command line.
  This technique can be used by attackers to execute arbitrary commands through SSH proxy configurations, potentially enabling command & control activities or remote code execution. The detection focuses on commonly abused Windows scripting engines and web requests that may indicate malicious activity when spawned through SSH proxy commands.
references:
- https://www.virustotal.com/gui/file/c33f82868dbbfc3ab03918f430b1a348499f5baf047b136ff0a4fc3e8addaa9b/detection
- https://attack.mitre.org/techniques/T1572/
- https://lolbas-project.github.io/lolbas/Binaries/Ssh/
- https://man.openbsd.org/ssh_config#ProxyCommand
- https://man.openbsd.org/ssh_config#LocalCommand
tags:
- attack.T1572
- attack.T1059_001
- attack.T1105
date: '2025-03-24'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: ssh.exe
  selection_1:
    ParentCommandLine|contains: '*ProxyCommand=*'
  selection_2:
    ParentCommandLine|contains: '* PermitLocalCommand=yes*'
  selection_3:
    CommandLine|contains:
    - '*cscript*'
    - '*http*'
    - '*mshta*'
    - '*powershell*'
    - '*pwsh*'
    - '*wmic*'
    - '*wscript*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
