title: Windows File and Directory Permissions Enable Inheritance
id: 0247f90a-aca4-47b2-a94d-e30f445d7b41
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the enabling of permission inheritance using ICACLS. This analytic identifies instances where ICACLS commands are used to enable permission inheritance on files
  or directories. The /inheritance:e flag, which restores inherited permissions from a parent directory, is monitored to detect changes that might reapply broader access control settings. Enabling inheritance
  can indicate legitimate administrative actions but may also signal attempts to override restrictive custom permissions, potentially exposing sensitive files to unauthorized access.
references:
- https://www.splunk.com/en_us/blog/security/-applocker-rules-as-defense-evasion-complete-analysis.html
tags:
- attack.T1222_001
date: '2023-04-12'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - icacls.exe
    - cacls.exe
    - xcacls.exe
  selection_1:
    CommandLine|contains: '*/inheritance:e*'
  condition: selection_0 and selection_1
