title: Windows IIS Components Add New Module
id: 38fe731c-1f13-43d4-b878-a5bbe44807e3
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of AppCmd.exe to install a new module in IIS. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process
  names and command-line executions. This activity is significant as adversaries may use it to install webshells or backdoors, leading to credit card scraping, persistence, and further post-exploitation.
  If confirmed malicious, this could allow attackers to maintain persistent access, execute arbitrary code, and potentially exfiltrate sensitive information from the compromised web server.
references:
- https://www.microsoft.com/en-us/security/blog/2022/12/12/iis-modules-the-evolution-of-web-shells-and-how-to-detect-them/
- https://www.crowdstrike.com/wp-content/uploads/2022/05/crowdstrike-iceapple-a-novel-internet-information-services-post-exploitation-framework-1.pdf
- https://unit42.paloaltonetworks.com/unit42-oilrig-uses-rgdoor-iis-backdoor-targets-middle-east/
- https://www.secureworks.com/research/bronze-union
- https://github.com/redcanaryco/atomic-red-team/tree/master/atomics/T1505.004
- https://strontic.github.io/xcyclopedia/library/appcmd.exe-055B2B09409F980BF9B5A3969D01E5B2.html
tags:
- attack.T1505_004
date: '2022-12-21'
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    ParentImage:
    - msiexec.exe
    - iissetup.exe
  selection_1:
    Image: appcmd.exe
  selection_2:
    CommandLine|contains:
    - '*install *'
    - '*module *'
  selection_3:
    CommandLine|contains: '*image*'
  condition: (selection_1 and selection_2 and selection_3) and not (filter_0)
