title: Windows Chromium Process Loaded Extension via Command-Line
id: 1b8a468a-52e3-4206-b14a-73165441684c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects instances where Google Chrome is started with the --load-extension command-line flag, which allows loading unpacked or non-standard extensions. This behavior can indicate attempts to bypass enterprise extension policies, install malicious extensions, or load potentially harmful browser components. Monitoring such activity helps identify unauthorized extension usage, potential malware persistence mechanisms, or policy violations that could compromise browser security.
references:
- https://www.gdatasoftware.com/blog/2025/11/38298-learning-about-browser-hijacking
- https://peter.sh/experiments/chromium-command-line-switches/
tags:
- attack.T1185
date: '2026-01-12'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: Chrome.exe
  selection_1:
    CommandLine|contains: '*--load-extension*'
  condition: selection_0 and selection_1
