title: Windows Binary Execution from an Archive
id: 1516a16f-391e-457f-b9a3-a81dfdf218a6
status: experimental
level: medium
author: Raven Tait, Nasreddine Bencherchali, Splunk
description: |-
  Detects the execution of a binary from archive-related paths in the user's Temp directory.
  It looks for binaries launched by `explorer.exe`, `winrar.exe`, or `7zFM.exe`, where the executed process path includes Temp and archive markers such as RAR, 7z, or ZIP.
  This was abused by attackers to bypass Mark-of-the-Web (MOTW) such as CVE-2025-0411 or exploit certain vulnerabilities.
references:
- https://redcanary.com/threat-detection-report/threats/scarlet-goldfinch/
tags:
- attack.T1204_002
date: '2026-05-05'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - explorer.exe
    - winrar.exe
    - 7zFM.exe
  selection_1:
    Image|contains: '*\AppData\Local\Temp\*'
  selection_2:
    Image|contains:
    - '*\rar*'
    - '*\7z*'
    - '*.zip*'
  condition: selection_0 and selection_1 and selection_2
