title: Windows DLL Side-Loading In Calc
id: af01f6db-26ac-440e-8d89-2793e303f137
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the loading of the "WindowsCodecs.dll" by calc.exe from a non-standard location This could be indicative of a potential DLL side-loading technique. This detection
  leverages Sysmon EventCode 7 to identify the DLL side-loading activity. In previous versions of the "calc.exe" binary, namely on Windows 7, it was vulnerable to DLL side-loading, where an attacker is
  able to load an arbitrary DLL named "WindowsCodecs.dll". This technique has been observed in Qakbot malware. This activity is significant as it indicates potential malware execution through a trusted
  process, which can bypass security controls. If confirmed malicious, this could allow attackers to execute arbitrary code, maintain persistence, and escalate privileges within the environment.
references:
- https://www.bitdefender.com/blog/hotforsecurity/new-qakbot-malware-strain-replaces-windows-calculator-dll-to-infected-pcs/
- https://www.menlosecurity.com/blog/an-anatomy-of-heat-attacks-used-by-qakbot-campaigns
tags:
- attack.T1574_001
date: '2022-10-24'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image|contains: '*\calc.exe'
  selection_2:
    ImageLoaded|contains: '*\WindowsCodecs.dll'
  filter_3:
    Image:
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWOW64\*'
  filter_4:
    ImageLoaded:
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWOW64\*'
    - '*:\Windows\WinSXS\*'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3 and filter_4)
