title: Windows Modify Registry Delete Firewall Rules
id: 41c61539-98ca-4750-b3ec-7c29a2f06343
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a potential deletion of firewall rules, indicating a possible security breach or unauthorized access attempt. It identifies actions where firewall rules are removed
  using commands like netsh advfirewall firewall delete rule, which can expose the network to external threats by disabling critical security measures. Monitoring these activities helps maintain network
  integrity and prevent malicious attacks.
references:
- https://www.bleepingcomputer.com/news/security/new-shrinklocker-ransomware-uses-bitlocker-to-encrypt-your-files/
tags:
- attack.T1112
date: '2024-07-25'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 12
  selection_1:
    TargetObject|contains: '*\System\CurrentControlSet\Services\SharedAccess\Parameters\FirewallPolicy\FirewallRules\*'
  selection_2:
    EventType: DeleteValue
  condition: selection_0 and selection_1 and selection_2
