title: Windows Access Token Manipulation Winlogon Duplicate Token Handle
id: dda126d7-1d99-4f0b-b72a-4c14031f9398
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects a process attempting to access winlogon.exe to duplicate its handle. This is identified using Sysmon EventCode 10, focusing on processes targeting winlogon.exe
  with specific access rights. This activity is significant because it is a common technique used by adversaries to escalate privileges by leveraging the high privileges and security tokens associated with
  winlogon.exe. If confirmed malicious, this could allow an attacker to gain elevated privileges, potentially leading to full system compromise and unauthorized access to sensitive information.
references:
- https://docs.microsoft.com/en-us/windows/win32/api/handleapi/nf-handleapi-duplicatehandle
- https://attack.mitre.org/techniques/T1134/001/
tags:
- attack.T1134_001
date: '2022-09-01'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains:
    - '*\system32\winlogon.exe*'
    - '*\SysWOW64\winlogon.exe*'
  selection_2:
    GrantedAccess: '0x1040'
  condition: selection_0 and selection_1 and selection_2
