title: Windows Time Based Evasion
id: 34502357-deb1-499a-8261-ffe144abf561
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects potentially malicious processes that initiate a ping delay using an invalid IP address.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions involving "ping 0 -n".
  Malware like NJRAT was observed using this technique to introduce time delays for evasion tactics, such as delaying self-deletion.
  If confirmed malicious, this activity could indicate an active infection attempting to evade detection, potentially leading to further compromise and persistence within the environment.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
tags:
- attack.T1497_003
date: '2023-09-19'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: ping.exe
  selection_1:
    ParentCommandLine|contains:
    - '*ping  0 -n *'
    - '*ping 0 -n *'
    - '*ping.exe  0 -n *'
    - '*ping.exe 0 -n *'
  selection_2:
    CommandLine|contains:
    - '*ping  0 -n *'
    - '*ping 0 -n *'
    - '*ping.exe  0 -n *'
    - '*ping.exe 0 -n *'
  condition: selection_0 and selection_1 and selection_2
