title: Windows Suspicious Named Pipe
id: 3a76d52f-a007-4a65-a37d-f313c2c83f31
status: stable
level: medium
author: Raven Tait, Splunk
description: |
  The following analytic detects the creation or connection to known suspicious named pipes.
  It leverages Sysmon EventCodes 17 and 18 to identify known default pipe names used by malicious or suspicious tools.
  If confirmed malicious, this could allow an attacker to abuse these to potentially gain privilege escalation,
  persistence, c2 communications, or further system compromise.
references:
- https://attack.mitre.org/techniques/T1218/009/
- https://docs.microsoft.com/en-us/windows/win32/ipc/named-pipes
tags:
- attack.T1559
- attack.T1021_002
- attack.T1055
date: '2025-12-08'
logsource:
  product: windows
  service: sysmon
detection:
  filter_1:
    Image:
    - '*:\Program Files \(x86\)\Adobe*'
    - '*:\Program Files \(x86\)\Google*'
    - '*:\Program Files \(x86\)\Microsoft*'
    - '*:\Program Files\Adobe*'
    - '*:\Program Files\Google*'
    - '*:\Program Files\Microsoft*'
    - '*:\Windows\system32\SearchIndexer.exe'
    - '*:\Windows\System32\svchost.exe'
    - '*:\Windows\SystemApps\Microsoft*'
    - '*\Amazon\SSM\Instance*'
    - '*\AppData\Local\Google*'
    - '*\AppData\Local\Kingsoft\*'
    - '*\AppData\Local\Microsoft*'
    - System
  condition: filter_1
