title: Windows Cobalt Strike PowerShell Loader
id: a6351724-06dc-42dd-939f-679add826e76
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the PowerShell pattern used at the end of a Cobalt Strike PowerShell loader to perform the decompression of the executable.
  This loader is used in attacks such as scripted web delivery.
  Cobalt Strike is a legitimate, commercial penetration testing tool that has been largely co-opted by ransomware gangs to launch attacks.
  Cobalt Strike's popularity is mainly due to its beacons or payload being stealthy, and easily customizable.
  Cobalt Strike Beacon provides encrypted communication with the C&C server to send information and receive commands.
tags:
- attack.T1608
- attack.T1059_001
date: '2026-05-05'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains: '*));IEX (New-Object IO.StreamReader(New-Object IO.Compression.GzipStream($s,[IO.Compression.CompressionMode]::Decompress))).ReadToEnd();'
  condition: selection_0 and selection_1
