title: Windows Anonymous Pipe Activity
id: ee301e1e-cd81-4011-a911-e5f049b9e3d5
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation or connection of anonymous pipes for inter-process communication (IPC) within a Windows environment. Anonymous pipes are commonly used by legitimate
  system processes, services, and applications to transfer data between related processes. However, adversaries frequently abuse anonymous pipes to facilitate stealthy process injection, command-and-control
  (C2) communication, credential theft, or privilege escalation. This detection monitors for unusual anonymous pipe activity, particularly involving non-system processes, unsigned executables, or unexpected
  parent-child process relationships. While legitimate use cases exist—such as Windows services, software installers, or security tools—unusual or high-frequency anonymous pipe activity should be investigated
  for potential malware, persistence mechanisms, or lateral movement techniques.
references:
- https://www.trendmicro.com/en_nl/research/24/k/earth-estries.html
tags:
- attack.T1559
date: '2025-02-13'
logsource:
  product: windows
  service: sysmon
detection:
  selection_1:
    EventType|contains:
    - CreatePipe
    - ConnectPipe
  selection_2:
    PipeName|contains: '*Anonymous Pipe*'
  filter_3:
    Image:
    - C:\Program Files*
    - C:\Windows\system32\*
    - C:\Windows\syswow64\*
  condition: (selection_1 and selection_2) and not (filter_3)
