title: Windows Command Shell DCRat ForkBomb Payload
id: 2bb1a362-7aa8-444a-92ed-1987e8da83e1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of a DCRat "forkbomb" payload, which spawns multiple cmd.exe processes that launch notepad.exe instances in quick succession. This detection leverages
  Endpoint Detection and Response (EDR) data, focusing on the rapid creation of cmd.exe and notepad.exe processes within a 30-second window. This activity is significant as it indicates a potential DCRat
  infection, a known Remote Access Trojan (RAT) with destructive capabilities. If confirmed malicious, this behavior could lead to system instability, resource exhaustion, and potential disruption of services.
references:
- https://cert.gov.ua/article/405538
- https://malpedia.caad.fkie.fraunhofer.de/details/win.dcrat
- https://www.mandiant.com/resources/analyzing-dark-crystal-rat-backdoor
tags:
- attack.t1059.003
date: '2022-07-28'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.user) as user values(Processes.action) as action values(Processes.parent_process_exec) as parent_process_exec values(Processes.parent_process_guid) as parent_process_guid values(Processes.parent_process_id) as parent_process_id values(Processes.parent_process_path) as parent_process_path values(Processes.process) as process values(Processes.process_exec) as process_exec values(Processes.process_guid) as process_guid values(Processes.process_hash) as process_hash values(Processes.process_id) as process_id values(Processes.process_integrity_level) as process_integrity_level values(Processes.process_path) as process_path values(Processes.user_id) as user_id values(Processes.vendor_product) as vendor_product dc(Processes.parent_process_id) as parent_process_id_count dc(Processes.process_id) as process_id_count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.parent_process_name= "cmd.exe" (Processes.process_name = "notepad.exe"
      OR
      Processes.original_file_name= "notepad.exe") Processes.parent_process = "*.bat*"
    BY Processes.parent_process_name Processes.process_name Processes.original_file_name
       Processes.parent_process Processes.dest Processes.user
       _time span=30s
  | where parent_process_id_count>= 10 AND process_id_count >=10
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_command_shell_dcrat_forkbomb_payload_filter`
splunk_rule_id: 2bb1a362-7aa8-444a-92ed-1987e8da83e1
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: cmd.exe
  selection_1:
    Image: notepad.exe
  selection_2:
    OriginalFileName: notepad.exe
  selection_3:
    ParentCommandLine|contains: .bat
  condition: selection_0 and selection_1 and selection_2 and selection_3
