title: Windows Indirect Command Execution Via Series Of Forfiles
id: bfdaabe7-3db8-48c5-80c1-220f9b8f22be
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects excessive usage of the forfiles.exe process, which is often indicative of post-exploitation activities. The detection leverages data from Endpoint Detection and
  Response (EDR) agents, focusing on process execution logs that include process GUID, process name, and parent process. This activity is significant because forfiles.exe can be abused to execute commands
  on multiple files, a technique used by ransomware like Prestige. If confirmed malicious, this behavior could allow attackers to enumerate files, potentially leading to data exfiltration or further malicious
  actions.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/forfiles
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
- attack.T1202
date: '2022-12-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: forfiles.exe
  selection_1:
    OriginalFileName: forfiles.exe
  condition: selection_0 and selection_1
