title: Windows Process Execution From ProgramData
id: 237016fa-d8e6-47b4-80f9-70c4d42c72c0
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic identifies processes running from file paths within
  the ProgramData directory, a common location abused by adversaries for executing
  malicious code while evading detection. Threat actors often drop and execute payloads
  from this directory to bypass security controls, as it typically has write permissions
  for standard users. While this behavior can indicate malware execution or persistence
  techniques, it is important to note that some legitimate software, installers, and
  update mechanisms also run from ProgramData, leading to potential false positives.
  Security teams should validate detections by correlating with other indicators,
  such as unusual parent processes, unsigned binaries, or anomalous network activity.
references:
- https://www.microsoft.com/en-us/security/blog/2023/05/24/volt-typhoon-targets-us-critical-infrastructure-with-living-off-the-land-techniques/
tags:
- attack.t1036.005
date: '2021-05-07'
original_spl: |-
  | tstats `security_content_summariesonly` count values(Processes.process_name)
  as process_name values(Processes.process) as process min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where

  Processes.process_path = "*:\\ProgramData\\*"

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_process_execution_from_programdata_filter`
splunk_rule_id: 237016fa-d8e6-47b4-80f9-70c4d42c72c0
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains: :\ProgramData\
  condition: selection_0
