title: Windows Handle Duplication in Known UAC-Bypass Binaries
id: d7369bf5-1315-4138-b927-2dd8bb8c1da7
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious handle duplication activity targeting known Windows utilities such as ComputerDefaults.exe, Eventvwr.exe, and others. This technique is commonly used
  to escalate privileges or bypass UAC by inheriting or injecting elevated tokens or handles. The detection focuses on non-standard use of DuplicateHandle or token duplication where process, thread, or
  token handles are copied into the context of trusted, signed utilities. Such behavior may indicate attempts to execute with elevated rights without user consent. Alerts enable rapid triage using process
  trees, handle data, token attributes, command-lines, and binary hashes.
references:
- https://www.recordedfuture.com/research/from-castleloader-to-castlerat-tag-150-advances-operations
tags:
- attack.T1134_001
date: '2025-11-07'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains:
    - '*\ComputerDefaults.exe'
    - '*\eventvwr.exe*'
    - '*\fodhelper.exe'
    - '*\slui.exe'
    - '*\sdclt.exe'
    - '*\mmc.exe'
    - '*\colorcpl.exe'
    - '*\wsreset.exe'
    - '*\esentutl.exe'
    - '*\PkgMgr.exe'
  filter_2:
    SourceImage:
    - '*C:\Windows\system32\*'
    - '*C:\Windows\syswow64\*'
    - '*C:\Program Files\*'
    - '*C:\Program Files (x86)\*'
    - '%systemroot%\*'
  condition: (selection_0 and selection_1) and not (filter_2)
