title: Windows Time Based Evasion via Choice Exec
id: d5f54b38-10bf-4b3a-b6fc-85949862ed50
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of choice.exe in batch files as a delay tactic, a technique observed in SnakeKeylogger malware. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential time-based evasion techniques used by malware to avoid detection. If confirmed
  malicious, this behavior could allow attackers to execute code stealthily, delete malicious files, and persist on compromised hosts, making it crucial for SOC analysts to investigate promptly.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/choice
- https://malpedia.caad.fkie.fraunhofer.de/details/win.404keylogger
tags:
- attack.T1497_003
date: '2021-08-24'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: choice.exe
  selection_1:
    CommandLine|contains: '*/T*'
  selection_2:
    CommandLine|contains: '*/N*'
  condition: selection_0 and selection_1 and selection_2
