title: Windows AdFind Exe
id: bd3b0187-189b-46c0-be45-f52da2bae67f
status: stable
level: medium
author: Jose Hernandez, Bhavin Patel, Nasreddine Bencherchali, Splunk
description: The following analytic identifies the execution of `adfind.exe` standalone or with specific command-line arguments related to Active Directory queries. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names, command-line arguments, and parent Processes. This activity is significant because `adfind.exe` is a powerful tool often used by threat actors like
  Wizard Spider and FIN6 to gather sensitive AD information. If confirmed malicious, this activity could allow attackers to map the AD environment, facilitating further attacks such as privilege escalation
  or lateral movement.
references:
- https://www.volexity.com/blog/2020/12/14/dark-halo-leverages-solarwinds-compromise-to-breach-organizations/
- https://www.mandiant.com/resources/a-nasty-trick-from-credential-theft-malware-to-business-disruption
- https://www.joeware.net/freetools/tools/adfind/index.htm
- https://thedfirreport.com/2023/05/22/icedid-macro-ends-in-nokoyawa-ransomware/
tags:
- attack.T1018
date: '2020-12-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: AdFind.exe
  selection_1:
    OriginalFileName: AdFind.exe
  selection_2:
    CommandLine:
    - '* -f *'
    - '* /f*'
    CommandLine|contains: '*objectcategory=*'
  selection_3:
    CommandLine:
    - '* -sc *'
    - '* /sc *'
    - '* -gcb *'
    - '* /gcb *'
  selection_4:
    CommandLine:
    - '* -sc *'
    - '* /sc *'
    - '* trustdmp*'
    - '* dclist*'
    - '* dcdmp*'
    - '* adobjcnt*'
    - '* adamobjcnt*'
    - '* sdump*'
    - '* exchaddresses*'
    - '* getacl*'
    - '* domainlist*'
    - '* export_user*'
    - '* export_group*'
    - '* admincountdmp*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
