title: Windows NorthStar C2 Agent Execution
id: 5f13d5b2-5181-487b-89eb-e2b471522202
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the initial agent or persistent agent processes for Northstar C2 being run.
  NorthStarC2 is an open-source command and control framework developed for penetration testing and red teaming purposes by Engin Demirbilek.
  NorthStar C2 Framework consists of two applications, a server-side GUI web application for managing sessions and a client-side stager to communicate with C2 server.
references:
- https://github.com/EnginDemirbilek/NorthStarC2/
tags:
- attack.t1204.002
- attack.t1547.001
- attack.t1608
date: '2021-06-23'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.original_file_name="NorthstarStager.exe"
  OR
  Processes.process_name IN (
      "NorthstarStager.exe",
      "SystemHealthCheck.exe"
  )

  by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name Processes.parent_process
     Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_northstar_c2_agent_execution_filter`
splunk_rule_id: 5f13d5b2-5181-487b-89eb-e2b471522202
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: NorthstarStager.exe
  selection_1:
    Image:
    - NorthstarStager.exe
    - SystemHealthCheck.exe
  condition: selection_0 and selection_1
