title: Windows Account Discovery With NetUser PreauthNotRequire
id: cf056b65-44b2-4d32-9172-d6b6f081a376
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the PowerView PowerShell cmdlet Get-NetUser with the -PreauthNotRequire parameter, leveraging Event ID 4104. This method identifies attempts
  to query Active Directory user accounts that do not require Kerberos preauthentication. Monitoring this activity is crucial as it can indicate reconnaissance efforts by an attacker to identify potentially
  vulnerable accounts. If confirmed malicious, this behavior could lead to further exploitation, such as unauthorized access or privilege escalation within the network.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-347a
tags:
- attack.T1087
date: '2024-01-10'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*Get-NetUser*'
  selection_2:
    ScriptBlockText|contains: '*-PreauthNotRequire*'
  condition: selection_0 and selection_1 and selection_2
