title: Windows Unusual Process Load Mozilla NSS-Mozglue Module
id: 1a7e7650-b81d-492e-99d4-d5ab633afbdd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies processes loading Mozilla NSS-Mozglue libraries such as mozglue.dll and nss3.dll. It leverages Sysmon Event logs, specifically monitoring EventCode 7, which
  tracks image loaded events. This activity is significant because it can indicate unauthorized access or manipulation of these libraries, which are commonly used by Mozilla applications like Firefox and
  Thunderbird. If confirmed malicious, this could lead to data exfiltration, credential theft, or further compromise of the system.
references:
- https://www.trendmicro.com/vinfo/nz/threat-encyclopedia/malware/trojanspy.win32.vidar.yxdftz
tags:
- attack.T1218_003
date: '2021-05-13'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains:
    - '*\mozglue.dll'
    - '*\nss3.dll'
  filter_2:
    Image:
    - '*:\Program Files\Mozilla Firefox\firefox.exe'
    - '*:\Program Files (x86)\Mozilla Firefox\firefox.exe'
    - '*:\Program Files\Mozilla Thunderbird\thunderbird.exe'
    - '*:\Program Files (x86)\Mozilla Thunderbird\thunderbird.exe'
    - '*\Tor Browser\Browser\firefox.exe'
    - '*:\Program Files\Code42\CrashPlan\Code42Service.exe'
    - '*:\Program Files (x86)\Code42\CrashPlan\Code42Service.exe'
    - '*:\Program Files\Pale Moon\palemoon.exe'
    - '*:\Program Files (x86)\Pale Moon\palemoon.exe'
    - '*:\Program Files\Waterfox\waterfox.exe'
    - '*:\Program Files (x86)\Waterfox\waterfox.exe'
    - '*:\Program Files\Cyberfox\cyberfox.exe'
    - '*:\Program Files (x86)\Cyberfox\cyberfox.exe'
    - '*\AppData\Local\slack\slack.exe'
    - '*:\Program Files (x86)\VMware\VMware Horizon View Client\vmware-view.exe'
    - '*:\Program Files (x86)\Dropbox\Client\Dropbox.exe'
    - '*:\Program Files\Google\Google Earth Pro\client\googleearth.exe'
  condition: (selection_0 and selection_1) and not (filter_2)
