title: Windows Office Product Loading VBE7 DLL
id: 7cfec906-2697-43f7-898b-83634a051d9a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies office documents executing macro code. It leverages Sysmon EventCode 7 to detect when processes like WINWORD.EXE or EXCEL.EXE load specific DLLs associated
  with macros (e.g., VBE7.DLL). This activity is significant because macros are a common attack vector for delivering malicious payloads, such as malware. If confirmed malicious, this could lead to unauthorized
  code execution, data exfiltration, or further compromise of the system. Disabling macros by default is recommended to mitigate this risk.
references:
- https://www.joesandbox.com/analysis/386500/0/html
- https://www.joesandbox.com/analysis/702680/0/html
- https://bazaar.abuse.ch/sample/02cbc1ab80695fc12ff8822b926957c3a600247b9ca412a137f69cb5716c8781/
- https://www.fortinet.com/blog/threat-research/latest-remcos-rat-phishing
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/trojanized-onenote-document-leads-to-formbook-malware/
- https://www.fortinet.com/blog/threat-research/leveraging-microsoft-office-documents-to-deliver-agent-tesla-and-njrat
tags:
- attack.T1566_001
date: '2021-04-14'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image|contains:
    - EQNEDT32.exe
    - excel.exe
    - Graph.exe
    - msaccess.exe
    - mspub.exe
    - onenote.exe
    - onenoteim.exe
    - onenotem.exe
    - outlook.exe
    - powerpnt.exe
    - visio.exe
    - winproj.exe
    - winword.exe
  selection_2:
    loaded_file_path|contains:
    - '*\VBE7INTL.DLL'
    - '*\VBE7.DLL'
    - '*\VBEUI.DLL'
  condition: selection_0 and selection_1 and selection_2
