title: Windows SubInAcl Execution
id: 12491419-1a6f-4af4-afc3-4e2052f0610e
status: stable
level: medium
author: Nasreddine Bencherchali, Michael Haag, Splunk
description: The following analytic detects the execution of the SubInAcl utility. SubInAcl is a legacy Windows Resource Kit tool from the Windows 2003 era, used to manipulate security descriptors of securable
  objects. It leverages data from Endpoint Detection and Response (EDR) agents, specifically searching for any process execution involving "SubInAcl.exe" binary. This activity can be significant because
  the utility should be rarely found on modern Windows machines, which mean any execution could potentially be considered suspicious. If confirmed malicious, this could allow an attacker to blind defenses
  by tampering with EventLog ACLs or modifying the access to a previously denied resource.
references:
- https://www.pwc.com/gx/en/issues/cybersecurity/cyber-threat-intelligence/cyber-year-in-retrospect/yir-cyber-threats-report-download.pdf
- https://attack.mitre.org/techniques/T1222/001/
tags:
- attack.T1222_001
date: '2020-04-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: subinacl.exe
  selection_1:
    OriginalFileName: SubInAcl.exe
  condition: selection_0 and selection_1
