title: Windows High File Deletion Frequency
id: 45b125c4-866f-11eb-a95a-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic identifies a high frequency of file deletions by monitoring Sysmon EventCodes 23 and 26 for specific file extensions. This detection leverages Sysmon logs to track deleted
  target filenames, process names, and process IDs. Such activity is significant as it often indicates ransomware behavior, where files are encrypted and the originals are deleted. If confirmed malicious,
  this activity could lead to extensive data loss and operational disruption, as ransomware can render critical files inaccessible, demanding a ransom for their recovery.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.T1485
date: '2021-03-19'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID|contains:
    - '23'
    - '26'
  selection_1:
    TargetFilename|contains:
    - '*.cmd'
    - '*.ini'
    - '*.gif'
    - '*.jpg'
    - '*.jpeg'
    - '*.db'
    - '*.ps1'
    - '*.doc'
    - '*.docx'
    - '*.xls'
    - '*.xlsx'
    - '*.ppt'
    - '*.pptx'
    - '*.bmp'
    - '*.zip'
    - '*.rar'
    - '*.7z'
    - '*.chm'
    - '*.png'
    - '*.log'
    - '*.vbs'
    - '*.js'
    - '*.vhd'
    - '*.bak'
    - '*.wbcat'
    - '*.bkf'
    - '*.backup*'
    - '*.dsk'
    - '*.win'
  filter_2:
    TargetFilename: '*\INetCache\Content.Outlook\*'
  condition: (selection_0 and selection_1) and not (filter_2)
