title: Windows Account Access Removal via Logoff Exec
id: 223572ab-8768-4e20-9b39-c38707af80dc
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the process of logging off a user through the use of the quser and logoff commands. By monitoring for these commands, the analytic identifies actions where a
  user session is forcibly terminated, which could be part of an administrative task or a potentially unauthorized access attempt. This detection helps identify potential misuse or malicious activity where
  a user’s access is revoked without proper authorization, providing insight into potential security incidents involving account management or session manipulation.
references:
- https://devblogs.microsoft.com/scripting/automating-quser-through-powershell/
tags:
- attack.T1059_001
- attack.T1531
date: '2024-12-13'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: logoff.exe
  selection_1:
    ParentImage|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
  condition: selection_0 and selection_1
