title: Windows Remote Service Rdpwinst Tool Execution
id: c8127f87-c7c9-4036-89ed-8fe4b30e678c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the RDPWInst.exe tool, which is an RDP wrapper library used to enable remote desktop host support and concurrent RDP sessions. This detection
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names, original file names, and specific command-line arguments. This activity is significant because adversaries
  can abuse this tool to establish unauthorized RDP connections, facilitating remote access and potential lateral movement within the network. If confirmed malicious, this could lead to unauthorized access,
  data exfiltration, and further compromise of the targeted host.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
tags:
- attack.t1021.001
date: '2022-07-06'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name="RDPWInst.exe"
          OR
          Processes.original_file_name="RDPWInst.exe"
      )
      AND Processes.process IN ("* -i*", "* -s*", "* -o*", "* -w*", "* -r*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_remote_service_rdpwinst_tool_execution_filter`
splunk_rule_id: c8127f87-c7c9-4036-89ed-8fe4b30e678c
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: RDPWInst.exe
  selection_1:
    OriginalFileName: RDPWInst.exe
  selection_2:
    CommandLine|contains:
    - ' -i'
    - ' -s'
    - ' -o'
    - ' -w'
    - ' -r'
  condition: selection_0 and selection_1 and selection_2
