title: Windows New Deny Permission Set On Service SD Via Sc.EXE
id: d0f6a5e5-dbfd-46e1-8bd5-2e2905947c33
status: stable
level: medium
author: Nasreddine Bencherchali, Michael Haag, Splunk
description: |
  The following analytic detects changes in a service security descriptor where a new deny ace has been added.
  It leverages data from Endpoint Detection and Response (EDR) agents, specifically searching for any process execution involving the "sc.exe" binary with the "sdset" flag targeting any service and adding a dedicated deny ace to specific groups.
  If confirmed malicious, this could allow an attacker to escalate their privileges, blind defenses and more.
  Investigate appropariate services and groups to determine if the behavior is malicious.
references:
- https://www.sans.org/blog/red-team-tactics-hiding-windows-services/
- https://news.sophos.com/wp-content/uploads/2020/06/glupteba_final-1.pdf
- https://attack.mitre.org/techniques/T1564/
tags:
- attack.T1564
date: '2024-12-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: sc.exe
  selection_1:
    OriginalFileName: sc.exe
  selection_2:
    CommandLine|contains: '*sdset *'
  selection_3:
    CommandLine|contains: '*(D;*'
  selection_4:
    CommandLine|contains:
    - '*;IU*'
    - '*;S-1-5-4*'
    - '*;SU*'
    - '*;S-1-5-6*'
    - '*;BA*'
    - '*;S-1-5-32-544*'
    - '*;SY*'
    - '*;S-1-5-18*'
    - '*;WD*'
    - '*;S-1-1-0*'
    - '*;AU*'
    - '*;S-1-5-11*'
    - '*;LS*'
    - '*;S-1-5-19*'
  filter_5:
    CommandLine:
    - '*macmnsvc*'
    - '*masvc*'
    - '*McAfeeFramework*'
    - '*mfefire*'
    - '*mfemms*'
    - '*mfevtp*'
  condition: (selection_0 and selection_1 and selection_2 and selection_3 and selection_4) and not (filter_5)
