title: Windows Rundll32 WebDav With Network Connection
id: f03355e0-28b5-4e9b-815a-6adffc63b38c
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of rundll32.exe with command-line arguments loading davclnt.dll and the davsetcookie function to access a remote WebDav instance. It uses data from
  Endpoint Detection and Response (EDR) agents, correlating process execution and network traffic data. This activity is significant as it may indicate exploitation of CVE-2023-23397, a known vulnerability.
  If confirmed malicious, this could allow an attacker to establish unauthorized remote connections, potentially leading to data exfiltration or further network compromise.
references:
- https://strontic.github.io/xcyclopedia/library/davclnt.dll-0EA3050E7CC710526E330C413C165DA0.html
- https://twitter.com/ACEResponder/status/1636116096506818562?s=20
- https://twitter.com/domchell/status/1635999068282408962?s=20
- https://msrc.microsoft.com/blog/2023/03/microsoft-mitigates-outlook-elevation-of-privilege-vulnerability/
- https://www.pwndefend.com/2023/03/15/the-long-game-persistent-hash-theft/
tags:
- attack.T1048_003
date: '2023-09-15'
logsource:
  category: all_traffic
  product: windows
detection:
  selection_0:
    ParentImage: svchost.exe
  selection_1:
    CommandLine|contains:
    - '*\windows\system32\davclnt.dll,*davsetcookie*'
    - '*\windows\syswow64\davclnt.dll,*davsetcookie*'
  condition: selection_0 and selection_1
