title: Windows Process With NetExec Command Line Parameters
id: adbff89c-c1f2-4a2e-88a4-b5e645856510
status: stable
level: medium
author: Steven Dick, Github Community
description: The following analytic detects the use of NetExec (formally CrackmapExec) a toolset used for post-exploitation enumeration and attack within Active Directory environments through command line
  parameters. It leverages Endpoint Detection and Response (EDR) data to identify specific command-line arguments associated with actions like ticket manipulation, kerberoasting, and password spraying.
  This activity is significant as NetExec is used by adversaries to exploit Kerberos for privilege escalation and lateral movement. If confirmed malicious, this could lead to unauthorized access, persistence,
  and potential compromise of sensitive information within the network.
references:
- https://www.netexec.wiki/
- https://www.johnvictorwolfe.com/2024/07/21/the-successor-to-crackmapexec/
- https://attack.mitre.org/software/S0488/
tags:
- attack.t1550.003
- attack.t1558.003
- attack.t1558.004
date: '2024-12-27'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) AS firstTime, max(_time) AS lastTime FROM datamodel=Endpoint.Processes
    WHERE NOT Processes.os="Linux" Processes.process_name IN ("nxc.exe")
      OR
      Processes.original_file_name IN ("nxc.exe")
      OR
      (Processes.process IN ("* smb *","* ssh *","* ldap *","* ftp *","* wmi *","* winrm *","* rdp *","* vnc *","* mssql *","* nfs *")
      AND
      ((Processes.process = "* -p *"
      AND
      Processes.process = "* -u *")
      OR
      Processes.process IN ("* -x *","* -M *","* --*")))
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_process_with_netexec_command_line_parameters_filter`
splunk_rule_id: adbff89c-c1f2-4a2e-88a4-b5e645856510
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Processes.os: Linux
    Image: nxc.exe
  selection_1:
    OriginalFileName: nxc.exe
  selection_2:
    CommandLine:
    - '* smb *'
    - '* ssh *'
    - '* ldap *'
    - '* ftp *'
    - '* wmi *'
    - '* winrm *'
    - '* rdp *'
    - '* vnc *'
    - '* mssql *'
    - '* nfs *'
  condition: selection_0 and selection_1 and selection_2
