title: Windows Alternate DataStream - Process Execution
id: 30c32c5c-41fe-45db-84fe-275e4320da3f
status: stable
level: medium
author: Steven Dick
description: The following analytic detects when a process attempts to execute a file from within an NTFS file system alternate data stream. This detection leverages process execution data from sources
  like Windows process monitoring or Sysmon Event ID 1, focusing on specific processes known for such behavior. This activity is significant because alternate data streams can be used by threat actors to
  hide malicious code, making it difficult to detect. If confirmed malicious, this could allow an attacker to execute hidden code, potentially leading to unauthorized actions and further compromise of the
  system.
references:
- https://gist.github.com/api0cradle/cdd2d0d0ec9abb686f0e89306e277b8f
- https://car.mitre.org/analytics/CAR-2020-08-001/
- https://blogs.juniper.net/en-us/threat-research/bitpaymer-ransomware-hides-behind-windows-alternate-data-streams
- https://blog.netwrix.com/2022/12/16/alternate_data_stream/
tags:
- attack.T1564_004
date: '2024-01-10'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: unknown
  selection_1:
    Image|contains:
    - appvlp.exe
    - bitsadmin.exe
    - control.exe
    - cscript.exe
    - forfiles.exe
    - ftp.exe
    - mavinject.exe
    - mshta.exe
    - powershell_ise.exe
    - powershell.exe
    - pwsh.exe
    - regini.exe
    - regsvr32.exe
    - rundll32.exe
    - sc.exe
    - wmic.exe
    - wscript.exe
  condition: selection_0 and selection_1
