title: Windows ScManager Security Descriptor Tampering Via Sc.EXE
id: 04023928-0381-4935-82cb-03372b2ef644
status: stable
level: medium
author: Nasreddine Bencherchali, Michael Haag, Splunk
description: The following analytic detects changes in the ScManager service security descriptor settings. It leverages data from Endpoint Detection and Response (EDR) agents, specifically searching for
  any process execution involving the "sc.exe" binary with the "sdset" flag targeting the "scmanager" service. If confirmed malicious, this could allow an attacker to escalate their privileges.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/8ac5c4f84692b11ea2832d18d3dc6f1ce7fb4e41/atomics/T1569.002/T1569.002.md#atomic-test-7---modifying-acl-of-service-control-manager-via-sdet
- https://0xv1n.github.io/posts/scmanager/
- https://attack.mitre.org/techniques/T1569/002/
tags:
- attack.t1569.002
date: '2024-12-06'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name=sc.exe
          OR
          Processes.original_file_name=sc.exe
      )
      Processes.process="*sdset *" Processes.process="*scmanager*"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_scmanager_security_descriptor_tampering_via_sc_exe_filter`
splunk_rule_id: 04023928-0381-4935-82cb-03372b2ef644
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: sc.exe
  selection_1:
    OriginalFileName: sc.exe
  selection_2:
    CommandLine|contains: 'sdset '
  selection_3:
    CommandLine|contains: scmanager
  condition: selection_0 and selection_1 and selection_2 and selection_3
