title: Windows RMM Tool Execution
id: 4afbd373-b769-4f82-8375-41e0153e46f9
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects process creation events of various remote access tools.
  Remote management tools, when used for legitimate purposes, can help IT professionals and system administrators remotely access and manage computer systems.
  However, threat actors may exploit these tools for malicious purposes.
references:
- https://github.com/LivingInSyn/RMML/tree/main/RMMs
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-320a
- https://www.synacktiv.com/en/publications/legitimate-rats-a-comprehensive-forensic-analysis-of-the-usual-suspects
tags:
- attack.T1219
date: '2026-05-05'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 1
  selection_1:
    Company|contains:
    - AmidaWare*
    - Ammyy LLC*
    - AnyDesk Software*
    - ATERA Networks*
    - bomgar*
    - FleetDeck*
    - GoTo, Inc*
    - IDrive Inc*
    - LogMeIn, Inc*
    - MMSOFT Design*
    - N-able*
    - NetSupport Ltd*
    - NinjaRMM*
    - Remote Utilities*
    - SimpleHelp*
    - Servably*
    - ScreenConnect*
    - Splashtop*
    - TeamViewer Germany*
    - ZOHO Corporation*
  selection_2:
    Description|contains:
    - Advanced Monitoring Agent*
    - AnyDesk*
    - Ammyy Admin*
    - AteraAgent*
    - BeyondTrust Remote Support*
    - FleetDeck*
    - GoToAssist*
    - GoToMyPC*
    - Kaseya Live Connect*
    - N-able*
    - NetSupport Client Application*
    - NinjaRMM*
    - Pulseway*
    - RemotePC*
    - Remote Utilities*
    - ScreenConnect*
    - SimpleHelp Remote*
    - Splashtop*
    - Tactical RMM Agentz*
    - Take Control Agent*
    - Zoho Assist*
  selection_3:
    Product|contains:
    - Advanced Monitoring Agent*
    - AnyDesk*
    - Ammyy Admin*
    - AteraAgent*
    - BeyondTrust Remote Support*
    - FleetDeck*
    - GoToAssist*
    - GoToMyPC*
    - Kaseya Live Connect*
    - NetSupport Remote Control*
    - NetSupport Manager*
    - NinjaRMM*
    - Pulseway*
    - Remote Access*
    - Remote Support*
    - Remote Utilities*
    - RemotePC*
    - Syncro*
    - ScreenConnect*
    - Splashtop*
    - Tactical RMM Agent*
    - Take Control Agent*
    - TeamViewer*
    - Zoho Assist*
  selection_4:
    Image|contains:
    - '*AgentPackage*'
    - '*AnyDesk.exe*'
    - '*AteraAgent.exe*'
    - '*BASupSrvc*'
    - '*fleetdeck*'
    - '*level.exe*'
    - '*MeshAgent*'
    - '*MspPlatform\PME\Installers*'
    - '*NableCommand*'
    - '*N-able Technologies*'
    - '*NinjaRMM*'
    - '*nxexec.exe*'
    - '*nxserv*'
    - '*nxplayer*'
    - '*PCMonitor*'
    - '*Pulseway*'
    - '*remcmdstub.exe*'
    - '*rustdesk.exe*'
    - '*ScreenConnect*'
    - '*Splashtop*'
    - '*SRAgent.exe*'
    - '*tacticalrmm.exe*'
    - '*TakeControlTechConsole*'
    - '*tailscale*'
    - '*TeamViewer*'
    - '*ZA_Connect*'
    - '*ZMAgent*'
    - '*ZohoMeeting*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
