title: Windows Password Policy Discovery with Net
id: e52f7865-be78-46bf-b7ed-150fbe447613
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Nasreddine Bencherchali, Splunk
description: The following analytic identifies the execution of `net.exe` with command line arguments aimed at obtaining the computer or domain password policy. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential reconnaissance efforts by adversaries to gather information about
  Active Directory password policies. If confirmed malicious, this behavior could allow attackers to understand password complexity requirements, aiding in brute-force or password-guessing attacks, ultimately
  compromising user accounts and gaining unauthorized access to the network.
references:
- https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
tags:
- attack.T1201
date: '2021-08-27'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*accounts*'
  filter_1:
    CommandLine:
    - '*/FORCELOGOFF*'
    - '*/MINPWLEN*'
    - '*/MAXPWAGE*'
    - '*/MINPWAGE*'
    - '*/UNIQUEPW*'
  condition: (selection_0) and not (filter_1)
