title: Windows Possible Credential Dumping
id: e4723b92-7266-11ec-af45-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects potential credential dumping by identifying specific GrantedAccess permission requests and CallTrace DLLs targeting the LSASS process. It leverages Sysmon EventCode
  10 logs, focusing on access requests to lsass.exe and call traces involving debug and native API DLLs like dbgcore.dll, dbghelp.dll, and ntdll.dll. This activity is significant as credential dumping can
  lead to unauthorized access to sensitive credentials. If confirmed malicious, attackers could gain elevated privileges and persist within the environment, posing a severe security risk.
references:
- https://en.wikipedia.org/wiki/Local_Security_Authority_Subsystem_Service
- https://docs.microsoft.com/en-us/windows/win32/api/minidumpapiset/nf-minidumpapiset-minidumpwritedump
- https://cyberwardog.blogspot.com/2017/03/chronicles-of-threat-hunter-hunting-for_22.html
- https://raw.githubusercontent.com/PowerShellMafia/PowerSploit/master/Exfiltration/Invoke-Mimikatz.ps1
- https://docs.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights?redirectedfrom=MSDN
- https://github.com/redcanaryco/AtomicTestHarnesses/blob/master/Windows/TestHarnesses/T1003.001_DumpLSASS/DumpLSASS.ps1
tags:
- attack.T1003_001
date: '2022-01-11'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains: '*\lsass.exe'
  selection_2:
    granted_access|contains:
    - '0x01000'
    - '0x1010'
    - '0x1038'
    - '0x40'
    - '0x1400'
    - '0x1fffff'
    - '0x1410'
    - '0x143a'
    - '0x1438'
    - '0x1000'
  selection_3:
    CallTrace|contains:
    - '*dbgcore.dll*'
    - '*dbghelp.dll*'
    - '*ntdll.dll*'
    - '*kernelbase.dll*'
    - '*kernel32.dll*'
  filter_4:
    SourceUser:
    - NT AUTHORITY\SYSTEM
    - NT AUTHORITY\NETWORK SERVICE
  condition: (selection_0 and selection_1 and selection_2 and selection_3) and not (filter_4)
