title: Windows Shell or Script Execution From IIS Directory
id: f058f7f9-d5cf-4a79-a720-24e93e87c8bf
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects Windows command tools such as cmd, PowerShell, or pwsh being executed from the IIS installation directory.
  This can be indicative of exploitation of software reliant on IIS such as Exchange.
tags:
- attack.t1190
- attack.t1505.004
date: '2021-09-02'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.process_current_directory="*:\\Windows\\System32\\inetsrv\\*"
  Processes.parent_process_name IN (
      "cmd.exe",
      "powershell.exe",
      "pwsh.exe"
  )

  by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name Processes.parent_process
     Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_shell_or_script_execution_from_iis_directory_filter`
splunk_rule_id: f058f7f9-d5cf-4a79-a720-24e93e87c8bf
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Processes.process_current_directory|contains: :\Windows\System32\inetsrv\
  selection_1:
    ParentImage:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
  condition: selection_0 and selection_1
