title: Windows Chrome Enable Extension Loading via Command-Line
id: da355155-1d23-48f9-bf95-e534ae273ab0
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects instances where Google Chrome is started with the --disable-features=DisableLoadExtensionCommandLineSwitch flag, effectively enabling the loading of extensions via the command line.
  This may indicate attempts to bypass enterprise extension policies, load unauthorized or malicious extensions, or manipulate browser behavior.
  Monitoring this activity helps identify potential security policy violations, malware persistence techniques, or other suspicious Chrome modifications.
references:
- https://www.gdatasoftware.com/blog/2025/11/38298-learning-about-browser-hijacking
tags:
- attack.t1185
date: '2026-01-12'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime
  from datamodel=Endpoint.Processes where
    Processes.process_name = "Chrome.exe"
    Processes.process= "*--disable-features*"
    Processes.process= "*DisableLoadExtensionCommandLineSwitch*"
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
     Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_chrome_enable_extension_loading_via_command_line_filter`
splunk_rule_id: da355155-1d23-48f9-bf95-e534ae273ab0
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: Chrome.exe
  selection_1:
    CommandLine|contains: --disable-features
  selection_2:
    CommandLine|contains: DisableLoadExtensionCommandLineSwitch
  condition: selection_0 and selection_1 and selection_2
