title: Windows NirSoft AdvancedRun
id: bb4f3090-7ae4-11ec-897f-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of AdvancedRun.exe, a tool with capabilities similar to remote administration programs like PsExec. It identifies the process by its name or original
  file name and flags common command-line arguments. This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and command-line telemetry. Monitoring this activity
  is crucial as AdvancedRun can be used for remote code execution and configuration-based automation. If malicious, this could allow attackers to execute arbitrary commands, escalate privileges, or maintain
  persistence within the environment.
references:
- http://www.nirsoft.net/utils/advanced_run.html
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.T1588_002
date: '2022-01-24'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: advancedrun.exe
  selection_1:
    OriginalFileName: advancedrun.exe
  selection_2:
    CommandLine|contains:
    - '*EXEFilename*'
    - '*/cfg*'
    - '*RunAs*'
    - '*WindowState*'
  condition: selection_0 and selection_1 and selection_2
