title: Windows VSSVC Process Accessing Defender Engine
id: 0c398be7-e33a-4882-9546-12166ceaf73c
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects vssvc.exe opening a handle to MsMpEng.exe.
  In the RedSun exploit, VSS participates in the cloud-file restore race that directs WD to write through the NTFS junction.
  This handle acquisition is observed at the exact moment of exploitation.
  vssvc querying MsMpEng is not expected in normal operation.
references:
- https://github.com/Nightmare-Eclipse/RedSun
- https://www.huntress.com/blog/nightmare-eclipse-intrusion
tags:
- attack.T1068
date: '2026-05-01'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains: '*\MsMpEng.exe'
  selection_2:
    SourceImage|contains: '*\vssvc.exe'
  condition: selection_0 and selection_1 and selection_2
