title: Windows Attempt To Stop Security Service
id: 9ed27cea-4e27-4eff-b2c6-aac9e78a7517
status: stable
level: medium
author: Rico Valdez, Nasreddine Bencherchali, Splunk
description: The following analytic detects attempts to stop security-related services on an endpoint, which may indicate malicious activity. It leverages data from Endpoint Detection and Response (EDR)
  agents, specifically searching for processes involving the "sc.exe" or "net.exe" command with the "stop" parameter or the PowerShell "Stop-Service" cmdlet. This activity is significant because disabling
  security services can undermine the organization's security posture, potentially leading to unauthorized access, data exfiltration, or further attacks like malware installation or privilege escalation.
  If confirmed malicious, this behavior could compromise the endpoint and the entire network, necessitating immediate investigation and response.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.md#atomic-test-14---disable-arbitrary-security-windows-service
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.t1685
date: '2020-04-29'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          (`process_net`
          OR
          `process_sc`) Processes.process="* stop *"
      )
      OR Processes.process="*Stop-Service *"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | lookup security_services_lookup service as process OUTPUTNEW category, description
  | search category=security
  | `windows_attempt_to_stop_security_service_filter`
splunk_rule_id: 9ed27cea-4e27-4eff-b2c6-aac9e78a7517
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '* stop *'
  selection_1:
    CommandLine|contains: 'Stop-Service '
  condition: selection_0 and selection_1
