title: Windows ConvertTo-AADIntBackdoor Execution Via PowerShell Script
id: 59a8662f-f616-4494-8fa1-29ae77fc2018
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects the execution of the ConvertTo-AADIntBackdoor command via PowerShell Script Block Logging.
  The ConvertTo-AADIntBackdoor command is part of the AADInternals toolkit, which is used primarily for security testing and administrative tasks in Azure Active Directory (Azure AD) environments.
  This particular command is designed to create a "backdoor" in a federated Azure AD domain.
  When executed, ConvertTo-AADIntBackdoor modifies the federation settings of a domain by adding or changing the federation configuration to allow an attacker to control the authentication process.
  This manipulation enables the creation of security tokens that can impersonate any user within the Azure AD tenant.
  Consequently, this allows an attacker to bypass Multi-Factor Authentication (MFA), escalate privileges, and maintain persistent access to the Azure AD environment.
references:
- https://atomicredteam.io/privilege-escalation/T1484.002/#atomic-test-1---add-federation-to-azure-ad
tags:
- attack.T1482
- attack.T1078
- attack.T1212
- attack.T1071_001
date: '2026-05-05'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: '4104'
  selection_1:
    ScriptBlockText|contains: '*ConvertTo-AADIntBackdoor*'
  condition: selection_0 and selection_1
