title: Windows Remote Assistance Spawning Process
id: ced50492-8849-11ec-9f68-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects Microsoft Remote Assistance (msra.exe) spawning PowerShell.exe or cmd.exe as a child process. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process creation events where msra.exe is the parent process. This activity is significant because msra.exe typically does not spawn command-line interfaces, indicating potential
  process injection or misuse. If confirmed malicious, an attacker could use this technique to execute arbitrary commands, escalate privileges, or maintain persistence on the compromised system.
references:
- https://thedfirreport.com/2022/02/07/qbot-likes-to-move-it-move-it/
- https://app.any.run/tasks/ca1616de-89a1-4afc-a3e4-09d428df2420/
tags:
- attack.T1055
date: '2022-02-09'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: msra.exe
  condition: selection_0
