title: Windows Chromium Process Loaded Extension via Command-Line
id: 1b8a468a-52e3-4206-b14a-73165441684c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects instances where Google Chrome is started with the --load-extension command-line flag, which allows loading unpacked or non-standard extensions. This behavior can indicate attempts to bypass enterprise extension policies, install malicious extensions, or load potentially harmful browser components. Monitoring such activity helps identify unauthorized extension usage, potential malware persistence mechanisms, or policy violations that could compromise browser security.
references:
- https://www.gdatasoftware.com/blog/2025/11/38298-learning-about-browser-hijacking
- https://peter.sh/experiments/chromium-command-line-switches/
tags:
- attack.t1185
date: '2026-01-12'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where
  Processes.process_name = "Chrome.exe"
  Processes.process= "*--load-extension*"

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
     Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_chromium_process_loaded_extension_via_command_line_filter`
splunk_rule_id: 1b8a468a-52e3-4206-b14a-73165441684c
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: Chrome.exe
  selection_1:
    CommandLine|contains: --load-extension
  condition: selection_0 and selection_1
