title: Windows InstallUtil Credential Theft
id: ccfeddec-43ec-11ec-b494-acde48001122
status: stable
level: medium
author: Michael Haag, Mauricio Velazo, Splunk
description: The following analytic detects instances where the Windows InstallUtil.exe binary loads `vaultcli.dll` and `Samlib.dll`. This detection leverages Sysmon EventCode 7 to identify these specific
  DLL loads. This activity is significant because it can indicate an attempt to execute code that bypasses application control and captures credentials using tools like Mimikatz. If confirmed malicious,
  this behavior could allow an attacker to steal credentials, potentially leading to unauthorized access and further compromise of the system.
references:
- https://gist.github.com/xorrior/bbac3919ca2aef8d924bdf3b16cce3d0
tags:
- attack.T1218_004
date: '2021-11-12'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image: installutil.exe
  selection_2:
    loaded_file_path|contains:
    - '*\samlib.dll'
    - '*\vaultcli.dll'
  condition: selection_0 and selection_1 and selection_2
