title: Windows Rundll32 with Non-Standard File Extension
id: f52b55ce-41ad-4802-9909-fbd7cc8410a5
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  This analytic identifies the instance of rundll32.exe process loading a non-standard Windows modules file extension.
  This behavior is not common and can be associated with malicious activities, such as the Gh0st RAT backdoor. This technique is to evade possible detection by security tools that monitors a suspicious dll loading activity.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.ghost_rat
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-rrasm/22ad9f0e-4349-43e0-92b3-37f7a9c7ca41
- https://s7d2.scene7.com/is/content/cylance/prod/cylance-web/en-us/resources/knowledge-center/resource-library/reports/Op_Dust_Storm_Report.pdf
- https://www.sentinelone.com/blog/the-curious-case-of-gh0st-malware/
tags:
- attack.T1218_011
date: '2026-03-30'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - '*:\PerfLogs\*'
    - '*:\ProgramData\*'
    - '*:\Recycle.bin\*'
    - '*:\Users\Administrator\Music\*'
    - '*:\Users\Public\*'
    - '*:\Windows\Cursors\*'
    - '*:\Windows\debug\*'
    - '*:\Windows\fonts\*'
    - '*:\Windows\INF\*'
    - '*:\Windows\Media\*'
    - '*:\Windows\Prefetch\*'
    - '*:\Windows\repair\*'
    - '*:\Windows\Tasks\*'
    - '*\Temp\*'
  selection_1:
    ParentImage|contains:
    - '*cmd.exe*'
    - '*cscript.exe*'
    - '*mshta.exe*'
    - '*powershell.exe*'
    - '*pwsh.exe*'
    - '*regsvr32.exe*'
    - '*wscript.exe*'
  filter_2:
    CommandLine:
    - '*.cpl*'
    - '*.dll*'
    - '*.drv*'
    - '*.inf*'
    - '*.mui*'
    - '*.ocx*'
  condition: (selection_0 and selection_1) and not (filter_2)
