title: Windows NorthStar C2 Agent Execution
id: 5f13d5b2-5181-487b-89eb-e2b471522202
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the initial agent or persistent agent processes for Northstar C2 being run.
  NorthStarC2 is an open-source command and control framework developed for penetration testing and red teaming purposes by Engin Demirbilek.
  NorthStar C2 Framework consists of two applications, a server-side GUI web application for managing sessions and a client-side stager to communicate with C2 server.
references:
- https://github.com/EnginDemirbilek/NorthStarC2/
tags:
- attack.T1204_002
- attack.T1547_001
- attack.T1608
date: '2021-06-23'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: NorthstarStager.exe
  selection_1:
    Image|contains:
    - NorthstarStager.exe
    - SystemHealthCheck.exe
  condition: selection_0 and selection_1
