title: Windows Guest Account Enabled Via Net.EXE
id: 4f8cd681-7583-47a0-9f38-6337b7adf48a
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  By default, the Windows guest account is heavily restricted, with limited permissions and access to system resources.
  However, if the guest account is activated, it can potentially be used to perform malicious activities such as installing malware, deleting files, stealing data, or even taking control of the system.
tags:
- attack.T1078_001
date: '2021-09-02'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*user *'
  selection_1:
    CommandLine|contains: '*guest *'
  selection_2:
    CommandLine|contains: '*/active:yes*'
  condition: selection_0 and selection_1 and selection_2
