title: Windows Curl Upload to Remote Destination
id: 42f8f1a2-4228-11ec-aade-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of Windows Curl.exe to upload a file to a remote destination. It identifies command-line arguments such as `-T`, `--upload-file`, `-d`, `--data`, and
  `-F` in process execution logs. This activity is significant because adversaries may use Curl to exfiltrate data or upload malicious payloads. If confirmed malicious, this could lead to data breaches
  or further compromise of the system. Analysts should review parallel processes and network logs to determine if the upload was successful and isolate the endpoint if necessary.
references:
- https://everything.curl.dev/usingcurl/uploads
- https://techcommunity.microsoft.com/t5/containers/tar-and-curl-come-to-windows/ba-p/382409
- https://twitter.com/d1r4c/status/1279042657508081664?s=20
tags:
- attack.t1105
date: '2021-11-10'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  (Processes.process_name=curl.exe OR Processes.original_file_name=Curl.exe)
  Processes.process IN (
    "*-T *",
    "*--upload-file *",
    "*-d *",
    "*--data *",
    "*-F *"
  )
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
     Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user Processes.user_id
     Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_curl_upload_to_remote_destination_filter`
splunk_rule_id: 42f8f1a2-4228-11ec-aade-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: curl.exe
  selection_1:
    OriginalFileName: Curl.exe
  selection_2:
    CommandLine|contains:
    - '-T '
    - '--upload-file '
    - '-d '
    - '--data '
    - '-F '
  condition: selection_0 and selection_1 and selection_2
