title: Windows Modify Registry Regedit Silent Reg Import
id: 824dd598-71be-4203-bc3b-024f4cda340e
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the modification of the Windows registry using the regedit.exe application with the silent mode parameter. It leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on process names and command-line executions. This activity is significant because the silent mode allows registry changes without user confirmation, which can be exploited by adversaries
  to import malicious registry settings. If confirmed malicious, this could enable attackers to persist in the environment, escalate privileges, or manipulate system configurations, leading to potential
  system compromise.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
- https://www.techtarget.com/searchwindowsserver/tip/Command-line-options-for-Regeditexe
tags:
- attack.T1112
date: '2022-07-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: regedit.exe
  selection_1:
    OriginalFileName: regedit.exe
  selection_2:
    CommandLine|contains: '* /s *'
  selection_3:
    CommandLine|contains: '*.reg*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
