title: Windows Vulnerable 3CX Software
id: f2cc1584-46ee-485b-b905-977c067f36de
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances of the 3CXDesktopApp.exe with a FileVersion of 18.12.x, leveraging Sysmon logs. This detection focuses on identifying vulnerable versions 18.12.407
  and 18.12.416 of the 3CX desktop app. Monitoring this activity is crucial as these specific versions have known vulnerabilities that could be exploited by attackers. If confirmed malicious, exploitation
  of this vulnerability could lead to unauthorized access, code execution, or further compromise of the affected system, posing significant security risks.
references:
- https://www.sentinelone.com/blog/smoothoperator-ongoing-campaign-trojanizes-3cx-software-in-software-supply-chain-attack/
- https://www.cisa.gov/news-events/alerts/2023/03/30/supply-chain-attack-against-3cxdesktopapp
- https://www.reddit.com/r/crowdstrike/comments/125r3uu/20230329_situational_awareness_crowdstrike/
- https://www.3cx.com/community/threads/crowdstrike-endpoint-security-detection-re-3cx-desktop-app.119934/page-2#post-558898
- https://www.3cx.com/community/threads/3cx-desktopapp-security-alert.119951/
tags:
- attack.T1195_002
date: '2023-03-30'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    Image: 3
  selection_1:
    OriginalFileName: 3
  selection_2:
    FileVersion: 18.12
  condition: selection_0 and selection_1 and selection_2
