title: Windows Security Account Manager Stopped
id: 69c12d59-d951-431e-ab77-ec426b8d65e6
status: stable
level: medium
author: Rod Soto, Jose Hernandez, Splunk
description: The following analytic detects the stopping of the Windows Security Account Manager (SAM) service via command-line, typically using the "net stop samss" command. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant because stopping the SAM service can disrupt authentication mechanisms
  and is often associated with ransomware attacks like Ryuk. If confirmed malicious, this action could lead to unauthorized access, privilege escalation, and potential system-wide compromise.
tags:
- attack.T1489
date: '2020-11-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_name"|contains: net*.exe
  selection_1:
    process"|contains: '*stop \"samss\"*'
  condition: selection_0 and selection_1
