title: Windows Process Injection into Commonly Abused Processes
id: 1e1dedc6-f6f3-41a0-9dd7-a1245904fe75
status: stable
level: medium
author: 0xC0FFEEEE, Github Community
description: The following analytic detects process injection into executables that are commonly abused using Sysmon EventCode 10. It identifies suspicious GrantedAccess requests (0x40 and 0x1fffff) to
  processes such as notepad.exe, wordpad.exe and calc.exe, excluding common system paths like System32, Syswow64, and Program Files. This behavior is often associated with the SliverC2 framework by BishopFox.
  Monitoring this activity is crucial as it may indicate an initial payload attempting to execute malicious code. If confirmed malicious, this could allow attackers to execute arbitrary code, potentially
  leading to privilege escalation or persistent access within the environment.
references:
- https://dominicbreuker.com/post/learning_sliver_c2_08_implant_basics/
- https://www.cybereason.com/blog/sliver-c2-leveraged-by-many-threat-actors
- https://redcanary.com/threat-detection-report/techniques/process-injection/
tags:
- attack.T1055_002
date: '2023-02-24'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 10
  selection_1:
    TargetImage|contains:
    - '*\backgroundtaskhost.exe'
    - '*\calc.exe'
    - '*\CalculatorApp.exe'
    - '*\chrome.exe'
    - '*\dllhost.exe'
    - '*\edge.exe'
    - '*\firefox.exe'
    - '*\lsass.exe'
    - '*\mspaint.exe'
    - '*\notepad.exe'
    - '*\regsvr32.exe'
    - '*\searchprotocolhost.exe'
    - '*\spoolsv.exe'
    - '*\svchost.exe'
    - '*\werfault.exe'
    - '*\win32calc.exe'
    - '*\wordpad.exe'
    - '*\wuauclt.exe'
  filter_2:
    SourceImage:
    - '*:\Windows\Program Files (x86)\*'
    - '*:\Windows\Program Files\*'
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWOW64\*'
  selection_3:
    GrantedAccess|contains:
    - '0x1f3fff'
    - '0x1fffff'
    - '0x40'
  condition: (selection_0 and selection_1 and selection_3) and not (filter_2)
