title: Windows Executable in Loaded Modules
id: 3e27af56-fcf0-4113-988d-24969b062be7
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies instances where executable files (.exe) are loaded as modules, detected through 'ImageLoaded' events in Sysmon logs. This method leverages Sysmon EventCode
  7 to track unusual module loading behavior, which is significant as it deviates from the norm of loading .dll files. This activity is crucial for SOC monitoring because it can indicate the presence of
  malware like NjRAT, which uses this technique to load malicious modules. If confirmed malicious, this behavior could allow attackers to execute arbitrary code, maintain persistence, and further compromise
  the host system.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
tags:
- attack.T1129
date: '2023-09-19'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains: '*.dll'
  selection_2:
    Signed: 'true'
  condition: selection_0 and selection_1 and selection_2
