title: Windows DISM Remove Defender
id: 8567da9e-47f0-11ec-99a9-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the use of `dism.exe` to remove Windows Defender. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions that
  include specific parameters for disabling and removing Windows Defender. This activity is significant because adversaries may disable Defender to evade detection and carry out further malicious actions
  undetected. If confirmed malicious, this could lead to the attacker gaining persistent access, executing additional payloads, or exfiltrating sensitive data without being intercepted by Windows Defender.
references:
- https://thedfirreport.com/2020/11/23/pysa-mespinoza-ransomware/
tags:
- attack.t1685
date: '2021-12-08'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name=dism.exe (Processes.process="*/online*"
      AND
      Processes.process="*/disable-feature*"
      AND
      Processes.process="*Windows-Defender*"
      AND
      Processes.process="*/remove*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_dism_remove_defender_filter`
splunk_rule_id: 8567da9e-47f0-11ec-99a9-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: dism.exe
  selection_1:
    CommandLine|contains: /online
  selection_2:
    CommandLine|contains: /disable-feature
  selection_3:
    CommandLine|contains: Windows-Defender
  selection_4:
    CommandLine|contains: /remove
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
