title: Windows Process Injection In Non-Service SearchIndexer
id: d131673f-ede1-47f2-93a1-0108d3e7fafd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies instances of the searchindexer.exe process that are not spawned by services.exe, indicating potential process injection. This detection leverages data from
  Endpoint Detection and Response (EDR) agents, focusing on process names and parent processes. This activity is significant because QakBot malware often uses a fake searchindexer.exe to evade detection
  and perform malicious actions such as data exfiltration and keystroke logging. If confirmed malicious, this activity could allow attackers to maintain persistence, steal sensitive information, and communicate
  with command and control servers.
references:
- https://twitter.com/Max_Mal_/status/1736392741758611607
- https://twitter.com/1ZRR4H/status/1735944522075386332
tags:
- attack.T1055
date: '2022-02-23'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: services.exe
  selection_1:
    Image: searchindexer.exe
  condition: selection_0 and selection_1
