title: Windows Exfiltration Over C2 Via Invoke RestMethod
id: 06ade821-f6fa-40d0-80af-15bc1d45b3ba
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects potential data exfiltration using PowerShell's Invoke-RestMethod. It leverages PowerShell Script Block Logging to identify scripts that attempt to upload files
  via HTTP POST requests. This activity is significant as it may indicate an attacker is exfiltrating sensitive data, such as desktop screenshots or files, to an external command and control (C2) server.
  If confirmed malicious, this could lead to data breaches, loss of sensitive information, and further compromise of the affected systems. Immediate investigation is recommended to determine the intent
  and scope of the activity.
references:
- https://twitter.com/_CERT_UA/status/1620781684257091584
- https://cert.gov.ua/article/3761104
tags:
- attack.T1041
date: '2023-04-05'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*Invoke-RestMethod *'
  selection_2:
    ScriptBlockText|contains: '* -Uri *'
  selection_3:
    ScriptBlockText|contains: '* -Method *'
  selection_4:
    ScriptBlockText|contains: '* Post *'
  selection_5:
    ScriptBlockText|contains: '* -InFile *'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5
