title: Windows Mustang Panda USB Tool Execution
id: e66a167f-6506-4e5b-8e4d-1b04940c70be
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects known executables used for infection or DLL side loading by Mustang Panda being launched from a non-C:\ location.
  This can indicate a compromise via USB, or external storage device.
  You will have to adapt this detection if you do not use C:\ as the root device.
references:
- https://decoded.avast.io/threatintel/apt-treasure-trove-avast-suspects-chinese-apt-group-mustang-panda-is-collecting-data-from-burmese-government-agencies-and-opposition-groups/
tags:
- attack.T1574_001
- attack.T1204_002
- attack.T1020
date: '2026-05-05'
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    Image|contains: C:\*
  selection_1:
    Image|contains:
    - '*atkexComSvcRes.exe'
    - '*AtlTraceTool8.exe'
    - '*browser.ex'
    - '*CefSub.exe'
    - '*dabs.ex'
    - '*FacialFeatureDemo.exe'
    - '*GoogleUpdate*.exe'
    - '*GUP.exe'
    - '*HPCustParticUI.exe'
    - '*install_.exe'
    - '*mcsync.ex'
    - '*melt_64.exe'
    - '*mscorsvw.exe'
    - '*OleView.exe'
    - '*piz.exe'
    - '*PlugInInstallerUtility2.exe'
    - '*rar330.exe'
    - '*Samvd.exe'
    - '*scx.exe'
    - '*spoololk.exe'
    - '*Symantec.exe'
    - '*SymantecHp.exe'
    - '*Symantecs.exe'
    - '*Symantecsy.exe'
    - '*upservice.exe'
    - '*vivaldi.exe'
    - '*wsc_proxy.exe'
    - '*ygfdt.exe'
  condition: (selection_1) and not (filter_0)
