title: Windows Suspicious Child Process of TieringEngineService.exe
id: 69edec6c-877e-4423-9b9b-025b589123a8
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the RedSun privilege escalation exploit delivering a SYSTEM-level shell to the attacker's session.
  RedSun replaces the legitimate TieringEngineService.exe with a malicious binary, which launches a process as SYSTEM, usually some sort of shell or shell spawner (conhost.exe, cmd.exe, PowerShell, etc.) in the attacker's active session.
references:
- https://github.com/Nightmare-Eclipse/RedSun
- https://www.huntress.com/blog/nightmare-eclipse-intrusion
tags:
- attack.t1068
date: '2026-05-01'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  FROM datamodel=Endpoint.Processes WHERE

  Processes.parent_process_name="TieringEngineService.exe"
  (
      Processes.process IN (
          "*bitsadmin.exe*",
          "*cmd.exe*",
          "*conhost.exe*",
          "*cscript.exe*",
          "*curl.exe*",
          "*powershell.exe*",
          "*pwsh.exe*",
          "*rundll32.exe*",
          "*wmic.exe*"
      )
      OR
      Processes.process_name IN (
          "bitsadmin.exe",
          "cmd.exe",
          "conhost.exe",
          "cscript.exe",
          "curl.exe",
          "powershell.exe",
          "pwsh.exe",
          "rundll32.exe",
          "wmic.exe"
      )
  )
  Processes.user IN (
      "*AUTHORITY*",
      "*System*"
  )

  BY Processes.dest Processes.user Processes.original_file_name
     Processes.parent_process Processes.process_name Processes.process
     Processes.process_id Processes.parent_process_id
     Processes.parent_process_name action
     parent_process_exec parent_process_guid
     parent_process_path process_exec process_guid
     process_hash process_integrity_level
     process_path user_id vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_suspicious_child_process_of_tieringengineservice_exe_filter`
splunk_rule_id: 69edec6c-877e-4423-9b9b-025b589123a8
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: TieringEngineService.exe
  selection_1:
    CommandLine|contains:
    - bitsadmin.exe
    - cmd.exe
    - conhost.exe
    - cscript.exe
    - curl.exe
    - powershell.exe
    - pwsh.exe
    - rundll32.exe
    - wmic.exe
  selection_2:
    Image:
    - bitsadmin.exe
    - cmd.exe
    - conhost.exe
    - cscript.exe
    - curl.exe
    - powershell.exe
    - pwsh.exe
    - rundll32.exe
    - wmic.exe
  selection_3:
    User|contains:
    - AUTHORITY
    - System
  condition: selection_0 and selection_1 and selection_2 and selection_3
