title: Windows Gdrive Binary Activity
id: 9e7bd7c8-1c08-496e-9ffe-fd84ceb322e7
status: stable
level: medium
author: Raven Tait, Splunk
description: The following analytic detects the execution of the 'gdrive' tool on a Windows host. This tool allows standard users to perform tasks associated with Google Drive via the command line. This
  is used by actors to stage tools as well as exfiltrate data. The detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. If confirmed
  malicious, this could lead to compromise of systems or sensitive data being stolen.
references:
- https://cloud.google.com/blog/topics/threat-intelligence/uncovering-unc3886-espionage-operations
tags:
- attack.T1567
date: '2022-12-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: gdrive.exe
  selection_1:
    OriginalFileName|contains: '*gdrive.exe'
  selection_2:
    CommandLine|contains:
    - '* download *'
    - '* upload *'
    - '* list*'
    - '* update *'
    - '* sync *'
    - '* share *'
    - '* account add*'
    - '* drives *'
    - '* files *'
  condition: selection_0 and selection_1 and selection_2
