title: Windows Password Policy Discovery with Net
id: e52f7865-be78-46bf-b7ed-150fbe447613
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Nasreddine Bencherchali, Splunk
description: The following analytic identifies the execution of `net.exe` with command line arguments aimed at obtaining the computer or domain password policy. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential reconnaissance efforts by adversaries to gather information about
  Active Directory password policies. If confirmed malicious, this behavior could allow attackers to understand password complexity requirements, aiding in brute-force or password-guessing attacks, ultimately
  compromising user accounts and gaining unauthorized access to the network.
references:
- https://github.com/S1ckB0y1337/Active-Directory-Exploitation-Cheat-Sheet
tags:
- attack.t1201
date: '2021-08-27'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE `process_net`
      AND
      Processes.process = "*accounts*"
      AND
      NOT Processes.process IN ("*/FORCELOGOFF*", "*/MINPWLEN*", "*/MAXPWAGE*", "*/MINPWAGE*", "*/UNIQUEPW*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_password_policy_discovery_with_net_filter`
splunk_rule_id: e52f7865-be78-46bf-b7ed-150fbe447613
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: accounts
  filter_1:
    CommandLine:
    - '*/FORCELOGOFF*'
    - '*/MINPWLEN*'
    - '*/MAXPWAGE*'
    - '*/MINPWAGE*'
    - '*/UNIQUEPW*'
  condition: (selection_0) and not (filter_1)
