title: Windows Information Discovery Fsutil
id: 2181f261-93e6-4166-a5a9-47deac58feff
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: |
  The following analytic identifies the execution of the Windows built-in tool FSUTIL with the "FSINFO" or "Volume" parameters, in order to discover file system and disk information.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process execution logs that include command-line details.
  Monitoring this activity is significant because FSUTIL can be abused by adversaries to gather detailed information about the file system, aiding in further exploitation.
  If confirmed malicious, this activity could enable attackers to map the file system, identify valuable data, and plan subsequent actions such as privilege escalation or persistence.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/fsutil
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/fsutil-volume
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
- https://www.microsoft.com/en-us/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
tags:
- attack.t1082
date: '2022-12-06'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
  from datamodel=Endpoint.Processes where

  (
    Processes.process_name="fsutil.exe"
    OR
    Processes.original_file_name = "fsutil.exe"
  )
  (
    Processes.process = "*fsinfo*"
    OR
    (
      Processes.process = "*volume*"
      AND
      Processes.process IN ("*diskfree*", "*list*")
    )
  )
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
     Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_information_discovery_fsutil_filter`
splunk_rule_id: 2181f261-93e6-4166-a5a9-47deac58feff
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: fsutil.exe
  selection_1:
    OriginalFileName: fsutil.exe
  selection_2:
    CommandLine|contains: fsinfo
  selection_3:
    CommandLine|contains: '*volume*'
    CommandLine:
    - '*diskfree*'
    - '*list*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
