title: Windows DLL Side-Loading Process Child Of Calc
id: 295ca9ed-e97b-4520-90f7-dfb6469902e1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies suspicious child processes spawned by calc.exe, indicative of a potential DLL side-loading technique. This detection leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process GUIDs, names, and parent processes. In previous versions of the "calc.exe" binary, namely on Windows 7, it was vulnerable to DLL side-loading, where an attacker
  is able to load an arbitrary DLL named "WindowsCodecs.dll". This activity was observed in Qakbot malware, back in 2022. If confirmed malicious, this behavior could allow attackers to execute arbitrary
  code, maintain persistence, and escalate privileges, posing a severe threat to the environment.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.qakbot
- https://www.menlosecurity.com/blog/an-anatomy-of-heat-attacks-used-by-qakbot-campaigns
tags:
- attack.T1574_001
date: '2022-10-20'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: calc.exe
  selection_1:
    Image: win32calc.exe
  condition: selection_0 and selection_1
