title: Windows Curl Download to Suspicious Path
id: c32f091e-30db-11ec-8738-acde48001122
status: stable
level: medium
author: Michael Haag, Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects the use of Windows Curl.exe to download
  a file to a suspicious location, such as AppData, ProgramData, or Public directories.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  command-line executions that include the -O or --output options. This activity is
  significant because downloading files to these locations can indicate an attempt
  to bypass security controls or establish persistence. If confirmed malicious, this
  behavior could lead to unauthorized code execution, data exfiltration, or further
  compromise of the system.
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://attack.mitre.org/techniques/T1105/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1105/T1105.md
tags:
- attack.t1105
date: '2021-10-19'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  (
    Processes.process_name=curl.exe
    OR
    Processes.original_file_name=Curl.exe
  )
  Processes.process IN ("*-O *","*--output*", "*--output-dir*")
  Processes.process IN (
        "*:\\PerfLogs\\*",
        "*:\\Windows\\Temp\\*",
        "*\\AppData\\*",
        "*\\ProgramData\\*",
        "*\\Users\\Public\\*",
        "*%AppData%*",
        "*%Public%*",
        "*%Temp%*",
        "*%tmp%*"
        )
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
     Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_curl_download_to_suspicious_path_filter`
splunk_rule_id: c32f091e-30db-11ec-8738-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: curl.exe
  selection_1:
    OriginalFileName: Curl.exe
  selection_2:
    CommandLine|contains:
    - '-O '
    - --output
    - --output-dir
  selection_3:
    CommandLine|contains:
    - :\PerfLogs\
    - :\Windows\Temp\
    - \AppData\
    - \ProgramData\
    - \Users\Public\
    - '%AppData%'
    - '%Public%'
    - '%Temp%'
    - '%tmp%'
  condition: selection_0 and selection_1 and selection_2 and selection_3
