title: Windows Suspicious Defender Engine or Signature Files Created
id: 42e848eb-1d5f-4ffb-88c2-088c4a6fdfb3
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects Windows Defender engine (mpengine.dll) or signature database files (*.vdm) being created by any process that is not a Windows Defender component.
  BlueHammer extracts these files from the downloaded mpam-fe update package into a UUID-named subdirectory of %TEMP% as part of staging the TOCTOU privilege escalation.
references:
- https://github.com/Nightmare-Eclipse/BlueHammer
tags:
- attack.T1068
date: '2026-04-27'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: '11'
  selection_1:
    TargetFilename|contains:
    - '*\mpasbase.vdm*'
    - '*\mpasdlta.vdm*'
    - '*\mpavbase.vdm*'
    - '*\mpavdlta.vdm*'
    - '*\mpengine.dll*'
  filter_2:
    Image:
    - '*:\ProgramData\Microsoft\Windows Defender\*'
    - '*:\Program Files\Windows Defender\*'
  condition: (selection_0 and selection_1) and not (filter_2)
