title: Windows SOAPHound Binary Execution
id: 8e53f839-e127-4d6d-a54d-a2f67044a57f
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of the SOAPHound binary (`soaphound.exe`) with specific command-line arguments. It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names, command-line arguments, and other process-related metadata. This activity is significant because SOAPHound is a known tool used for credential dumping and other malicious activities.
  If confirmed malicious, this behavior could allow an attacker to extract sensitive information, escalate privileges, or persist within the environment, posing a severe threat to organizational security.
references:
- https://github.com/FalconForceTeam/SOAPHound
tags:
- attack.T1069_001
- attack.T1069_002
- attack.T1087_001
- attack.T1087_002
- attack.T1482
date: '2021-06-03'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: soaphound.exe
  selection_1:
    OriginalFileName: soaphound.exe
    CommandLine:
    - '*--buildcache *'
    - '*--bhdump *'
    - '*--certdump *'
    - '*--dnsdump *'
    - '*-c *'
    - '*--cachefilename *'
    - '*-o *'
    - '*--outputdirectory *'
  condition: selection_0 and selection_1
