title: Windows System Remote Discovery With Query
id: 94859172-a521-474f-97ac-4cf4b09634a3
status: stable
level: medium
author: Steven Dick
description: The following analytic detects the execution of `query.exe` with command-line arguments aimed at discovering data on remote devices. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process names and command-line executions. This activity is significant as adversaries may use `query.exe` to gain situational awareness and perform Active Directory discovery on compromised
  endpoints. If confirmed malicious, this behavior could allow attackers to identify various details about a system, aiding in further lateral movement and privilege escalation within the network.
references:
- https://attack.mitre.org/techniques/T1033/
tags:
- attack.t1033
date: '2025-01-06'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.process_name="query.exe"
          OR
          Processes.original_file_name="query.exe"
      )
      AND (Processes.process="*/server*") AND NOT Processes.process IN ("*/server:localhost*", "*/server:127.0.0.1*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_system_remote_discovery_with_query_filter`
splunk_rule_id: 94859172-a521-474f-97ac-4cf4b09634a3
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: query.exe
  selection_1:
    OriginalFileName: query.exe
  filter_2:
    CommandLine:
    - '*/server:localhost*'
    - '*/server:127.0.0.1*'
  condition: (selection_0 and selection_1) and not (filter_2)
