title: Windows Suspicious React or Next.js Child Process
id: baa80bc8-7c9c-4395-b458-b69feb92830a
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic detects Windows processes such as cmd.exe, PowerShell, and common Windows LOLBINs being spawned by React or Next.js application servers.
  In the context of CVE-2025-55182 / React2Shell / CVE-2025-66478 for Next.js, successful exploitation can lead to arbitrary JavaScript execution on the server, which in turn is used to invoke Node's child_process APIs (for example child_process.execSync) to run OS-level commands.
  This detection focuses on suspicious child processes where a Next/React server process spawns an uncommon process.
  Such activity might be a strong indicator of exploitation of the aforementioned vulnerability.
references:
- https://react.dev/blog/2025/12/03/critical-security-vulnerability-in-react-server-components
- https://nextjs.org/blog/CVE-2025-66478
- https://nvd.nist.gov/vuln/detail/CVE-2025-55182
- https://gist.github.com/maple3142/48bc9393f45e068cf8c90ab865c0f5f3
- https://www.wiz.io/blog/critical-vulnerability-in-react-cve-2025-55182
tags:
- attack.T1190
- attack.T1059_003
- attack.T1059_001
date: '2025-12-08'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: node.exe
  selection_1:
    ParentCommandLine|contains:
    - '*--experimental-https*'
    - '*--experimental-next-config-strip-types*'
    - '*\node_modules\next*'
    - '*next dev*'
    - '*next start*'
    - '*next\" start*'
    - '*node_modules\.bin\\..\next*'
    - '*react-scripts start*'
    - '*start-server.js*'
  condition: selection_0 and selection_1
