title: Windows Potential Cloudflared Tunnel Execution
id: 2e29b58e-0f5a-42fc-b435-0fdce8862831
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  This analytic detects command-line arguments associated with the cloudflared client used to create Cloudflare tunnels.
  Cloudflared is functionally very similar to ngrok, an ingress-as-a-service tool.
  Cloudflared reaches out to the Cloudflare Edge Servers, creating an outbound connection over HTTPS(HTTP2/QUIC), where the tunnel's controller makes services or private networks accessible.
references:
- https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
- https://github.com/cloudflare/cloudflared
- https://www-bleepingcomputer-com.cdn.ampproject.org/c/s/www.bleepingcomputer.com/news/security/hackers-increasingly-abuse-cloudflare-tunnels-for-stealthy-connections/amp/
tags:
- attack.t1572
date: '2026-05-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.process="*tunnel*"
  (
      (
          Processes.process="*run*"
          Processes.process="*token*"
      )
      OR
      (
          Processes.process="*--url*"
          Processes.process="*localhost*"
      )
  )

  by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name Processes.parent_process
     Processes.parent_process_path Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_potential_cloudflared_tunnel_execution_filter`
splunk_rule_id: 2e29b58e-0f5a-42fc-b435-0fdce8862831
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: tunnel
  selection_1:
    CommandLine|contains: '*run*'
  selection_2:
    CommandLine|contains: '*--url*'
  condition: selection_0 and selection_1 and selection_2
