title: Windows Set Account Password Policy To Unlimited Via Net
id: 11f93009-8083-43fd-82a7-821fcbdc8342
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: The following analytic detects the use of net.exe to update user account policies to set passwords as non-expiring. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on command-line executions involving "/maxpwage:unlimited" or "/maxpwage:49710", which achieve a similar outcome theoretically. This activity is significant as it can indicate an attempt to maintain persistence,
  escalate privileges, evade defenses, or facilitate lateral movement. If confirmed malicious, this behavior could allow an attacker to maintain long-term access to compromised accounts, potentially leading
  to further exploitation and unauthorized access to sensitive information.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
- https://docs.microsoft.com/en-us/troubleshoot/windows-server/networking/net-commands-on-operating-systems
tags:
- attack.t1489
date: '2022-06-24'
original_spl: |-
  | tstats `security_content_summariesonly` values(Processes.process) as process min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE `process_net`
      AND
      Processes.process="* accounts *"
      AND
      (Processes.process="* /maxpwage:unlimited"
      OR
      Processes.process="/maxpwage:49710")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_set_account_password_policy_to_unlimited_via_net_filter`
splunk_rule_id: 11f93009-8083-43fd-82a7-821fcbdc8342
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: ' accounts '
  condition: selection_0
