title: Windows System Script Proxy Execution Syncappvpublishingserver
id: 8dd73f89-682d-444c-8b41-8e679966ad3c
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of Syncappvpublishingserver.vbs via wscript.exe or cscript.exe, which may indicate an attempt to download remote files or perform privilege escalation.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. Monitoring this activity is crucial as it can signify malicious
  use of a native Windows script for unauthorized actions. If confirmed malicious, this behavior could lead to unauthorized file downloads or elevated privileges, posing a significant security risk.
references:
- https://lolbas-project.github.io/lolbas/Scripts/Syncappvpublishingserver/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1216/T1216.md#atomic-test-1---syncappvpublishingserver-signed-script-powershell-command-execution
tags:
- attack.T1216
- attack.T1218
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - wscript.exe
    - cscript.exe
  selection_1:
    CommandLine|contains: '*syncappvpublishingserver.vbs*'
  condition: selection_0 and selection_1
