title: Windows IIS Server PSWA Console Access
id: 914ab191-fa8a-48cb-83a6-0565e061f934
status: stable
level: medium
author: Michael Haag, Splunk
description: This analytic detects access attempts to the PowerShell Web Access (PSWA) console on Windows IIS servers. It monitors web traffic for requests to PSWA-related URIs, which could indicate legitimate
  administrative activity or potential unauthorized access attempts. By tracking source IP, HTTP status, URI path, and HTTP method, it helps identify suspicious patterns or brute-force attacks targeting
  PSWA. This detection is crucial for maintaining the security of remote PowerShell management interfaces and preventing potential exploitation of this powerful administrative tool.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa24-241a
tags:
- attack.T1190
date: '2024-09-30'
logsource:
  category: webserver
  product: windows
detection:
  selection_0:
    s-ip|contains: /pswa/*
  condition: selection_0
