title: Windows Bypass UAC via Pkgmgr Tool
id: cce58e2c-988a-4319-9390-0daa9eefa3cd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the deprecated 'pkgmgr.exe' process with an XML input file, which is unusual and potentially suspicious. This detection leverages Endpoint Detection
  and Response (EDR) telemetry, focusing on process execution details and command-line arguments. The significance lies in the deprecated status of 'pkgmgr.exe' and the use of XML files, which could indicate
  an attempt to bypass User Account Control (UAC). If confirmed malicious, this activity could allow an attacker to execute commands with elevated privileges, leading to potential system compromise and
  unauthorized changes.
references:
- https://asec.ahnlab.com/en/17692/
- https://www.blackberry.com/us/en/solutions/endpoint-security/ransomware-protection/warzone#:~:text=Warzone%20RAT%20(AKA%20Ave%20Maria)%20is%20a%20remote%20access%20trojan,is%20as%20an%20information%20stealer.
tags:
- attack.T1548_002
date: '2023-07-27'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: pkgmgr.exe
  selection_1:
    CommandLine|contains: '*.xml*'
  filter_2:
    ParentImage:
    - '*:\windows\system32\*'
    - '*:\windows\syswow64\*'
    - '*:\Program Files*'
  condition: (selection_0 and selection_1) and not (filter_2)
