title: Windows Defender ASR or Threat Configuration Tamper
id: d0c07718-19d1-4de2-aea9-e0ffff0ed986
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects the use of commands to disable Attack Surface Reduction (ASR) rules or change threat default actions in Windows Defender.
  It leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions involving "Add-MpPreference" or "Set-MpPreference".
  This activity is significant because adversaries often use it to bypass Windows Defender, allowing malicious code to execute undetected.
  If confirmed malicious, this behavior could enable attackers to evade antivirus detection, maintain persistence, and execute further malicious activities without interference from Windows Defender.
references:
- https://learn.microsoft.com/en-us/powershell/module/defender/set-mppreference?view=windowsserver2025-ps#-attacksurfacereductionrules-actions
- https://www.virustotal.com/gui/file/7e805617c313ec2fb59d86719c827074cb7dfbf8f0aa18194ac1ffe6c21c8967/behavior
tags:
- attack.T1685
date: '2021-11-25'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '*Add-MpPreference *'
    - '*Set-MpPreference *'
  selection_1:
    CommandLine|contains:
    - '*-AttackSurfaceReductionRules_Actions*'
    - '*-ThreatIDDefaultAction_Actions*'
  selection_2:
    CommandLine|contains:
    - '*Allow*'
    - '*NoAction*'
    - '*Disabled*'
    - '*_Actions 6*'
    - '*_Actions 9*'
    - '*_Actions 0*'
  condition: selection_0 and selection_1 and selection_2
