title: Windows Password Managers Discovery
id: a3b3bc96-1c4f-4eba-8218-027cac739a48
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies command-line activity that searches for files related to password manager software, such as "*.kdbx*" and "*credential*". It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process execution logs. This activity is significant because attackers often target password manager databases to extract stored credentials, which can be used for
  further exploitation. If confirmed malicious, this behavior could lead to unauthorized access to sensitive information, enabling attackers to escalate privileges, move laterally, or exfiltrate critical
  data.
references:
- https://attack.mitre.org/techniques/T1555/005/
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
- attack.t1555.005
date: '2022-12-06'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.process = "*dir *"
      OR
      Processes.process = "*findstr*"
      AND
      Processes.process IN ( "*.kdbx*", "*credential*", "*key3.db*","*pass*", "*cred*", "*key4.db*", "*accessTokens*", "*access_tokens*", "*.htpasswd*", "*Ntds.dit*")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_password_managers_discovery_filter`
splunk_rule_id: a3b3bc96-1c4f-4eba-8218-027cac739a48
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: 'dir '
  selection_1:
    CommandLine|contains: '*findstr*'
    CommandLine:
    - '*.kdbx*'
    - '*credential*'
    - '*key3.db*'
    - '*pass*'
    - '*cred*'
    - '*key4.db*'
    - '*accessTokens*'
    - '*access_tokens*'
    - '*.htpasswd*'
    - '*Ntds.dit*'
  condition: selection_0 and selection_1
