title: Windows Binary Execution from an Archive
id: 1516a16f-391e-457f-b9a3-a81dfdf218a6
status: experimental
level: medium
author: Raven Tait, Nasreddine Bencherchali, Splunk
description: |-
  Detects the execution of a binary from archive-related paths in the user's Temp directory.
  It looks for binaries launched by `explorer.exe`, `winrar.exe`, or `7zFM.exe`, where the executed process path includes Temp and archive markers such as RAR, 7z, or ZIP.
  This was abused by attackers to bypass Mark-of-the-Web (MOTW) such as CVE-2025-0411 or exploit certain vulnerabilities.
references:
- https://redcanary.com/threat-detection-report/threats/scarlet-goldfinch/
tags:
- attack.t1204.002
date: '2026-05-05'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.parent_process_name IN (
      "explorer.exe",
      "winrar.exe",
      "7zFM.exe"
  )
  Processes.process_path="*\\AppData\\Local\\Temp\\*"
  Processes.process_path IN (
      "*\\rar*",
      "*\\7z*",
      "*.zip*"
  )

  by Processes.process Processes.vendor_product Processes.user_id Processes.process_hash
     Processes.parent_process_name Processes.parent_process_exec Processes.action
     Processes.dest Processes.process_current_directory Processes.process_path
     Processes.process_integrity_level Processes.original_file_name
     Processes.parent_process Processes.parent_process_path
     Processes.parent_process_guid Processes.parent_process_id
     Processes.process_guid Processes.process_id
     Processes.user Processes.process_name

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_binary_execution_from_an_archive_filter`
splunk_rule_id: 1516a16f-391e-457f-b9a3-a81dfdf218a6
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage:
    - explorer.exe
    - winrar.exe
    - 7zFM.exe
  selection_1:
    Image|contains: \AppData\Local\Temp\
  selection_2:
    Image|contains:
    - \rar
    - \7z
    - .zip
  condition: selection_0 and selection_1 and selection_2
