title: Windows Renamed Powershell Execution
id: c08014de-cc5a-42de-9775-76ecd5b37bbd
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: The following analytic identifies instances where the PowerShell executable has been renamed and executed under an alternate filename. This behavior is commonly associated with attempts to
  evade security controls or bypass logging mechanisms that monitor standard PowerShell usage. While rare in legitimate environments, renamed PowerShell binaries are frequently observed in malicious campaigns
  leveraging Living-off-the-Land Binaries (LOLBins) and fileless malware techniques. This detection flags executions of PowerShell where the process name does not match the default powershell.exe or pwsh.exe,
  especially when invoked from unusual paths or accompanied by suspicious command-line arguments.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.xworm
tags:
- attack.t1036.003
date: '2022-10-27'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  (
    Processes.original_file_name = PowerShell.EXE
    Processes.process_name != powershell.exe
  )
  OR
  (
    Processes.original_file_name = pwsh.dll
    Processes.process_name != pwsh.exe
  )
  OR
  (
    Processes.original_file_name = powershell_ise.EXE
    Processes.process_name != powershell_ise.exe
  )

  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process
     Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
     Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_renamed_powershell_execution_filter`
splunk_rule_id: c08014de-cc5a-42de-9775-76ecd5b37bbd
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    OriginalFileName: PowerShell.EXE
    Image: powershell.exe
  selection_1:
    OriginalFileName: pwsh.dll
    Image: pwsh.exe
  selection_2:
    OriginalFileName: powershell_ise.EXE
    Image: powershell_ise.exe
  condition: selection_0 and selection_1 and selection_2
