title: Windows MsMpEng Writing to System32
id: dc615235-1241-411a-b170-b34a4c8924aa
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects MsMpEng.exe creating a file in C:\\Windows\\System32\\.
  This should never happen under normal operation Windows Defender does not install kernel drivers at runtime.
  In the BlueHammer exploit, the TOCTOU race causes MsMpEng (SYSTEM) to write the attacker's driver payload directly into the drivers directory.
references:
- https://github.com/Nightmare-Eclipse/BlueHammer
tags:
- attack.T1068
- attack.T1543_003
date: '2026-04-27'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 15
  selection_1:
    EventID: 11
  selection_2:
    Image|contains: '*\MsMpEng.exe'
  selection_3:
    TargetFilename|contains: '*:\Windows\System32\*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
