title: Windows Ingress Tool Transfer Using Explorer
id: 76753bab-f116-4ea3-8fb9-89b638be58a9
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies instances where the Windows Explorer process (explorer.exe) is executed with a URL in its command line. This detection leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process execution logs. This activity is significant because adversaries, such as those using DCRat malware, may abuse explorer.exe to open URLs with the default
  browser, which is an uncommon and suspicious behavior. If confirmed malicious, this technique could allow attackers to download and execute malicious payloads, leading to potential system compromise and
  further malicious activities.
references:
- https://www.mandiant.com/resources/analyzing-dark-crystal-rat-backdoor
tags:
- attack.t1105
date: '2022-08-01'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  (Processes.process_name = explorer.exe OR Processes.original_file_name = explorer.exe)
  AND NOT (Processes.parent_process_name IN("userinit.exe", "svchost.exe"))
  Processes.process IN ("* http://*", "* https://*")
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
  Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
  Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
  Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `windows_ingress_tool_transfer_using_explorer_filter`
splunk_rule_id: 76753bab-f116-4ea3-8fb9-89b638be58a9
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: explorer.exe
  selection_1:
    OriginalFileName: explorer.exe
  filter_2:
    ParentImage:
    - userinit.exe
    - svchost.exe
  selection_3:
    CommandLine|contains:
    - ' http://'
    - ' https://'
  condition: (selection_0 and selection_1 and selection_3) and not (filter_2)
