title: Windows System Remote Discovery With Query
id: 94859172-a521-474f-97ac-4cf4b09634a3
status: stable
level: medium
author: Steven Dick
description: The following analytic detects the execution of `query.exe` with command-line arguments aimed at discovering data on remote devices. It leverages data from Endpoint Detection and Response (EDR)
  agents, focusing on process names and command-line executions. This activity is significant as adversaries may use `query.exe` to gain situational awareness and perform Active Directory discovery on compromised
  endpoints. If confirmed malicious, this behavior could allow attackers to identify various details about a system, aiding in further lateral movement and privilege escalation within the network.
references:
- https://attack.mitre.org/techniques/T1033/
tags:
- attack.T1033
date: '2025-01-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: query.exe
  selection_1:
    OriginalFileName: query.exe
  filter_2:
    CommandLine:
    - '*/server:localhost*'
    - '*/server:127.0.0.1*'
  condition: (selection_0 and selection_1) and not (filter_2)
