title: Windows Masquerading Explorer As Child Process
id: 61490da9-52a1-4855-a0c5-28233c88c481
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic identifies instances where explorer.exe is spawned by unusual parent processes such as cmd.exe, powershell.exe, or regsvr32.exe.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships.
  This activity is significant because explorer.exe is typically initiated by userinit.exe, and deviations from this norm can indicate code injection or process masquerading attempts by malware like Qakbot.
  If confirmed malicious, this behavior could allow attackers to execute arbitrary code, evade detection, and maintain persistence within the environment.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.qakbot
tags:
- attack.t1574.001
date: '2022-10-20'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Endpoint.Processes where

  Processes.parent_process_name IN (
      "cmd.exe",
      "powershell.exe",
      "pwsh.exe",
      "regsvr32.exe"
  )
  Processes.process_name = "explorer.exe"
  Processes.process IN ("*\\explorer.exe")

  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product

  | `drop_dm_object_name("Processes")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_masquerading_explorer_as_child_process_filter`
splunk_rule_id: 61490da9-52a1-4855-a0c5-28233c88c481
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - regsvr32.exe
  selection_1:
    Image: explorer.exe
  selection_2:
    CommandLine|endswith: \explorer.exe
  condition: selection_0 and selection_1 and selection_2
