title: Windows PowerShell Invoke-Sqlcmd Execution
id: 5eb76fe2-a869-4865-8c4c-8cff424b18a1
status: stable
level: medium
author: Michael Haag, Splunk
description: This detection identifies potentially suspicious usage of Invoke-Sqlcmd PowerShell cmdlet, which can be used for database operations and potential data exfiltration. The detection looks for
  suspicious parameter combinations and query patterns that may indicate unauthorized database access, data theft, or malicious database operations. Threat actors may prefer using PowerShell Invoke-Sqlcmd
  over sqlcmd.exe as it provides a more flexible programmatic interface and can better evade detection.
references:
- https://learn.microsoft.com/en-us/powershell/module/sqlserver/invoke-sqlcmd
- https://attack.mitre.org/techniques/T1059.001/
- https://attack.mitre.org/techniques/T1059.003/
tags:
- attack.T1059_001
- attack.T1059_003
date: '2025-02-13'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*invoke-sqlcmd*'
  condition: selection_0 and selection_1
