title: Windows Registry Entries Exported Via Reg
id: 466379bc-0f47-476c-8202-16ef38112e0d
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the reg.exe process with either the "save" or "export" parameters. This detection leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process execution logs and command-line arguments. This activity is significant because threat actors often use the "reg save" or "reg export" command to dump credentials or test registry
  modification capabilities on compromised hosts. If confirmed malicious, this behavior could allow attackers to escalate privileges, persist in the environment, or access sensitive information stored in
  the registry.
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/quser
- https://github.com/carlospolop/PEASS-ng/tree/master/winPEAS
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
- attack.T1012
date: '2022-12-13'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '* save *'
    - '* export *'
  condition: selection_0
