title: Windows NetSupport RMM DLL Loaded By Uncommon Process
id: 125f96f9-6f34-418b-b868-c4a8d7fb865f
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects the loading of specific dynamic-link libraries (DLLs) associated with the NetSupport Remote Manager (RMM) tool by any process on a Windows system.
  Modules such as CryptPak.dll, HTCTL32.DLL, IPCTL32.DLL, keyshowhook.dll, pcicapi.DLL, PCICL32.DLL, and TCCTL32.DLL, are integral to NetSupport's functionality.
  This detection is particularly valuable when these modules are loaded by processes running from unusual directories (e.g., Downloads, ProgramData, or user-specific folders) rather than the legitimate Program Files installation path, or by executables that have been renamed but retain the internal "client32" identifier.
  This helps to identify instances where the legitimate NetSupport tool is being misused by adversaries as a Remote Access Trojan (RAT).
references:
- https://www.linkedin.com/posts/mauricefielenbach_cybersecurity-incidentresponse-dfir-activity-7394805779448418304-g0gZ?utm_source=share&utm_medium=member_desktop&rcm=ACoAAAuFTjIB5weY_kcyu4qp3kHbI4v49tO0zEk
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://www.esentire.com/blog/evalusion-campaign-delivers-amatera-stealer-and-netsupport-rat
tags:
- attack.T1036
date: '2025-11-21'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    ImageLoaded|contains:
    - '*\CryptPak.dll'
    - '*\HTCTL32.DLL'
    - '*\pcicapi.dll'
    - '*\pcichek.dll'
    - '*\PCICL32.DLL'
    - '*\TCCTL32.DLL'
  filter_2:
    Image:
    - C:\Program Files\*
    - C:\Program Files (x86)\*
  selection_3:
    Signature|contains: NetSupport Ltd*
  condition: (selection_0 and selection_1 and selection_3) and not (filter_2)
