title: Windows Masquerading Explorer As Child Process
id: 61490da9-52a1-4855-a0c5-28233c88c481
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic identifies instances where explorer.exe is spawned by unusual parent processes such as cmd.exe, powershell.exe, or regsvr32.exe.
  This detection leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships.
  This activity is significant because explorer.exe is typically initiated by userinit.exe, and deviations from this norm can indicate code injection or process masquerading attempts by malware like Qakbot.
  If confirmed malicious, this behavior could allow attackers to execute arbitrary code, evade detection, and maintain persistence within the environment.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.qakbot
tags:
- attack.T1574_001
date: '2022-10-20'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - cmd.exe
    - powershell.exe
    - pwsh.exe
    - regsvr32.exe
  selection_1:
    Image: explorer.exe
  selection_2:
    CommandLine|contains: '*\explorer.exe'
  condition: selection_0 and selection_1 and selection_2
