title: Windows Excel Spawning Microsoft Project Application
id: ee54241e-0815-4423-9729-e1f5dfc402de
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic identifies the execution of uncommon Microsoft application executables as child processes of Microsoft Excel.
  Under normal conditions, Excel primarily spawns internal Office-related processes, and the creation of executables such as WINPROJ.EXE, FOXPROW.exe, or SCHDPLUS.exe is uncommon in typical business workflows.
  Adversaries may abuse this behavior to blend malicious activity within trusted applications, execute unauthorized code, or bypass application control mechanisms.
  This technique aligns with common tradecraft where Office applications are leveraged as initial access or execution vectors due to their prevalence in enterprise environments.
  Detecting this relationship helps defenders spot suspicious child processes that may indicate malware execution, persistence mechanisms, or attempts to establish command-and-control.
  Security teams should investigate the parent Excel process, the context of the ActivateMicrosoftApp() execution, and any subsequent network or file activity.
  While certain legitimate Office features could trigger this process in specific environments, its occurrence generally warrants further scrutiny to validate intent and rule out compromise.
references:
- https://specterops.io/blog/2023/10/30/lateral-movement-abuse-the-power-of-dcom-excel-application/
- https://blog.talosintelligence.com/pathwiper-targets-ukraine/
- https://www.trellix.com/blogs/research/dcom-abuse-and-network-erasure-with-trellix-ndr/
tags:
- attack.T1021_003
date: '2025-08-21'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: EXCEL.EXE
  selection_1:
    Image|contains:
    - WINPROJ.EXE
    - FOXPROW.exe
    - SCHDPLUS.exe
  condition: selection_0 and selection_1
