title: Windows File Collection Via Copy Utilities
id: dbdd556d-9da8-4c42-9980-8a3ffe25a758
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of Windows command-line copy utilities, such as xcopy, to systematically collect files from user directories and consolidate them into a centralized location
  on the system. This activity is often indicative of malicious behavior, as threat actors frequently use such commands to gather sensitive information, including documents with .doc, .docx, and .pdf extensions.
  The detection focuses on identifying recursive copy operations targeting user folders, such as Documents, Desktop, or other directories that commonly store personal or organizational files. Malware that
  performs this behavior typically attempts to evade detection by using legitimate Windows utilities, executing commands through cmd.exe or other scripting hosts, and writing the collected files to directories
  like C:\ProgramData or temporary storage locations. Once collected, the information may be staged for exfiltration, used for lateral movement, or leveraged for further compromise of the environment. By
  monitoring for these types of file collection patterns, security teams can identify suspicious activity early, differentiate between normal administrative tasks and potentially malicious scripts, and
  prevent sensitive data from being exfiltrated. This analytic is particularly relevant for environments where confidential documents are present and attackers may attempt to harvest them using built-in
  Windows tools.
references:
- https://cert.gov.ua/article/6284730
tags:
- attack.T1119
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - copy.exe
    - xcopy.exe
  selection_1:
    OriginalFileName|contains:
    - copy.exe
    - xcopy.exe
  selection_2:
    CommandLine|contains:
    - '*.7z*'
    - '*.bmp*'
    - '*.db*'
    - '*.doc*'
    - '*.gif*'
    - '*.gz*'
    - '*.jpg*'
    - '*.log*'
    - '*.pdf*'
    - '*.png*'
    - '*.ppt*'
    - '*.rar*'
    - '*.rtf*'
    - '*.tar*'
    - '*.txt*'
    - '*.xls*'
    - '*.zip*'
  condition: selection_0 and selection_1 and selection_2
