title: Windows WMI Reconnaissance Class Query
id: 5e38bd3e-5da7-483d-aa61-27f7e8c27ad1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects the use of WMIC (Windows Management Instrumentation Command-line) for reconnaissance and system information discovery on Windows endpoints.
  It identifies command-line queries targeting common Win32 WMI classes such as Win32_OperatingSystem, Win32_Processor, csproduct, Win32_DiskDrive, and Win32_PhysicalMemory, which are frequently leveraged to enumerate hardware, operating system details, and system configuration. Adversaries often use these queries during post-exploitation to fingerprint hosts, assess virtualization, and tailor follow-on activity. While WMIC usage can be legitimate for administrative and inventory tasks, suspicious or unexpected execution—particularly by non-administrative users or uncommon parent processes—may indicate malicious reconnaissance aligned with system discovery techniques.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/py.blankgrabber
tags:
- attack.t1047
date: '2026-03-16'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
    as lastTime from datamodel=Endpoint.Processes where
    (
      NOT Processes.parent_process_path  IN (
          "*:\\Program Files (x86)\\*",
          "*:\\Program Files\\*",
          "*:\\Windows\\System32\\*",
          "*:\\Windows\\SysWOW64\\*"
      )
      OR
      Processes.parent_process_name IN(
          "cmd.exe",
          "powershell*",
          "pwsh.exe"
      )
    )
    AND
    (
      Processes.process_name = "wmic.exe"
      OR
      Processes.original_file_name = "wmic.exe"
    )
    Processes.process IN (
      "*csproduct*",
      "*Win32_BaseBoard*",
      "*Win32_Bios*",
      "*Win32_DiskDrive*",
      "*Win32_DisplayConfiguration*",
      "*Win32_OperatingSystem*",
      "*Win32_PhysicalMemory*",
      "*Win32_PnPEntity*",
      "*Win32_Processor*",
      "*Win32_ShadowCopy*",
      "*win32_ShortcutFile*",
      "*win32_VideoController*"
    )
    by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
    Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
    Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
    Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level
    Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_wmi_reconnaissance_class_query_filter`
splunk_rule_id: 5e38bd3e-5da7-483d-aa61-27f7e8c27ad1
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  filter_0:
    ParentImage:
    - '*:\Program Files (x86)\*'
    - '*:\Program Files\*'
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWOW64\*'
  selection_1:
    ParentImage|startswith:
    - cmd.exe
    - powershell
    - pwsh.exe
  selection_2:
    CommandLine|contains:
    - csproduct
    - Win32_BaseBoard
    - Win32_Bios
    - Win32_DiskDrive
    - Win32_DisplayConfiguration
    - Win32_OperatingSystem
    - Win32_PhysicalMemory
    - Win32_PnPEntity
    - Win32_Processor
    - Win32_ShadowCopy
    - win32_ShortcutFile
    - win32_VideoController
  condition: (selection_1 and selection_2) and not (filter_0)
