title: Windows Suspect Process With Authentication Traffic
id: 953322db-128a-4ce9-8e89-56e039e33d98
status: stable
level: medium
author: Steven Dick
description: The following analytic detects executables running from public or temporary locations that are communicating over Windows domain authentication ports/protocols such as LDAP (389), LDAPS (636),
  and Kerberos (88). It leverages network traffic data to identify processes originating from user-controlled directories. This activity is significant because legitimate applications rarely run from these
  locations and attempt domain authentication, making it a potential indicator of compromise. If confirmed malicious, attackers could leverage this to access domain resources, potentially leading to further
  exploitation and lateral movement within the network.
references:
- https://attack.mitre.org/techniques/T1069/002/
- https://book.hacktricks.xyz/network-services-pentesting/pentesting-kerberos-88
tags:
- attack.T1087_002
- attack.T1204_002
date: '2023-07-28'
logsource:
  category: all_traffic
  product: windows
detection:
  selection_0:
    DestinationPort|contains:
    - '88'
    - '389'
    - '636'
  selection_1:
    app|contains:
    - '*\users\*'
    - '*\programdata\*'
    - '*\temp\*'
    - '*\Windows\Tasks\*'
    - '*\appdata\*'
    - '*\perflogs\*'
  condition: selection_0 and selection_1
