title: Windows Process Executed From Removable Media
id: b483804a-4cc0-49a4-9f00-ac29ba844d08
status: stable
level: medium
author: Steven Dick
description: This analytic is used to identify when a removable media device is attached to a machine and then a process is executed from the same drive letter assigned to the removable media device. Adversaries
  and Insider Threats may use removable media devices for several malicious activities, including initial access, execution, and exfiltration.
references:
- https://attack.mitre.org/techniques/T1200/
- https://www.cisa.gov/news-events/news/using-caution-usb-drives
- https://www.bleepingcomputer.com/news/security/fbi-hackers-use-badusb-to-target-defense-firms-with-ransomware/
tags:
- attack.T1200
- attack.T1025
- attack.T1091
date: '2025-01-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    process_current_directory|contains: '*'
  filter_1:
    process_current_directory:
    - C:\*
    - '*\sysvol\*'
  condition: (selection_0) and not (filter_1)
