title: Windows BitDefender Submission Wizard DLL Sideloading
id: a1b2c3d4-e5f6-4789-a012-3456789abcde
status: experimental
level: medium
author: Michael Haag, Splunk
description: |
  Detects DLL side-loading of Bitdefender Submission Wizard (BDSubmit.exe, bdsw.exe, or renamed BluetoothService.exe) when a malicious log.dll is loaded from a non-standard path via Sysmon ImageLoad events.
references:
- https://attack.mitre.org/techniques/T1574/002/
- https://www.rapid7.com/blog/post/tr-chrysalis-backdoor-dive-into-lotus-blossoms-toolkit/
- https://attack.mitre.org/groups/G0065/
tags:
- attack.T1574
date: '2026-03-16'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 7
  selection_1:
    Image|contains:
    - '*\BDSubmit.exe'
    - '*\bdsw.exe'
    - '*\BluetoothService.exe'
  selection_2:
    OriginalFileName|contains:
    - BDSubmit.exe
    - bdsw.exe
  selection_3:
    ImageLoaded|contains: '*\log.dll'
  filter_4:
    ImageLoaded:
    - '*:\Program Files (x86)\*'
    - '*:\Program Files\*'
    - '*:\Windows\System32\*'
    - '*:\Windows\SysWOW64\*'
  condition: (selection_0 and selection_1 and selection_2 and selection_3) and not (filter_4)
