title: Windows PowerView Unconstrained Delegation Discovery
id: fbf9e47f-e531-4fea-942d-5c95af7ed4d6
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the use of PowerView commandlets to discover Windows endpoints with Kerberos Unconstrained Delegation. It leverages PowerShell Script Block Logging (EventCode=4104)
  to identify specific commands like `Get-DomainComputer` or `Get-NetComputer` with the `-Unconstrained` parameter. This activity is significant as it indicates potential reconnaissance efforts by adversaries
  or Red Teams to map out privileged delegation settings in Active Directory. If confirmed malicious, this could allow attackers to identify high-value targets for further exploitation, potentially leading
  to privilege escalation or lateral movement within the network.
references:
- https://attack.mitre.org/techniques/T1018/
- https://adsecurity.org/?p=1667
- https://docs.microsoft.com/en-us/defender-for-identity/cas-isp-unconstrained-kerberos
- https://www.ired.team/offensive-security-experiments/active-directory-kerberos-abuse/domain-compromise-via-unrestricted-kerberos-delegation
- https://www.cyberark.com/resources/threat-research-blog/weakness-within-kerberos-delegation
tags:
- attack.T1018
date: '2022-03-28'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*Get-DomainComputer*'
  selection_2:
    ScriptBlockText|contains: '*Get-NetComputer*'
  condition: selection_0 and selection_1 and selection_2
