title: Windows Phishing PDF File Executes URL Link
id: 2fa9dec8-9d8e-46d3-96c1-202c06f0e6e1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious PDF viewer processes spawning browser application child processes. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on
  process and parent process names. This activity is significant as it may indicate a PDF spear-phishing attempt where a malicious URL link is executed, leading to potential payload download. If confirmed
  malicious, this could allow attackers to execute code, escalate privileges, or persist in the environment by exploiting the user's browser to connect to a malicious site.
references:
- https://twitter.com/pr0xylife/status/1615382907446767616?s=20
tags:
- attack.t1566.001
date: '2023-01-18'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.parent_process_name  IN ("AcroRd32.exe", "FoxitPDFReader.exe") Processes.process_name IN ("firefox.exe", "chrome.exe", "iexplore.exe")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_phishing_pdf_file_executes_url_link_filter`
splunk_rule_id: 2fa9dec8-9d8e-46d3-96c1-202c06f0e6e1
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage:
    - AcroRd32.exe
    - FoxitPDFReader.exe
  selection_1:
    Image:
    - firefox.exe
    - chrome.exe
    - iexplore.exe
  condition: selection_0 and selection_1
