title: Windows Rundll32 Load DLL in Temp Dir
id: 520da6fa-7d5d-4a3b-9c61-1087517b8d0f
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This detection identifies instances where rundll32.exe is used to load a DLL from a temporary directory, such as C:\Users\<User>\AppData\Local\Temp\ or C:\Windows\Temp\. While rundll32.exe
  is a legitimate Windows utility used to execute functions exported from DLLs, its use to load libraries from temporary locations is highly suspicious. These directories are commonly used by malware and
  red team tools to stage payloads or execute code in-memory without writing it to more persistent locations. This behavior often indicates defense evasion, initial access, or privilege escalation, especially
  when the DLL is unsigned, recently written, or executed shortly after download. In normal user workflows, DLLs are not typically loaded from Temp paths, making this a high-fidelity indicator of potentially
  malicious activity. Monitoring this pattern is essential for detecting threats that attempt to blend in with native system processes while bypassing traditional application controls.
references:
- https://blog.sekoia.io/interlock-ransomware-evolving-under-the-radar/
tags:
- attack.T1218_011
date: '2023-09-19'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '*temp\*'
    - '*\tmp\*'
  condition: selection_0
