title: Windows User Discovery Via Net
id: 7742987e-88c1-476b-a626-a869e088ab72
status: stable
level: medium
author: Mauricio Velazco, Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: The following analytic detects the execution of `net.exe` or `net1.exe` with command-line arguments `user` or `users` to query local user accounts. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on process names and command-line executions. This activity is significant as it indicates potential reconnaissance efforts by adversaries to enumerate local users,
  which is a common step in situational awareness and Active Directory discovery. If confirmed malicious, this behavior could lead to further attacks, including privilege escalation and lateral movement
  within the network.
references:
- https://attack.mitre.org/techniques/T1087/001/
tags:
- attack.t1087.001
date: '2021-08-24'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE `process_net` (Processes.process="*user"
      OR
      Processes.process="*users"
      OR
      Processes.process="*users *"
      OR
      Processes.process="*user *")
      AND
      NOT (Processes.process="*/add"
      OR
      Processes.process="*/delete")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_user_discovery_via_net_filter`
splunk_rule_id: 7742987e-88c1-476b-a626-a869e088ab72
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|endswith: user
  selection_1:
    CommandLine|endswith: users
  selection_2:
    CommandLine|contains: 'users '
  selection_3:
    CommandLine|contains: 'user '
  condition: selection_0 and selection_1 and selection_2 and selection_3
