title: Windows Sensitive Registry Hive Dump Via CommandLine
id: 5aaff29d-0cce-405b-9ee8-5d06b49d045e
status: stable
level: medium
author: Michael Haag, Patrick Bareiss, Nasreddine Bencherchali, Splunk
description: The following analytic detects the use of `reg.exe` to export Windows Registry hives, which may contain sensitive credentials. This detection leverages data from Endpoint Detection and Response
  (EDR) agents, focusing on command-line executions involving `save` or `export` actions targeting the `sam`, `system`, or `security` hives. This activity is significant as it indicates potential offline
  credential access attacks, often executed from untrusted processes or scripts. If confirmed malicious, attackers could gain access to credential data, enabling further compromise and lateral movement
  within the network.
references:
- https://www.mandiant.com/resources/shining-a-light-on-darkside-ransomware-operations
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md
- https://media.defense.gov/2023/May/24/2003229517/-1/-1/0/CSA_Living_off_the_Land.PDF
tags:
- attack.T1003_002
date: '2021-05-12'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine:
    - '*save*'
    - '*export*'
  selection_1:
    CommandLine:
    - '*/E *'
    - '*-E *'
  selection_2:
    CommandLine|contains:
    - '*HKEY_LOCAL_MACHINE\SAM*'
    - '*HKEY_LOCAL_MACHINE\Security*'
    - '*HKEY_LOCAL_MACHINE\System*'
    - '*HKLM\SAM*'
    - '*HKLM\Security*'
    - '*HKLM\System*'
  condition: selection_0 and selection_1 and selection_2
