title: Windows Command Obfuscation with Environment Variable Substrings
id: 08a9ddcc-5b02-4055-abc5-945ba399f596
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects command obfuscation by using a technique to build a target command using character indexes from environment variables.
  This hides the true intent of the command by building it on the fly.
  In Windows command prompt, you can use the :~ format to extract substrings from environment variable values.
  This behavior has been observed in various malware families, including Cobalt Strike and Meterpreter.
tags:
- attack.T1027_010
date: '2021-05-07'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*%%*:~*,*'
  condition: selection_0
