title: Windows WinRAR Launched Outside Default Installation Directory
id: 3b711292-9793-4a88-8e89-6e016cfbc09c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  This Analytics detects the execution of WinRAR or RAR outside the default installation directory.
  This behavior can be significant as it could indicate attempts to archive collected sensitive data from the endpoint for exfiltration.
  We recommend reviewing the process path and the parent process path to determine if the execution is legitimate and if possible validate the data being archived.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/py.blankgrabber
tags:
- attack.T1047
date: '2026-03-16'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image|contains:
    - Winrar.exe
    - rar.exe
  filter_1:
    Image:
    - '*:\Program Files (x86)\WinRAR\*'
    - '*:\Program Files\WinRAR\*'
  condition: (selection_0) and not (filter_1)
