title: Windows Service Stop Attempt
id: dd0f07ea-f08f-4d88-96e5-cb58156e82b6
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies attempts to stop services on a system using `net.exe`, `sc.exe` or the "Stop-Service" cmdlet. It leverages Endpoint Detection and Response (EDR) telemetry.
  This activity can be significant as adversaries often terminate security or critical services to evade detection and further their objectives. If confirmed malicious, this behavior could allow attackers
  to disable security defenses, facilitate ransomware encryption, or disrupt essential services, leading to potential data loss or system compromise.
references:
- https://www.microsoft.com/en-us/security/blog/2022/10/14/new-prestige-ransomware-impacts-organizations-in-ukraine-and-poland/
tags:
- attack.t1489
date: '2022-11-30'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          (`process_net`
          OR
          `process_sc`) Processes.process="* stop *"
      )
      OR Processes.process="*Stop-Service *"
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_service_stop_attempt_filter`
splunk_rule_id: dd0f07ea-f08f-4d88-96e5-cb58156e82b6
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '* stop *'
  selection_1:
    CommandLine|contains: 'Stop-Service '
  condition: selection_0 and selection_1
