title: Windows Diskshadow Proxy Execution
id: 58adae9e-8ea3-11ec-90f6-acde48001122
status: stable
level: medium
author: Lou Stella, Splunk
description: The following analytic detects the use of DiskShadow.exe in scripting mode, which can execute arbitrary unsigned code. It leverages data from Endpoint Detection and Response (EDR) agents, focusing
  on command-line executions with scripting mode flags. This activity is significant because DiskShadow.exe is typically used for legitimate backup operations, but its misuse can indicate an attempt to
  execute unauthorized code. If confirmed malicious, this could lead to unauthorized code execution, potentially compromising the system and allowing further malicious activities.
references:
- https://bohops.com/2018/03/26/diskshadow-the-return-of-vss-evasion-persistence-and-active-directory-database-extraction/
tags:
- attack.t1218
date: '2022-02-17'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  (Processes.process_name=diskshadow.exe OR Processes.original_file_name=diskshadow.exe)
  Processes.process IN (*-s*, */s*)
  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
     Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid Processes.process_hash
     Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path
     Processes.user Processes.user_id Processes.vendor_product | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_diskshadow_proxy_execution_filter`
splunk_rule_id: 58adae9e-8ea3-11ec-90f6-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: diskshadow.exe
  selection_1:
    OriginalFileName: diskshadow.exe
  selection_2:
    CommandLine|contains:
    - -s
    - /s
  condition: selection_0 and selection_1 and selection_2
