title: Windows Privilege Escalation User Process Spawn System Process
id: c9687a28-39ad-43c6-8bcf-eaf061ba0cbe
status: stable
level: medium
author: Steven Dick
description: |
  The following analytic detects when a process with low, medium, or high integrity spawns a system integrity process from a user-controlled location.
  This behavior is indicative of privilege escalation attempts where attackers elevate their privileges to SYSTEM level from a user-controlled process or service.
  The detection leverages Sysmon data, specifically Event ID 15, to identify such transitions.
  Monitoring this activity is crucial as it can signify an attacker gaining SYSTEM-level access, potentially leading to full control over the affected system, unauthorized access to sensitive data, and further malicious activities.
references:
- https://attack.mitre.org/techniques/T1068/
- https://vuls.cert.org/confluence/display/Wiki/2021/06/21/Finding+Privilege+Escalation+Vulnerabilities+in+Windows+using+Process+Monitor
- https://redcanary.com/blog/getsystem-offsec/
- https://atomicredteam.io/privilege-escalation/T1134.001/
tags:
- attack.t1068
- attack.t1548
- attack.t1134
date: '2024-02-14'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime

  from datamodel=Endpoint.Processes where

  Processes.process_integrity_level IN (
      "low",
      "medium",
      "high"
  )
  Processes.process_path IN (
      "*\\\\*",
      "*\\ProgramData\\*",
      "*\\Temp\\*",
      "*\\Users\\*"
  )
  NOT Processes.user IN (
      "*SYSTEM",
      "*LOCAL SERVICE",
      "*NETWORK SERVICE",
      "DWM-*",
      "*$"
  )

  by Processes.action Processes.dest Processes.original_file_name
     Processes.parent_process Processes.parent_process_exec
     Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path
     Processes.process Processes.process_exec Processes.process_guid
     Processes.process_hash Processes.process_id Processes.process_integrity_level
     Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product

  | `drop_dm_object_name(Processes)`
  | eval join_guid = process_guid

  | join max=0 dest join_guid [

          | tstats `security_content_summariesonly`
            count max(_time) as lastTime

          from datamodel=Endpoint.Processes where

          Processes.process_integrity_level="system"
          Processes.parent_process_path IN (
              "*\\\\*",
              "*\\ProgramData\\*",
              "*\\Temp\\*",
              "*\\Users\\*"
          )

          by Processes.dest Processes.user Processes.parent_process_guid
             Processes.process_name Processes.process Processes.process_path
             Processes.process_integrity_level Processes.process_current_directory

          | `drop_dm_object_name(Processes)`
          | rename parent_process_guid as join_guid, process* as system_process*, user as system_user
      ]
  | fields dest user parent_process parent_process_name parent_process_guid
           process process_name process_guid process_integrity_level process_path
           process_current_directory system_process_name system_process system_process_path
           system_process_integrity_level system_process_current_directory system_user
           firstTime lastTime count

  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_privilege_escalation_user_process_spawn_system_process_filter`
splunk_rule_id: c9687a28-39ad-43c6-8bcf-eaf061ba0cbe
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    IntegrityLevel:
    - low
    - medium
    - high
  selection_1:
    Image|contains:
    - \\
    - \ProgramData\
    - \Temp\
    - \Users\
  filter_2:
    User:
    - '*SYSTEM'
    - '*LOCAL SERVICE'
    - '*NETWORK SERVICE'
    - DWM-*
    - '*$'
  condition: (selection_0 and selection_1) and not (filter_2)
