title: Windows Remote Management Execute Shell
id: 28b80028-851d-4b8d-88a5-375ba115418a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of winrshost.exe initiating CMD or PowerShell processes as part of a potential payload execution. winrshost.exe is associated with Windows Remote
  Management (WinRM) and is typically used for remote execution. By monitoring for this behavior, the detection identifies instances where winrshost.exe is leveraged to run potentially malicious commands
  or payloads via CMD or PowerShell. This behavior may indicate exploitation of remote management tools for unauthorized access or lateral movement within a compromised environment, signaling a potential
  security incident.
references:
- https://strontic.github.io/xcyclopedia/library/winrshost.exe-6790044CEB4BA5BE6AA8161460D990FD.html
tags:
- attack.t1021.006
date: '2023-04-12'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE Processes.parent_process_name="winrshost.exe"
      AND
      Processes.process_name IN ("cmd.exe","*powershell*", "pwsh.exe")
    BY Processes.action Processes.dest Processes.original_file_name
       Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid
       Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path
       Processes.process Processes.process_exec Processes.process_guid
       Processes.process_hash Processes.process_id Processes.process_integrity_level
       Processes.process_name Processes.process_path Processes.user
       Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_remote_management_execute_shell_filter`
splunk_rule_id: 28b80028-851d-4b8d-88a5-375ba115418a
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: winrshost.exe
  selection_1:
    Image|contains:
    - cmd.exe
    - powershell
    - pwsh.exe
  condition: selection_0 and selection_1
