title: Windows Explorer.exe Spawning PowerShell or Cmd
id: 593854c5-2182-49dd-9f31-18ef697445b9
status: stable
level: medium
author: Michael Haag, AJ King, Splunk, Jesse Hunter, Splunk Community Contributor
description: This detection identifies instances where Windows Explorer.exe spawns PowerShell or cmd.exe processes, particularly focusing on executions initiated by LNK files. This behavior is associated
  with the ZDI-CAN-25373 Windows shortcut zero-day vulnerability, where specially crafted LNK files are used to trigger malicious code execution through cmd.exe or powershell.exe. This technique has been
  actively exploited by multiple APT groups in targeted attacks through both HTTP and SMB delivery methods.
references:
- https://www.zerodayinitiative.com/advisories/ZDI-CAN-25373/
- https://www.trendmicro.com/en_us/research/25/c/windows-shortcut-zero-day-exploit.html
tags:
- attack.t1059.001
- attack.t1204.002
date: '2022-06-17'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.parent_process_path="*\\explorer.exe" `process_powershell`
  OR `process_cmd`  by  Processes.dest Processes.process_current_directory Processes.process_path Processes.process Processes.original_file_name Processes.parent_process Processes.parent_process_name Processes.parent_process_path
  Processes.parent_process_guid Processes.parent_process_id Processes.process_guid Processes.process_id Processes.user | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
  | `windows_explorer_exe_spawning_powershell_or_cmd_filter`'
splunk_rule_id: 593854c5-2182-49dd-9f31-18ef697445b9
splunk_rule_type: Hunting
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|endswith: '*\explorer.exe'
  condition: selection_0
