title: Windows Network Share Interaction Via Net
id: e51fbdb0-0be0-474f-92ea-d289f71a695e
status: stable
level: medium
author: Dean Luxton
description: The following analytic identifies network share discovery and collection activities performed on Windows systems using the Net command. Attackers often use network share discovery to identify
  accessible shared resources within a network, which can be a precursor to privilege escalation or data exfiltration. By monitoring Windows Event Logs for the usage of the Net command to list and interact
  with network shares, this detection helps identify potential reconnaissance and collection activities.
references:
- https://attack.mitre.org/techniques/T1135/
tags:
- attack.T1135
- attack.T1039
date: '2024-07-11'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: net.exe
  selection_1:
    OriginalFileName: net.exe
  selection_2:
    CommandLine|contains:
    - '*use *'
    - '*view*'
  condition: selection_0 and selection_1 and selection_2
