title: Windows Eventlog Cleared Via Wevtutil
id: fdb829a8-db84-4832-b64b-3e964cd44f01
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects the usage of wevtutil.exe with the "clear-log" parameter in order to clear the contents of logs. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line arguments. This activity is significant because clearing event logs can be an attempt to cover tracks after malicious actions, hindering forensic investigations. If confirmed malicious, this behavior could allow an attacker to erase evidence of their activities, making it difficult to trace their actions and understand the full scope of the compromise.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1070.001/T1070.001.md
tags:
- attack.T1685_005
date: '2019-10-16'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    Image: wevtutil.exe
  selection_1:
    CommandLine|contains:
    - '* cl *'
    - '*clear-log*'
  condition: selection_0 and selection_1
