title: Windows Audit Policy Disabled via Auditpol
id: 14e008e5-6723-4298-b0d4-e95b24e10c18
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: The following analytic identifies the execution of `auditpol.exe` with the "/set" command-line argument in order to disable a specific category or sub-category from the audit policy. It leverages
  data from Endpoint Detection and Response (EDR) agents, focusing on process names and command-line executions. This activity can be significant as it indicates potential defense evasion by adversaries
  or Red Teams, aiming to limit data that can be leveraged for detections and audits. If confirmed malicious, this behavior could allow attackers to bypass defenses, and plan further attacks, potentially
  leading to full machine compromise or lateral movement.
references:
- https://www.microsoft.com/en-us/security/blog/2021/01/20/deep-dive-into-the-solorigate-second-stage-activation-from-sunburst-to-teardrop-and-raindrop/
- https://www.cybereason.com/blog/research/prometei-botnet-exploiting-microsoft-exchange-vulnerabilities
- https://attack.mitre.org/techniques/T1562/002/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/auditpol-set
tags:
- attack.T1685_001
date: '2025-02-19'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: '*/set*'
  selection_1:
    CommandLine|contains:
    - '*/success:*'
    - '*/failure:*'
  selection_2:
    CommandLine|contains: '*disable*'
  filter_3:
    CommandLine:
    - '*/?*'
    - '*/exclude*'
  condition: (selection_0 and selection_1 and selection_2) and not (filter_3)
