title: Windows Steal Authentication Certificates CertUtil Backup
id: bac85b56-0b65-4ce5-aad5-d94880df0967
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects CertUtil.exe performing a backup of the Certificate Store. It leverages data from Endpoint Detection and Response (EDR) agents, focusing on specific command-line
  executions involving CertUtil with backup parameters. This activity is significant because it may indicate an attempt to steal authentication certificates, which are critical for secure communications.
  If confirmed malicious, an attacker could use the stolen certificates to impersonate users, decrypt sensitive data, or gain unauthorized access to systems, leading to severe security breaches.
references:
- https://specterops.io/wp-content/uploads/sites/3/2022/06/Certified_Pre-Owned.pdf
tags:
- attack.T1649
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - '*-backupdb *'
    - '*-backup *'
  condition: selection_0
