title: Windows PaperCut NG Spawn Shell
id: a602d9a2-aaea-45f8-bf0f-d851168d61ca
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances where the PaperCut NG application (pc-app.exe) spawns a Windows shell, such as cmd.exe or PowerShell. This behavior is identified using Endpoint Detection
  and Response (EDR) telemetry, focusing on process creation events where the parent process is pc-app.exe. This activity is significant as it may indicate an attacker attempting to gain unauthorized access
  or execute malicious commands on the system. If confirmed malicious, this could lead to unauthorized code execution, privilege escalation, or further compromise of the affected environment.
references:
- https://www.cisa.gov/news-events/alerts/2023/05/11/cisa-and-fbi-release-joint-advisory-response-active-exploitation-papercut-vulnerability
- https://www.papercut.com/kb/Main/PO-1216-and-PO-1219
tags:
- attack.T1059
- attack.T1190
- attack.T1133
date: '2022-06-17'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: pc-app.exe
  selection_1:
    Image: java.exe
  condition: selection_0 and selection_1
