title: Windows Suspicious C2 Named Pipe
id: 90599d85-dc2a-4d4c-8c59-9485c3665828
status: stable
level: medium
author: Raven Tait, Splunk
description: |
  The following analytic detects the creation or connection to known suspicious C2 named pipes.
  It leverages Sysmon EventCodes 17 and 18 to identify known default pipe names used by C2 tools.
  If confirmed malicious, this could allow an attacker to abuse these to potentially gain persistence, command and control, or further system compromise.
references:
- https://attack.mitre.org/techniques/T1218/009/
- https://docs.microsoft.com/en-us/windows/win32/ipc/named-pipes
tags:
- attack.T1559
- attack.T1021_002
- attack.T1055
date: '2025-12-08'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 17
  selection_1:
    EventID: 18
  filter_2:
    Image:
    - '*:\Program Files \(x86\)\Adobe*'
    - '*:\Program Files \(x86\)\Google*'
    - '*:\Program Files \(x86\)\Microsoft*'
    - '*:\Program Files\Adobe*'
    - '*:\Program Files\Google*'
    - '*:\Program Files\Microsoft*'
    - '*:\Windows\system32\SearchIndexer.exe'
    - '*:\Windows\System32\svchost.exe'
    - '*:\Windows\SystemApps\Microsoft*'
    - '*\Amazon\SSM\Instance*'
    - '*\AppData\Local\Google*'
    - '*\AppData\Local\Kingsoft\*'
    - '*\AppData\Local\Microsoft*'
    - System
  condition: (selection_0 and selection_1) and not (filter_2)
