title: Windows Modify System Firewall with Notable Process Path
id: cd6d7410-9146-4471-a418-49edba6dadc4
status: stable
level: medium
author: Teoderick Contreras, Will Metcalf, Splunk
description: The following analytic detects suspicious modifications to system firewall rules, specifically allowing execution of applications from notable and potentially malicious file paths. This detection
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on command-line executions involving firewall rule changes. This activity is significant as it may indicate an adversary attempting
  to bypass firewall restrictions to execute malicious files. If confirmed malicious, this could allow attackers to execute unauthorized code, potentially leading to further system compromise, data exfiltration,
  or persistence within the environment.
references:
- https://www.splunk.com/en_us/blog/security/more-than-just-a-rat-unveiling-njrat-s-mbr-wiping-capabilities.html
tags:
- attack.t1686
date: '2021-11-17'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Processes where Processes.process = "*firewall*" Processes.process =
  "*allow*" Processes.process = "*add*" Processes.process = "*ENABLE*" Processes.process IN ("*\\windows\\fonts\\*", "*\\windows\\temp\\*", "*\\users\\public\\*", "*\\windows\\debug\\*", "*\\Users\\Administrator\\Music\\*",
  "*\\Windows\\servicing\\*", "*\\Users\\Default\\*","*Recycle.bin*", "*\\Windows\\Media\\*", "\\Windows\\repair\\*", "*\\temp\\*", "*\\PerfLogs\\*") by Processes.action Processes.dest Processes.original_file_name
  Processes.parent_process Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_exec
  Processes.process_guid Processes.process_hash Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_modify_system_firewall_with_notable_process_path_filter`'
splunk_rule_id: cd6d7410-9146-4471-a418-49edba6dadc4
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains: firewall
  selection_1:
    CommandLine|contains: allow
  selection_2:
    CommandLine|contains: add
  selection_3:
    CommandLine|contains: ENABLE
  selection_4:
    CommandLine:
    - '*\windows\fonts\*'
    - '*\windows\temp\*'
    - '*\users\public\*'
    - '*\windows\debug\*'
    - '*\Users\Administrator\Music\*'
    - '*\Windows\servicing\*'
    - '*\Users\Default\*'
    - '*Recycle.bin*'
    - '*\Windows\Media\*'
    - \Windows\repair\*
    - '*\temp\*'
    - '*\PerfLogs\*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
