title: Windows Powershell Cryptography Namespace
id: f8b482f4-6d62-49fa-a905-dfa15698317b
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious PowerShell script execution involving the cryptography namespace via EventCode 4104. It leverages PowerShell Script Block Logging to identify scripts
  using cryptographic functions, excluding common hashes like SHA and MD5. This activity is significant as it is often associated with malware that decrypts or decodes additional malicious payloads. If
  confirmed malicious, this could allow an attacker to execute further code, escalate privileges, or establish persistence within the environment. Analysts should investigate the parent process, decrypted
  data, network connections, and the user executing the script.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.asyncrat
tags:
- attack.T1059_001
date: '2023-01-26'
logsource:
  product: windows
  service: powershell
detection:
  selection_0:
    EventID: 4104
  selection_1:
    ScriptBlockText|contains: '*System.Security.Cryptography*'
  filter_2:
    ScriptBlockText:
    - '*SHA*'
    - '*MD5*'
    - '*DeriveBytes*'
  condition: (selection_0 and selection_1) and not (filter_2)
