title: Windows WinLogon with Public Network Connection
id: 65615b3a-62ea-4d65-bb9f-6f07c17df4ea
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects instances of Winlogon.exe, a critical Windows process, connecting to public IP addresses. This behavior is identified using Endpoint Detection and Response (EDR)
  telemetry, focusing on network connections made by Winlogon.exe. Under normal circumstances, Winlogon.exe should not connect to public IPs, and such activity may indicate a compromise, such as the BlackLotus
  bootkit attack. This detection is significant as it highlights potential system integrity breaches. If confirmed malicious, attackers could maintain persistence, bypass security measures, and compromise
  the system at a fundamental level.
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
tags:
- attack.T1542_003
date: '2023-05-11'
logsource:
  category: all_traffic
  product: windows
detection:
  selection_0:
    Image|contains: winlogon.exe
  selection_1:
    process!: unknown
  condition: selection_0 and selection_1
