title: Windows AppX Deployment Unsigned Package Installation
id: 9b5e7c14-f8d2-4a3b-b1a7-e5c9f2a8d123
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects attempts to install unsigned MSIX/AppX packages using the -AllowUnsigned parameter. This detection leverages Windows event logs from the AppXDeployment-Server,
  specifically focusing on EventID 603 which indicates the start of a deployment operation with specific deployment flags. The flag value 8388608 corresponds to the -AllowUnsigned option in PowerShell's
  Add-AppxPackage cmdlet. This activity is significant as adversaries have been observed leveraging unsigned MSIX packages to deliver malware, bypassing signature verification that would normally protect
  users from malicious packages. If confirmed malicious, this could allow attackers to execute arbitrary code, establish persistence, or deliver malware while evading traditional detection mechanisms.
references:
- https://learn.microsoft.com/en-us/powershell/module/appx/add-appxpackage
- https://learn.microsoft.com/en-us/windows/msix/package/unsigned-package
- https://redcanary.com/blog/threat-intelligence/msix-installers/
- https://attack.mitre.org/techniques/T1553/005/
tags:
- attack.T1553_005
- attack.T1204_002
date: '2025-08-18'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    EventID: 603
  selection_1:
    Flags: '8388608'
  condition: selection_0 and selection_1
