title: Windows Suspicious QEMU Execution
id: c4c0a2d4-0675-4fde-97b7-115145ba257c
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects execution of the QEMU binary and an image file with the -nographic flag.
  This causes it to run in the background without any display.
  This has been observed as a persistence and initial access technique by some threat actors to install a rogue linux virtual machine
references:
- https://www.securonix.com/blog/crontrap-emulated-linux-environments-as-the-latest-tactic-in-malware-staging/
- https://www.bleepingcomputer.com/news/security/windows-infected-with-backdoored-linux-vms-in-new-phishing-attacks/
tags:
- attack.T1204_002
- attack.T1001
- attack.T1036
- attack.T1564_006
date: '2026-05-05'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 1
  selection_1:
    CommandLine|contains: '*-nographic*'
  selection_2:
    CommandLine|contains: '*.img*'
  selection_3:
    Description|contains: '*QEMU machine*'
  selection_4:
    Product: QEMU
  selection_5:
    Company|contains: '*qemu*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5
