title: Windows SpeechRuntime Suspicious Child Process
id: f7bb956f-b956-42a5-8c2c-ff9cdbbf7526
status: stable
level: medium
author: Raven Tait, Splunk
description: SpeechRuntime is vulnerable to an attack that allows a user to run code on another user's session remotely and stealthily by exploiting a Windows COM class. When this class is invoked, it launches
  SpeechRuntime.exe in the context of the currently logged-on user. Because this COM class is susceptible to COM Hijacking, the attacker can alter the registry remotely to point to a malicious DLL. By dropping
  that DLL on the target system (e.g., via SMB) and triggering the COM object, the attacker causes the malicious DLL to load into SpeechRuntime.exe and executing under the user's context. This detection
  identifies suspicious child processes of SpeechRuntime.exe that could indicate abuse of this vulnerability.
references:
- https://github.com/rtecCyberSec/SpeechRuntimeMove
tags:
- attack.t1021.003
date: '2025-08-27'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Processes
    WHERE (
          Processes.parent_process_name="*SpeechRuntime.exe*"
      )
      Processes.process IN ("*cmd.exe*","*powershell.exe*","*rundll32.exe*","*bitsadmin.exe*","*wmic.exe*","*cscript.exe*")
    BY Processes.dest Processes.user Processes.original_file_name
       Processes.parent_process Processes.process_name Processes.process
       Processes.process_id Processes.parent_process_id Processes.parent_process_name
       action parent_process_exec parent_process_guid
       parent_process_path process_exec process_guid
       process_hash process_integrity_level process_path
       user_id vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_speechruntime_suspicious_child_process_filter`
splunk_rule_id: f7bb956f-b956-42a5-8c2c-ff9cdbbf7526
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains: SpeechRuntime.exe
  selection_1:
    CommandLine|contains:
    - cmd.exe
    - powershell.exe
    - rundll32.exe
    - bitsadmin.exe
    - wmic.exe
    - cscript.exe
  condition: selection_0 and selection_1
