title: Windows MOF Event Triggered Execution via WMI
id: e59b5a73-32bf-4467-a585-452c36ae10c1
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of MOFComp.exe loading a MOF file, often triggered by cmd.exe or powershell.exe, or from unusual paths like User Profile directories. It leverages
  Endpoint Detection and Response (EDR) data, focusing on process names, parent processes, and command-line executions. This activity is significant as it may indicate an attacker using WMI for persistence
  or lateral movement. If confirmed malicious, it could allow the attacker to execute arbitrary code, maintain persistence, or escalate privileges within the environment.
references:
- https://attack.mitre.org/techniques/T1546/003/
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
- https://docs.microsoft.com/en-us/windows/win32/wmisdk/mofcomp
- https://pentestlab.blog/2020/01/21/persistence-wmi-event-subscription/
- https://www.sakshamdixit.com/wmi-events/
tags:
- attack.T1546_003
date: '2022-07-19'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage:
    - cmd.exe
    - powershell.exe
    Image: mofcomp.exe
  selection_1:
    Image: mofcomp.exe
    CommandLine:
    - '*\AppData\Local\*'
    - '*\Users\Public\*'
  condition: selection_0 and selection_1
