title: WinRM Spawning a Process
id: a081836a-ba4d-11eb-8593-acde48001122
status: experimental
level: medium
author: Drew Church, Michael Haag, Splunk
description: The following analytic detects suspicious processes spawned by WinRM (wsmprovhost.exe). It leverages data from Endpoint Detection and Response (EDR) agents, focusing on specific child processes
  like cmd.exe, powershell.exe, and others. This activity is significant as it may indicate exploitation attempts of vulnerabilities like CVE-2021-31166, which could lead to system instability or compromise.
  If confirmed malicious, attackers could execute arbitrary commands, escalate privileges, or maintain persistence, posing a severe threat to the environment.
references:
- https://github.com/SigmaHQ/sigma/blob/9b7fb0c0f3af2e53ed483e29e0d0f88ccf1c08ca/rules/windows/process_access/win_susp_shell_spawn_from_winrm.yml
- https://www.zerodayinitiative.com/blog/2021/5/17/cve-2021-31166-a-wormable-code-execution-bug-in-httpsys
- https://github.com/0vercl0k/CVE-2021-31166/blob/main/cve-2021-31166.py
tags:
- attack.T1190
date: '2021-05-21'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: wsmprovhost.exe
  selection_1:
    Image|contains:
    - cmd.exe
    - sh.exe
    - bash.exe
    - powershell.exe
    - pwsh.exe
    - schtasks.exe
    - certutil.exe
    - whoami.exe
    - bitsadmin.exe
    - scp.exe
  condition: selection_0 and selection_1
