title: WinRAR Spawning Shell Application
id: d2f36034-37fa-4bd4-8801-26807c15540f
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the execution of Windows shell processes initiated by WinRAR, such as "cmd.exe", "powershell.exe", "certutil.exe", "mshta.exe", or "bitsadmin.exe". This detection
  leverages data from Endpoint Detection and Response (EDR) agents, focusing on process and parent process relationships. This activity is significant because it may indicate exploitation of the WinRAR
  CVE-2023-38831 vulnerability, where malicious scripts are executed from spoofed ZIP archives. If confirmed malicious, this could lead to unauthorized access, financial loss, and further malicious activities
  like data theft or ransomware attacks.
references:
- https://www.group-ib.com/blog/cve-2023-38831-winrar-zero-day/
- https://github.com/BoredHackerBlog/winrar_CVE-2023-38831_lazy_poc
- https://github.com/b1tg/CVE-2023-38831-winrar-exploit
tags:
- attack.T1105
date: '2023-08-29'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage: winrar.exe
  selection_1:
    Image|contains:
    - certutil.exe
    - mshta.exe
    - bitsadmin.exe
  condition: selection_0 and selection_1
