title: WMI Permanent Event Subscription
id: 71bfdb13-f200-4c6c-b2c9-a2e07adf437d
status: experimental
level: medium
author: Rico Valdez, Splunk
description: The following analytic detects the creation of permanent event subscriptions using Windows Management Instrumentation (WMI). It leverages Sysmon EventID 5 data to identify instances where the
  event consumers are not the expected "NTEventLogEventConsumer." This activity is significant because it suggests an attacker is attempting to achieve persistence by running malicious scripts or binaries
  in response to specific system events. If confirmed malicious, this could lead to severe impacts such as data theft, ransomware deployment, or other damaging outcomes. Investigate the associated scripts
  or binaries to identify the source of the attack.
tags:
- attack.T1047
date: '2020-04-29'
logsource:
  product: windows
  service: wmi
detection:
  selection_0:
    EventID: 5861
  condition: selection_0
