title: WMIC XSL Execution via URL
id: 787e9dd0-4328-11ec-a029-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: |
  The following analytic detects `wmic.exe` loading a remote XSL script
  via a URL. This detection leverages Endpoint Detection and Response (EDR) data,
  focusing on command-line executions that include HTTP/HTTPS URLs and the /FORMAT
  switch. This activity is significant as it indicates a potential application control
  bypass, allowing adversaries to execute JScript or VBScript within an XSL file.
  If confirmed malicious, this technique can enable attackers to execute arbitrary
  code, escalate privileges, or maintain persistence using a trusted Windows tool,
  posing a severe threat to the environment.
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1220/T1220.md
- https://web.archive.org/web/20190814201250/https://subt0x11.blogspot.com/2018/04/wmicexe-whitelisting-bypass-hacking.html
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1220/T1220.md#atomic-test-4---wmic-bypass-using-remote-xsl-file
- https://securitydatasets.com/notebooks/atomic/windows/defense_evasion/SDWIN-201017061100.html
tags:
- attack.t1220
date: '2021-11-12'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Endpoint.Processes where
  `process_wmic`
  Processes.process IN ("*http://*", "*https://*")
  Processes.process="*/format:*"
  by Processes.action Processes.dest Processes.original_file_name Processes.parent_process
     Processes.parent_process_exec Processes.parent_process_guid Processes.parent_process_id
     Processes.parent_process_name Processes.parent_process_path Processes.process
     Processes.process_exec Processes.process_guid Processes.process_hash Processes.process_id
     Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user
     Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `wmic_xsl_execution_via_url_filter`
splunk_rule_id: 787e9dd0-4328-11ec-a029-acde48001122
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    CommandLine|contains:
    - http://
    - https://
  selection_1:
    CommandLine|contains: '/format:'
  condition: selection_0 and selection_1
