title: Wscript Or Cscript Suspicious Child Process
id: 1f35e1da-267b-11ec-90a9-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This analytic identifies a suspicious spawned process by WScript or CScript process. This technique was a common technique used by adversaries and malware to execute different LOLBIN, other
  scripts like PowerShell or spawn a suspended process to inject its code as a defense evasion. This TTP may detect some normal script that uses several application tools that are in the list of the child
  process it detects but a good pivot and indicator that a script may execute suspicious code.
references:
- https://www.hybrid-analysis.com/sample/8da5b75b6380a41eee3a399c43dfe0d99eeefaa1fd21027a07b1ecaa4cd96fdd?environmentId=120
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
tags:
- attack.T1055
- attack.T1134_004
- attack.T1543
date: '2021-10-06'
logsource:
  category: process_creation
  product: windows
detection:
  selection_0:
    ParentImage|contains:
    - cscript.exe
    - wscript.exe
  selection_1:
    Image|contains:
    - regsvr32.exe
    - rundll32.exe
    - winhlp32.exe
    - certutil.exe
    - msbuild.exe
    - cmd.exe
    - powershell*
    - pwsh.exe
    - wmic.exe
    - mshta.exe
  condition: selection_0 and selection_1
