title: XMRIG Driver Loaded
id: 90080fa6-a8df-11eb-91e4-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the installation of the XMRIG coinminer driver on a system. It identifies the loading of the `WinRing0x64.sys` driver, commonly associated with XMRIG, by analyzing
  Sysmon EventCode 6 logs for specific signatures and image loads. This activity is significant because XMRIG is an open-source CPU miner frequently exploited by adversaries to mine cryptocurrency illicitly.
  If confirmed malicious, this activity could lead to unauthorized resource consumption, degraded system performance, and potential financial loss due to unauthorized cryptocurrency mining.
references:
- https://www.trendmicro.com/vinfo/hk/threat-encyclopedia/malware/trojan.ps1.powtran.a/
tags:
- attack.T1543_003
date: '2021-05-07'
logsource:
  product: windows
  service: sysmon
detection:
  selection_0:
    EventID: 6
    Signature: Noriyuki MIYAZAKI
  selection_1:
    ImageLoaded|contains: '*\WinRing0x64.sys'
  condition: selection_0 and selection_1
