title: Zscaler Virus Download threat blocked
id: aa19e627-d448-4a31-85cd-82068dec5691
status: stable
level: medium
author: Gowthamaraj Rajendran, Rod Soto, Splunk
description: The following analytic identifies attempts to download viruses that were blocked by Zscaler within a network. It leverages web proxy logs to detect blocked actions indicative of virus download
  attempts. Key data points such as device owner, user, URL category, destination URL, and IP are analyzed. This activity is significant as it helps in early detection and remediation of potential virus
  threats, enhancing network security. If confirmed malicious, this activity could indicate an attempt to compromise the network, potentially leading to data breaches or further malware infections.
references:
- https://help.zscaler.com/zia/nss-feed-output-format-web-logs
tags:
- attack.T1566
date: '2024-04-17'
logsource:
  category: proxy
  product: windows
  service: zscaler
detection:
  selection_0:
    action: blocked
  selection_1:
    threatname!: None
  selection_2:
    threatclass: Virus
  condition: selection_0 and selection_1 and selection_2
