title: Adobe ColdFusion Access Control Bypass
id: d6821c0b-fcdc-4c95-a77f-e10752fae41a
status: stable
level: medium
author: Michael Haag, Splunk
description: |-
  The following analytic detects potential exploitation attempts against Adobe ColdFusion vulnerabilities CVE-2023-29298 and CVE-2023-26360.
  It monitors requests to specific ColdFusion Administrator endpoints, especially those with an unexpected additional forward slash, using the Web datamodel.
  This activity is significant for a SOC as it indicates attempts to bypass access controls, which can lead to unauthorized access to ColdFusion administration endpoints.
  If confirmed malicious, this could result in data theft, brute force attacks, or further exploitation of other vulnerabilities, posing a serious security risk to the environment.
references:
- https://www.rapid7.com/blog/post/2023/07/11/cve-2023-29298-adobe-coldfusion-access-control-bypass/
tags:
- attack.T1190
date: '2023-08-23'
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|contains:
    - '*//CFIDE/adminapi*'
    - '*//CFIDE/administrator*'
    - '*//CFIDE/componentutils*'
    - '*//CFIDE/main*'
    - '*//CFIDE/restplay*'
    - '*//CFIDE/servermanager*'
    - '*//CFIDE/wizards*'
    - '*//restplay*'
  selection_1:
    sc-status: 200
  condition: selection_0 and selection_1
