title: Adobe ColdFusion Unauthenticated Arbitrary File Read
id: 695aceae-21db-4e7f-93ac-a52e39d02b93
status: stable
level: medium
author: Michael Haag, Splunk
description: |-
  The following analytic detects potential exploitation of the Adobe ColdFusion vulnerability, CVE-2023-26360, which allows unauthenticated arbitrary file read.
  It monitors POST requests to the "/cf_scripts/scripts/ajax/ckeditor/*" endpoint using the Web datamodel.
  This activity can be significant due to the vulnerability's high CVSS score of 9.8, indicating severe risk.
  If confirmed malicious, it could lead to unauthorized data access, further attacks, or severe operational disruptions.
references:
- https://www.rapid7.com/db/modules/auxiliary/gather/adobe_coldfusion_fileread_cve_2023_26360/
- https://github.com/projectdiscovery/nuclei-templates/blob/main/http/cves/2023/CVE-2023-26360.yaml
tags:
- attack.T1190
date: '2023-08-23'
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|contains: '*/cf_scripts/scripts/ajax/ckeditor/*'
  selection_1:
    sc-status: 200
  selection_2:
    cs-method: POST
  condition: selection_0 and selection_1 and selection_2
