title: ConnectWise ScreenConnect Authentication Bypass
id: d3f7a803-e802-448b-8eb2-e796b223bfff
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects attempts to exploit the ConnectWise ScreenConnect CVE-2024-1709 vulnerability, which allows attackers to bypass authentication via an alternate path or channel.
  It leverages web request logs to identify access to the SetupWizard.aspx page, indicating potential exploitation. This activity is significant as it can lead to unauthorized administrative access and
  remote code execution. If confirmed malicious, attackers could create administrative users and gain full control over the affected system, posing severe security risks. Immediate remediation by updating
  to version 23.9.8 or above is recommended.
references:
- https://www.huntress.com/blog/a-catastrophe-for-control-understanding-the-screenconnect-authentication-bypass
- https://www.huntress.com/blog/detection-guidance-for-connectwise-cwe-288-2
- https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
tags:
- attack.t1190
date: '2024-02-22'
original_spl: |-
  | tstats count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Web
    WHERE Web.url IN ("*/SetupWizard.aspx/*","*/SetupWizard/") Web.status=200 Web.http_method=POST
    BY Web.src, Web.dest, Web.http_user_agent,
       Web.url, Web.status, Web.http_method,
       sourcetype, source
  | rex field=Web.url "/SetupWizard.aspx/(?<randomPath>.+)"
  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `connectwise_screenconnect_authentication_bypass_filter`
splunk_rule_id: d3f7a803-e802-448b-8eb2-e796b223bfff
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri:
    - '*/SetupWizard.aspx/*'
    - '*/SetupWizard/'
  selection_1:
    sc-status: 200
  selection_2:
    cs-method: POST
  condition: selection_0 and selection_1 and selection_2
