title: Detect attackers scanning for vulnerable JBoss servers
id: 104658f4-afdc-499e-9719-17243f982681
status: experimental
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies specific GET or HEAD requests to web servers that indicate reconnaissance attempts to find vulnerable JBoss servers. It leverages data from the Web data model,
  focusing on HTTP methods and URLs associated with JBoss management interfaces. This activity is significant because it often precedes exploitation attempts using tools like JexBoss, which can compromise
  the server. If confirmed malicious, attackers could gain unauthorized access, execute arbitrary code, or escalate privileges, leading to potential data breaches and system compromise.
tags:
- attack.t1082
- attack.t1133
date: '2020-04-29'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Web
    WHERE (
          Web.http_method="GET"
          OR
          Web.http_method="HEAD"
      )
      AND (Web.url="*/web-console/ServerInfo.jsp*" OR Web.url="*web-console*" OR Web.url="*jmx-console*" OR Web.url = "*invoker*")
    BY Web.http_method, Web.url, Web.src,
       Web.dest
  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `detect_attackers_scanning_for_vulnerable_jboss_servers_filter`
splunk_rule_id: 104658f4-afdc-499e-9719-17243f982681
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-method: GET
  selection_1:
    cs-method: HEAD
  condition: selection_0 and selection_1
