title: Detect Web Access to Decommissioned S3 Bucket
id: 3a1d8f62-5b9c-4e7d-b8f3-9d6a8e2f5e1f
status: experimental
level: medium
author: Jose Hernandez, Splunk
description: This detection identifies web requests to domains that match previously decommissioned S3 buckets through web proxy logs. This activity is significant because attackers may attempt to access
  or recreate deleted S3 buckets that were previously public to hijack them for malicious purposes. If successful, this could allow attackers to host malicious content or exfiltrate data through compromised
  bucket names that may still be referenced by legitimate applications.
references:
- https://docs.aws.amazon.com/AmazonS3/latest/userguide/access-control-block-public-access.html
- https://labs.watchtowr.com/8-million-requests-later-we-made-the-solarwinds-supply-chain-attack-look-amateur/
tags:
- attack.t1485
date: '2025-02-12'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime values(Web.http_method) as http_method values(Web.http_user_agent) as http_user_agent values(Web.url) as url values(Web.user) as user FROM datamodel=Web
    WHERE Web.url_domain!=""
    BY Web.src Web.url_domain
  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | eval bucket_domain = lower(url_domain)
  | lookup decommissioned_buckets bucketName as bucket_domain OUTPUT bucketName as match
  | where isnotnull(match)
  | `detect_web_access_to_decommissioned_s3_bucket_filter`
splunk_rule_id: 3a1d8f62-5b9c-4e7d-b8f3-9d6a8e2f5e1f
splunk_rule_type: Anomaly
logsource:
  category: webserver
detection:
  selection_0:
    Web.url_domain: ''
  condition: selection_0
