title: HTTP RMM User Agent
id: 61884b02-0dcf-44c5-9094-db33bac09fa6
status: stable
level: medium
author: Raven Tait, Splunk
description: This Splunk query analyzes web logs to identify and categorize user agents, detecting various types of Remote Monitoring and Mangement applications. This activity can signify possible compromised
  hosts on the network.
references:
- https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_http_user_agents_list.csv
tags:
- attack.t1071.001
- attack.t1219
date: '2026-01-06'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Web
    WHERE Web.http_user_agent != null
    BY Web.http_user_agent Web.http_method, Web.url,
       Web.url_length Web.src, Web.dest
  | `drop_dm_object_name("Web")`
  | lookup rmm_user_agents rmm_user_agent AS http_user_agent OUTPUT tool
  | where isnotnull(tool)
  | stats count min(firstTime) as first_seen max(lastTime) as last_seen
    BY tool url http_user_agent
       src dest
  | `security_content_ctime(first_seen)`
  | `security_content_ctime(last_seen)`
  | `http_rmm_user_agent_filter`
splunk_rule_id: 61884b02-0dcf-44c5-9094-db33bac09fa6
splunk_rule_type: Anomaly
logsource:
  category: webserver
detection:
  selection_0:
    cs-user-agent: 'null'
  condition: selection_0
