title: HTTP C2 Framework User Agent
id: 229dc225-6abe-4d28-89fd-edf874086162
status: stable
level: medium
author: Ravent Tait, Splunk
description: This Splunk query analyzes web logs to identify and categorize user agents, detecting various types of c2 frameworks. This activity can signify malicious actors attempting to interact with
  hosts on the network using known default configurations of command and control tools.
references:
- https://github.com/BC-SECURITY/Malleable-C2-Profiles
- https://www.keysight.com/blogs/en/tech/nwvs/2021/07/28/koadic-c3-command-control-decoded
- https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_http_user_agents_list.csv
tags:
- attack.t1071.001
date: '2026-01-06'
original_spl: |-
  | tstats  `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Web
    WHERE Web.http_user_agent != null
    BY Web.http_user_agent Web.http_method, Web.url,
       Web.url_length Web.src, Web.dest
  | `drop_dm_object_name("Web")`
  | lookup suspicious_c2_user_agents c2_user_agent AS http_user_agent OUTPUT tool, description
  | where isnotnull(tool)
  | stats count min(firstTime) as first_seen max(lastTime) as last_seen
    BY tool url http_user_agent
       src dest description
  | `security_content_ctime(first_seen)`
  | `security_content_ctime(last_seen)`
  | `http_c2_framework_user_agent_filter`
splunk_rule_id: 229dc225-6abe-4d28-89fd-edf874086162
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-user-agent: 'null'
  condition: selection_0
