title: HTTP RMM User Agent
id: 61884b02-0dcf-44c5-9094-db33bac09fa6
status: stable
level: medium
author: Raven Tait, Splunk
description: This Splunk query analyzes web logs to identify and categorize user agents, detecting various types of Remote Monitoring and Mangement applications. This activity can signify possible compromised
  hosts on the network.
references:
- https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_http_user_agents_list.csv
tags:
- attack.T1071_001
- attack.T1219
date: '2026-01-06'
logsource:
  category: webserver
detection:
  selection_0:
    cs-user-agent: 'null'
  condition: selection_0
