title: HTTP Rapid POST with Mixed Status Codes
id: c8c987d6-3a1a-4555-9a52-eea0741b6113
status: stable
level: medium
author: Raven Tait, Splunk
description: This detection identifies rapid-fire POST request attacks where an attacker sends more than 20 POST requests within a 5-second window, potentially attempting to exploit race conditions or overwhelm
  request handling. The pattern is particularly suspicious when responses vary in size or status codes, indicating successful exploitation attempts or probing for vulnerable endpoints.
references:
- https://portswigger.net/web-security/request-smuggling#what-is-http-request-smuggling
- https://portswigger.net/research/http1-must-die
- https://www.vaadata.com/blog/what-is-http-request-smuggling-exploitations-and-security-best-practices/
- https://www.securityweek.com/new-http-request-smuggling-attacks-impacted-cdns-major-orgs-millions-of-websites/
tags:
- attack.t1071.001
- attack.t1190
- attack.t1595
date: '2025-10-21'
original_spl: |-
  `nginx_access_logs` http_method="POST"
    | bin _time span=5s
    | rename dest_ip as dest
    | stats count, values(status) as status_codes, values(bytes_out) as bytes_out, values(uri_path) as uris
      BY _time, src_ip, dest,
         http_user_agent
    | where count>20
    | table _time, dest, src_ip, count, status_codes, bytes_out, http_user_agent
    | `http_rapid_post_with_mixed_status_codes_filter`
splunk_rule_id: c8c987d6-3a1a-4555-9a52-eea0741b6113
splunk_rule_type: Anomaly
logsource:
  category: webserver
  service: nginx
detection:
  selection_0:
    http_method: POST
  condition: selection_0
