title: HTTP Request to Reserved Name on IIS Server
id: 1e45e6a8-110b-4886-b815-8d69cf35bf0a
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects attempts to exploit a request smuggling technique against IIS that leverages a Windows quirk where requests for reserved Windows device names such as "/con" trigger an early server response before the request body is received.
  When combined with a Content-Length desynchronization, this behavior can lead to a parsing confusion between frontend and backend.
references:
- https://portswigger.net/web-security/request-smuggling#what-is-http-request-smuggling
- https://portswigger.net/research/http1-must-die
- https://www.vaadata.com/blog/what-is-http-request-smuggling-exploitations-and-security-best-practices/
- https://www.securityweek.com/new-http-request-smuggling-attacks-impacted-cdns-major-orgs-millions-of-websites/
tags:
- attack.T1071_001
- attack.T1190
date: '2025-10-21'
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|contains:
    - '*/aux'
    - '*/com1'
    - '*/com2'
    - '*/com3'
    - '*/com4'
    - '*/com5'
    - '*/com6'
    - '*/com7'
    - '*/con'
    - '*/nul'
    - '*/prn'
  condition: selection_0
