title: HTTP PUA User Agent
id: 21af5447-734f-4549-956b-7a255cb2b032
status: stable
level: medium
author: Raven Tait, Splunk
description: This Splunk query analyzes web logs to identify and categorize user agents, detecting various types of unwanted applications. This activity can signify possible compromised hosts on the network.
references:
- https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_http_user_agents_list.csv
tags:
- attack.T1071_001
date: '2026-01-06'
logsource:
  category: webserver
detection:
  selection_0:
    cs-user-agent: 'null'
  condition: selection_0
