title: HTTP C2 Framework User Agent
id: 229dc225-6abe-4d28-89fd-edf874086162
status: stable
level: medium
author: Ravent Tait, Splunk
description: This Splunk query analyzes web logs to identify and categorize user agents, detecting various types of c2 frameworks. This activity can signify malicious actors attempting to interact with
  hosts on the network using known default configurations of command and control tools.
references:
- https://github.com/BC-SECURITY/Malleable-C2-Profiles
- https://www.keysight.com/blogs/en/tech/nwvs/2021/07/28/koadic-c3-command-control-decoded
- https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_http_user_agents_list.csv
tags:
- attack.T1071_001
date: '2026-01-06'
logsource:
  category: webserver
detection:
  selection_0:
    cs-user-agent: 'null'
  condition: selection_0
