title: Ivanti Connect Secure Command Injection Attempts
id: 1f32a7e0-a060-4545-b7de-73fcf9ad536e
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies attempts to exploit the CVE-2023-46805 and CVE-2024-21887 vulnerabilities in Ivanti Connect Secure. It detects POST requests to specific URIs that leverage
  command injection to execute arbitrary commands. The detection uses the Web datamodel to monitor for these requests and checks for a 200 OK response, indicating a successful exploit attempt. This activity
  is significant as it can lead to unauthorized command execution on the server. If confirmed malicious, attackers could gain control over the system, leading to potential data breaches or further network
  compromise.
references:
- https://github.com/RootUp/PersonalStuff/blob/master/http-vuln-cve2023-46805_2024_21887.nse
- https://github.com/projectdiscovery/nuclei-templates/blob/c6b351e71b0fb0e40e222e97038f1fe09ac58194/http/misconfiguration/ivanti/CVE-2023-46085-CVE-2024-21887-mitigation-not-applied.yaml
- https://github.com/rapid7/metasploit-framework/pull/18708/files
- https://attackerkb.com/topics/AdUh6by52K/cve-2023-46805/rapid7-analysis
- https://labs.watchtowr.com/welcome-to-2024-the-sslvpn-chaos-continues-ivanti-cve-2023-46805-cve-2024-21887/
- https://twitter.com/GreyNoiseIO/status/1747711939466453301
tags:
- attack.t1190
date: '2024-01-17'
original_spl: |-
  | tstats count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Web
    WHERE Web.url IN("*/api/v1/totp/user-backup-code/../../system/maintenance/archiving/cloud-server-test-connection*","*/api/v1/totp/user-backup-code/../../license/keys-status/*") Web.http_method IN ("POST", "GET") Web.status=200
    BY Web.src, Web.dest, Web.http_user_agent,
       Web.url, Web.http_method, Web.status
  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `ivanti_connect_secure_command_injection_attempts_filter`
splunk_rule_id: 1f32a7e0-a060-4545-b7de-73fcf9ad536e
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|contains:
    - /api/v1/totp/user-backup-code/../../system/maintenance/archiving/cloud-server-test-connection
    - /api/v1/totp/user-backup-code/../../license/keys-status/
  selection_1:
    cs-method:
    - POST
    - GET
  selection_2:
    sc-status: 200
  condition: selection_0 and selection_1 and selection_2
