title: Ivanti Connect Secure SSRF in SAML Component
id: 8e6ca490-7af3-4299-9a24-39fb69759925
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies POST requests targeting endpoints vulnerable to the SSRF issue (CVE-2024-21893) in Ivanti's products. It leverages the Web data model, focusing on endpoints
  such as /dana-ws/saml20.ws, /dana-ws/saml.ws, /dana-ws/samlecp.ws, and /dana-na/auth/saml-logout.cgi. The detection filters for POST requests that received an HTTP 200 OK response, indicating successful
  execution. This activity is significant as it may indicate an attempt to exploit SSRF vulnerabilities, potentially allowing attackers to access internal services or sensitive data. If confirmed malicious,
  this could lead to unauthorized access and data exfiltration.
references:
- https://attackerkb.com/topics/FGlK1TVnB2/cve-2024-21893/rapid7-analysis
- https://www.assetnote.io/resources/research/ivantis-pulse-connect-secure-auth-bypass-round-two
tags:
- attack.T1190
date: '2024-02-14'
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|contains:
    - '*/dana-ws/saml20.ws*'
    - '*/dana-ws/saml.ws*'
    - '*/dana-ws/samlecp.ws*'
    - '*/dana-na/auth/saml-logout.cgi/*'
  selection_1:
    cs-method: POST
  selection_2:
    sc-status: 200
  condition: selection_0 and selection_1 and selection_2
