title: Ivanti EPM SQL Injection Remote Code Execution
id: e20564ca-c86c-4e30-acdb-a8486673426f
status: stable
level: medium
author: Michael Haag
description: |-
  This detection identifies potential exploitation of a critical SQL injection vulnerability in Ivanti Endpoint Manager (EPM), identified as CVE-2024-29824.
  The vulnerability, which has a CVSS score of 9.8, allows for remote code execution through the `RecordGoodApp` function in the `PatchBiz.dll` file.
  An attacker can exploit this vulnerability by manipulating the `goodApp.md5` value in an HTTP POST request to the `/WSStatusEvents/EventHandler.asmx` endpoint, leading to unauthorized command execution on the server.
  Monitoring for unusual SQL commands and HTTP requests to this endpoint can help identify exploitation attempts.
  Note that, the detection is focused on the URI path, HTTP method and status code of 200, indicating potential exploitation.
  To properly identify if this was successful, TLS inspection and additional network traffic analysis is required as the xp_cmdshell comes in via the request body.
references:
- https://www.horizon3.ai/attack-research/attack-blogs/cve-2024-29824-deep-dive-ivanti-epm-sql-injection-remote-code-execution-vulnerability/
- https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-29824
- https://github.com/projectdiscovery/nuclei-templates/pull/10020/files
tags:
- attack.t1190
date: '2024-07-25'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  FROM datamodel=Web WHERE

  Web.url="*/WSStatusEvents/EventHandler.asmx"
  Web.http_method=POST
  Web.status=200

  BY Web.http_user_agent Web.status Web.http_method
     Web.url Web.url_length Web.src Web.dest

  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `ivanti_epm_sql_injection_remote_code_execution_filter`
splunk_rule_id: e20564ca-c86c-4e30-acdb-a8486673426f
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|endswith: /WSStatusEvents/EventHandler.asmx
  selection_1:
    cs-method: POST
  selection_2:
    sc-status: 200
  condition: selection_0 and selection_1 and selection_2
