title: JetBrains TeamCity RCE Attempt
id: 89a58e5f-1365-4793-b45c-770abbb32b6c
status: stable
level: medium
author: Michael Haag, Splunk
description: |-
  The following analytic detects attempts to exploit the CVE-2023-42793 vulnerability in JetBrains TeamCity On-Premises.
  It identifies suspicious POST requests to /app/rest/users/id:1/tokens/RPC2, leveraging the Web datamodel to monitor specific URL patterns and HTTP methods.
  This activity is significant as it may indicate an unauthenticated attacker attempting to gain administrative access via Remote Code Execution (RCE).
  If confirmed malicious, this could allow the attacker to execute arbitrary code, potentially compromising the entire TeamCity environment and leading to further unauthorized access and data breaches.
references:
- https://blog.jetbrains.com/teamcity/2023/09/critical-security-issue-affecting-teamcity-on-premises-update-to-2023-05-4-now/
- https://www.sonarsource.com/blog/teamcity-vulnerability/
- https://github.com/rapid7/metasploit-framework/pull/18408
- https://attackerkb.com/topics/1XEEEkGHzt/cve-2023-42793/rapid7-analysis
tags:
- attack.t1190
date: '2023-10-01'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  FROM datamodel=Web WHERE

  Web.url="*/app/rest/users/id:1/tokens/RPC2*"
  Web.status=200
  Web.http_method="POST"

  BY Web.http_user_agent Web.status Web.http_method
     Web.url Web.url_length Web.src Web.dest

  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `jetbrains_teamcity_rce_attempt_filter`
splunk_rule_id: 89a58e5f-1365-4793-b45c-770abbb32b6c
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|contains: /app/rest/users/id:1/tokens/RPC2
  selection_1:
    sc-status: 200
  selection_2:
    cs-method: POST
  condition: selection_0 and selection_1 and selection_2
