title: Nginx ConnectWise ScreenConnect Authentication Bypass
id: b3f7a803-e802-448b-8eb2-e796b223bccc
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects attempts to exploit the ConnectWise ScreenConnect CVE-2024-1709 vulnerability, which allows attackers to bypass authentication via alternate paths or channels.
  It leverages Nginx access logs to identify web requests to the SetupWizard.aspx page, indicating potential exploitation. This activity is significant as it can lead to unauthorized administrative access
  and remote code execution. If confirmed malicious, attackers could create administrative users and gain full control over the affected ScreenConnect instance, posing severe security risks. Immediate remediation
  by updating to version 23.9.8 or above is recommended.
references:
- https://docs.splunk.com/Documentation/AddOns/released/NGINX/Sourcetypes
- https://gist.github.com/MHaggis/26f59108b04da8f1d870c9cc3a3c8eec
- https://www.huntress.com/blog/a-catastrophe-for-control-understanding-the-screenconnect-authentication-bypass
- https://www.huntress.com/blog/detection-guidance-for-connectwise-cwe-288-2
- https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
tags:
- attack.t1190
date: '2024-02-22'
original_spl: |-
  `nginx_access_logs` uri_path IN ("*/SetupWizard.aspx/*","*/SetupWizard/") status=200 http_method=POST
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY src, dest, http_user_agent,
         url, uri_path, status,
         http_method, sourcetype, source
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `nginx_connectwise_screenconnect_authentication_bypass_filter`
splunk_rule_id: b3f7a803-e802-448b-8eb2-e796b223bccc
splunk_rule_type: TTP
logsource:
  category: webserver
  service: nginx
detection:
  selection_0:
    uri_path:
    - '*/SetupWizard.aspx/*'
    - '*/SetupWizard/'
  selection_1:
    status: 200
  selection_2:
    http_method: POST
  condition: selection_0 and selection_1 and selection_2
