title: PaperCut NG Remote Web Access Attempt
id: 9fcb214a-dc42-4ce7-a650-f1d2cab16a6a
status: stable
level: medium
author: Michael Haag, Splunk
description: |
  The following analytic detects potential exploitation attempts on publicly accessible PaperCut NG servers.
  It identifies connections from public IP addresses to the server, specifically monitoring URI paths commonly used in proof-of-concept scripts for exploiting PaperCut NG vulnerabilities.
  This detection leverages web traffic data from the `Web` datamodel, focusing on specific URI paths and excluding internal IP ranges.
  This activity is significant as it may indicate an attempt to exploit known vulnerabilities in PaperCut NG, potentially leading to unauthorized access or control of the server.
  If confirmed malicious, attackers could gain administrative access, leading to data breaches or further network compromise.
references:
- https://www.cisa.gov/news-events/alerts/2023/05/11/cisa-and-fbi-release-joint-advisory-response-active-exploitation-papercut-vulnerability
- https://www.papercut.com/kb/Main/PO-1216-and-PO-1219
- https://www.horizon3.ai/papercut-cve-2023-27350-deep-dive-and-indicators-of-compromise/
- https://www.bleepingcomputer.com/news/security/hackers-actively-exploit-critical-rce-bug-in-papercut-servers/
- https://www.huntress.com/blog/critical-vulnerabilities-in-papercut-print-management-software
tags:
- attack.t1190
- attack.t1133
date: '2023-05-15'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  from datamodel=Web WHERE

  Web.url IN (
    "*/app?service=direct/1/PrinterDetails/printerOptionsTab.tab"
    "*/app?service=direct/1/PrinterList/selectPrinter&sp=*",
    "*/app?service=page/PrinterList",
    "*/app?service=page/SetupCompleted"
  )
  NOT src IN (
                "10.0.0.0/8",
                "172.16.0.0/12",
                "192.168.0.0/16",
                "100.64.0.0/10",
                "127.0.0.0/8",
                "169.254.0.0/16",
                "192.0.0.0/24",
                "192.0.0.0/29",
                "192.0.0.8/32",
                "192.0.0.9/32",
                "192.0.0.10/32",
                "192.0.0.170/32",
                "192.0.0.171/32",
                "192.0.2.0/24",
                "192.31.196.0/24",
                "192.52.193.0/24",
                "192.88.99.0/24",
                "224.0.0.0/4",
                "192.175.48.0/24",
                "198.18.0.0/15",
                "198.51.100.0/24",
                "203.0.113.0/24",
                "240.0.0.0/4",
                "::1"
              )
  by Web.http_user_agent Web.http_method
     Web.url,Web.url_length Web.src
     Web.dest Web.dest_port

  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `papercut_ng_remote_web_access_attempt_filter`
splunk_rule_id: 9fcb214a-dc42-4ce7-a650-f1d2cab16a6a
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri:
    - '*/app?service=direct/1/PrinterDetails/printerOptionsTab.tab'
    - '*/app?service=direct/1/PrinterList/selectPrinter&sp=*'
    - '*/app?service=page/PrinterList'
    - '*/app?service=page/SetupCompleted'
  filter_1:
    src:
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 100.64.0.0/10
    - 127.0.0.0/8
    - 169.254.0.0/16
    - 192.0.0.0/24
    - 192.0.0.0/29
    - 192.0.0.8/32
    - 192.0.0.9/32
    - 192.0.0.10/32
    - 192.0.0.170/32
    - 192.0.0.171/32
    - 192.0.2.0/24
    - 192.31.196.0/24
    - 192.52.193.0/24
    - 192.88.99.0/24
    - 224.0.0.0/4
    - 192.175.48.0/24
    - 198.18.0.0/15
    - 198.51.100.0/24
    - 203.0.113.0/24
    - 240.0.0.0/4
    - ::1
  condition: (selection_0) and not (filter_1)
