title: SQL Injection with Long URLs
id: e0aad4cf-0790-423b-8328-7564d0d938f9
status: experimental
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects long URLs containing multiple SQL commands, indicating a potential SQL injection attack. This detection leverages web traffic data, specifically targeting web
  server destinations with URLs longer than 1024 characters or HTTP user agents longer than 200 characters. SQL injection is significant as it allows attackers to manipulate a web application's database,
  potentially leading to unauthorized data access or modification. If confirmed malicious, this activity could result in data breaches, unauthorized access, and complete system compromise. Immediate investigation
  and validation of alerts are crucial to mitigate these risks.
tags:
- attack.t1190
date: '2019-10-16'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Web
    WHERE Web.dest_category=web_server
      AND
      (Web.url_length > 1024
      OR
      Web.http_user_agent_length > 200)
    BY Web.src Web.dest Web.url
       Web.url_length Web.http_user_agent
  | `drop_dm_object_name("Web")`
  | eval url=lower(url)
  | eval num_sql_cmds=mvcount(split(url, "alter%20table")) + mvcount(split(url, "between")) + mvcount(split(url, "create%20table")) + mvcount(split(url, "create%20database")) + mvcount(split(url, "create%20index")) + mvcount(split(url, "create%20view")) + mvcount(split(url, "delete")) + mvcount(split(url, "drop%20database")) + mvcount(split(url, "drop%20index")) + mvcount(split(url, "drop%20table")) + mvcount(split(url, "exists")) + mvcount(split(url, "exec")) + mvcount(split(url, "group%20by")) + mvcount(split(url, "having")) + mvcount(split(url, "insert%20into")) + mvcount(split(url, "inner%20join")) + mvcount(split(url, "left%20join")) + mvcount(split(url, "right%20join")) + mvcount(split(url, "full%20join")) + mvcount(split(url, "select")) + mvcount(split(url, "distinct")) + mvcount(split(url, "select%20top")) + mvcount(split(url, "union")) + mvcount(split(url, "xp_cmdshell")) - 24
  | where num_sql_cmds > 3
  | `sql_injection_with_long_urls_filter`
splunk_rule_id: e0aad4cf-0790-423b-8328-7564d0d938f9
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    Web.dest_category: web_server
  condition: selection_0
