title: Supernova Webshell
id: 2ec08a09-9ff1-4dac-b59f-1efd57972ec1
status: experimental
level: medium
author: John Stoner, Splunk
description: The following analytic detects the presence of the Supernova webshell, used in the SUNBURST attack, by identifying specific patterns in web URLs. The detection leverages Splunk to search for
  URLs containing "*logoimagehandler.ashx*codes*", "*logoimagehandler.ashx*clazz*", "*logoimagehandler.ashx*method*", and "*logoimagehandler.ashx*args*". This activity is significant as it indicates potential
  unauthorized access and arbitrary code execution on a compromised system. If confirmed malicious, this could lead to data theft, ransomware deployment, or other severe outcomes. Immediate steps include
  reviewing the web URLs, inspecting on-disk artifacts, and analyzing concurrent processes and network connections.
references:
- https://www.splunk.com/en_us/blog/security/detecting-supernova-malware-solarwinds-continued.html
- https://www.guidepointsecurity.com/blog/supernova-solarwinds-net-webshell-analysis/
tags:
- attack.t1505.003
- attack.t1133
date: '2021-01-06'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Web.Web
    WHERE web.url=*logoimagehandler.ashx*codes*
      OR
      Web.url=*logoimagehandler.ashx*clazz*
      OR
      Web.url=*logoimagehandler.ashx*method*
      OR
      Web.url=*logoimagehandler.ashx*args*
    BY Web.src Web.dest Web.url
       Web.vendor_product Web.user Web.http_user_agent
       _time span=1s
  | `supernova_webshell_filter`
splunk_rule_id: 2ec08a09-9ff1-4dac-b59f-1efd57972ec1
splunk_rule_type: TTP
logsource:
  category: web
detection:
  selection_0:
    web.url|contains: logoimagehandler.ashx*codes
  selection_1:
    cs-uri|contains: logoimagehandler.ashx*clazz
  selection_2:
    cs-uri|contains: logoimagehandler.ashx*method
  selection_3:
    cs-uri|contains: logoimagehandler.ashx*args
  condition: selection_0 and selection_1 and selection_2 and selection_3
