title: Supernova Webshell
id: 2ec08a09-9ff1-4dac-b59f-1efd57972ec1
status: experimental
level: medium
author: John Stoner, Splunk
description: The following analytic detects the presence of the Supernova webshell, used in the SUNBURST attack, by identifying specific patterns in web URLs. The detection leverages Splunk to search for
  URLs containing "*logoimagehandler.ashx*codes*", "*logoimagehandler.ashx*clazz*", "*logoimagehandler.ashx*method*", and "*logoimagehandler.ashx*args*". This activity is significant as it indicates potential
  unauthorized access and arbitrary code execution on a compromised system. If confirmed malicious, this could lead to data theft, ransomware deployment, or other severe outcomes. Immediate steps include
  reviewing the web URLs, inspecting on-disk artifacts, and analyzing concurrent processes and network connections.
references:
- https://www.splunk.com/en_us/blog/security/detecting-supernova-malware-solarwinds-continued.html
- https://www.guidepointsecurity.com/blog/supernova-solarwinds-net-webshell-analysis/
tags:
- attack.T1505_003
- attack.T1133
date: '2021-01-06'
logsource:
  category: web
detection:
  selection_0:
    url|contains: '*logoimagehandler.ashx*'
  selection_1:
    cs-uri|contains: '*logoimagehandler.ashx*'
  selection_2:
    cs-uri|contains: '*logoimagehandler.ashx*'
  selection_3:
    cs-uri|contains: '*logoimagehandler.ashx*'
  condition: selection_0 and selection_1 and selection_2 and selection_3
