title: Tomcat Session File Upload Attempt
id: a1d8f5c3-9b7e-4f2d-8c51-3bca5e672410
status: stable
level: medium
author: Michael Haag, Splunk
description: This detection identifies potential exploitation of CVE-2025-24813 in Apache Tomcat through the initial stage of the attack. This first phase occurs when an attacker attempts to upload a malicious
  serialized Java object with a .session file extension via an HTTP PUT request. When successful, these uploads typically result in HTTP status codes 201 (Created) or 409 (Conflict) and create the foundation
  for subsequent deserialization attacks by placing malicious content in a location where Tomcat's session management can access it.
references:
- https://lists.apache.org/thread/j5fkjv2k477os90nczf2v9l61fb0kkgq
- https://nvd.nist.gov/vuln/detail/CVE-2025-24813
- https://github.com/vulhub/vulhub/tree/master/tomcat/CVE-2025-24813
- https://www.rapid7.com/db/vulnerabilities/apache-tomcat-cve-2025-24813/
- https://gist.github.com/MHaggis/e106367f6649fbb09ab27e7b4a01cf73
tags:
- attack.t1190
- attack.t1505.003
date: '2025-03-25'
original_spl: |-
  | tstats count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Web
    WHERE Web.http_method=PUT
      AND
      Web.uri_path="*.session"
      AND
      (Web.status=201
      OR
      Web.status=409)
    BY Web.src, Web.dest, Web.http_user_agent,
       Web.uri_path, Web.status
  | `drop_dm_object_name("Web")`
  | rex field=uri_path "/(?<filename>[^/]+)\.session$"
  | eval severity="High"
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `tomcat_session_file_upload_attempt_filter`
splunk_rule_id: a1d8f5c3-9b7e-4f2d-8c51-3bca5e672410
splunk_rule_type: Anomaly
logsource:
  category: webserver
  product: windows
detection:
  selection_0:
    cs-method: PUT
  selection_1:
    Web.uri_path|endswith: .session
  condition: selection_0 and selection_1
