title: VMware Server Side Template Injection Hunt
id: 5796b570-ad12-44df-b1b5-b7e6ae3aabb0
status: stable
level: medium
author: Michael Haag, Splunk
description: |
  The following analytic identifies potential server-side template injection attempts related to CVE-2022-22954.
  It detects suspicious URL patterns containing "deviceudid" and keywords like "java.lang.ProcessBuilder" or "freemarker.template.utility.ObjectConstructor" using web or proxy logs within the Web Datamodel.
  This activity is significant as it may indicate an attempt to exploit a known vulnerability in VMware, potentially leading to remote code execution.
  If confirmed malicious, attackers could gain unauthorized access, execute arbitrary code, and compromise the affected system, posing a severe security risk.
references:
- https://www.cisa.gov/uscert/ncas/alerts/aa22-138b
- https://github.com/wvu/metasploit-framework/blob/master/modules/exploits/linux/http/vmware_workspace_one_access_cve_2022_22954.rb
- https://github.com/sherlocksecurity/VMware-CVE-2022-22954
- https://www.vmware.com/security/advisories/VMSA-2022-0011.html
- https://attackerkb.com/topics/BDXyTqY1ld/cve-2022-22954/rapid7-analysis
- https://twitter.com/wvuuuuuuuuuuuuu/status/1519476924757778433
tags:
- attack.t1190
- attack.t1133
date: '2022-05-19'
original_spl: |-
  | tstats `security_content_summariesonly`
           count min(_time) as firstTime
                 max(_time) as lastTime

  FROM datamodel=Web WHERE

  Web.http_method="GET"
  Web.url="*deviceudid=*"
  Web.url IN (
      "*freemarker.template.utility.ObjectConstructor*",
      "*java.lang.ProcessBuilder*"
  )
  BY Web.http_user_agent Web.status
     Web.http_method Web.url Web.url_length
     Web.src Web.dest
  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `vmware_server_side_template_injection_hunt_filter`
splunk_rule_id: 5796b570-ad12-44df-b1b5-b7e6ae3aabb0
splunk_rule_type: Hunting
logsource:
  category: webserver
detection:
  selection_0:
    cs-method: GET
  selection_1:
    cs-uri|contains: deviceudid=
  selection_2:
    cs-uri|contains:
    - freemarker.template.utility.ObjectConstructor
    - java.lang.ProcessBuilder
  condition: selection_0 and selection_1 and selection_2
