title: Web Spring Cloud Function FunctionRouter
id: 89dddbad-369a-4f8a-ace2-2439218735bc
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies HTTP POST requests to the Spring Cloud Function endpoint containing "functionRouter" in the URL. It leverages the Web data model to detect these requests based
  on specific fields such as http_method, url, and http_user_agent. This activity is significant because it targets CVE-2022-22963, a known vulnerability in Spring Cloud Function, which has multiple proof-of-concept
  exploits available. If confirmed malicious, this activity could allow attackers to execute arbitrary code, potentially leading to unauthorized access, data exfiltration, or further compromise of the affected
  system.
references:
- https://github.com/rapid7/metasploit-framework/pull/16395
- https://github.com/hktalent/spring-spel-0day-poc
tags:
- attack.t1190
- attack.t1133
date: '2022-04-05'
original_spl: |-
  | tstats count FROM datamodel=Web
    WHERE Web.http_method IN ("POST") Web.url="*/functionRouter*"
    BY Web.http_user_agent Web.http_method, Web.url,Web.url_length
       Web.src, Web.dest Web.status
       sourcetype
  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `web_spring_cloud_function_functionrouter_filter`
splunk_rule_id: 89dddbad-369a-4f8a-ace2-2439218735bc
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-method: POST
  selection_1:
    cs-uri|contains: /functionRouter
  condition: selection_0 and selection_1
