title: Web Remote ShellServlet Access
id: c2a332c3-24a2-4e24-9455-0e80332e6746
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies attempts to access the Remote ShellServlet on a web server, specifically targeting Confluence servers vulnerable to CVE-2023-22518 and CVE-2023-22515. It leverages
  web data to detect URLs containing "*plugins/servlet/com.jsos.shell/*" with a status code of 200. This activity is significant as it is commonly associated with web shells and other malicious behaviors,
  potentially leading to unauthorized command execution. If confirmed malicious, attackers could gain remote code execution capabilities, compromising the server and potentially the entire network.
references:
- http://www.servletsuite.com/servlets/shell.htm
tags:
- attack.t1190
date: '2023-12-06'
original_spl: |-
  | tstats count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Web
    WHERE Web.url IN ("*plugins/servlet/com.jsos.shell/*") Web.status=200
    BY Web.http_user_agent, Web.status Web.http_method,
       Web.url, Web.url_length, Web.src,
       Web.dest, sourcetype
  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `web_remote_shellservlet_access_filter`
splunk_rule_id: c2a332c3-24a2-4e24-9455-0e80332e6746
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|contains: plugins/servlet/com.jsos.shell/
  selection_1:
    sc-status: 200
  condition: selection_0 and selection_1
