title: WS FTP Remote Code Execution
id: b84e8f39-4e7b-4d4f-9e7c-fcd29a227845
status: stable
level: medium
author: Michael Haag, Splunk
description: |-
  The following analytic detects potential Remote Code Execution (RCE) attempts exploiting CVE-2023-40044 in WS_FTP software.
  It identifies HTTP POST requests to the "/AHT/AhtApiService.asmx/AuthUser" URL with a status code of 200.
  This detection leverages the Web datamodel to monitor specific URL patterns and HTTP status codes. This activity is significant as it may indicate an exploitation attempt, potentially allowing an attacker to execute arbitrary code on the server.
  If confirmed malicious, this could lead to unauthorized access, data exfiltration, or further compromise of the affected system.
references:
- https://github.com/projectdiscovery/nuclei-templates/pull/8296/files
- https://www.assetnote.io/resources/research/rce-in-progress-ws-ftp-ad-hoc-via-iis-http-modules-cve-2023-40044
- https://github.com/rapid7/metasploit-framework/pull/18414
tags:
- attack.t1190
date: '2023-10-01'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  FROM datamodel=Web WHERE

  Web.url="*/AHT/AhtApiService.asmx/AuthUser"
  Web.status=200
  Web.http_method="POST"

  BY Web.http_user_agent Web.status Web.http_method
     Web.url Web.url_length Web.src Web.dest

  | `drop_dm_object_name("Web")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `ws_ftp_remote_code_execution_filter`
splunk_rule_id: b84e8f39-4e7b-4d4f-9e7c-fcd29a227845
splunk_rule_type: TTP
logsource:
  category: webserver
detection:
  selection_0:
    cs-uri|endswith: /AHT/AhtApiService.asmx/AuthUser
  selection_1:
    sc-status: 200
  selection_2:
    cs-method: POST
  condition: selection_0 and selection_1 and selection_2
