title: Email Attachments With Lots Of Spaces
id: 56e877a6-1455-4479-ada6-0550dc1e22f8
status: experimental
level: medium
author: David Dorsey, Splunk
description: The following analytic detects email attachments with an unusually high number of spaces in their file names, which is a common tactic used by attackers to obfuscate file extensions. It leverages
  the Email data model to identify attachments where the ratio of spaces to the total file name length exceeds 10%. This behavior is significant as it may indicate an attempt to bypass security filters
  and deliver malicious payloads. If confirmed malicious, this activity could lead to the execution of harmful code or unauthorized access to sensitive information within the recipient's environment.
tags:
- attack.t1566.001
- attack.t1036.008
date: '2020-04-29'
original_spl: |-
  | tstats `security_content_summariesonly` count values(All_Email.recipient) as recipient_address min(_time) as firstTime max(_time) as lastTime FROM datamodel=Email
    WHERE All_Email.file_name="*"
    BY All_Email.src_user, All_Email.file_name All_Email.message_id
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `drop_dm_object_name("All_Email")`
  | eval space_ratio = (mvcount(split(file_name," "))-1)/len(file_name)
  | search space_ratio >= 0.1
  | rex field=recipient_address "(?<recipient_user>.*)@"
  | `email_attachments_with_lots_of_spaces_filter`
splunk_rule_id: 56e877a6-1455-4479-ada6-0550dc1e22f8
splunk_rule_type: Anomaly
logsource:
  category: email
detection:
  selection_0:
    All_Email.file_name|contains: ''
  condition: selection_0
