title: High Number of Login Failures from a single source
id: 7f398cfb-918d-41f4-8db8-2e2474e02222
status: stable
level: medium
author: Bhavin Patel, Mauricio Velazco, Splunk
description: The following analytic detects multiple failed login attempts in Office365 Azure Active Directory from a single source IP address. It leverages Office365 management activity logs, specifically
  AzureActiveDirectoryStsLogon records, aggregating these logs in 5-minute intervals to count failed login attempts. This activity is significant as it may indicate brute-force attacks or password spraying,
  which are critical to monitor. If confirmed malicious, an attacker could gain unauthorized access to Office365 accounts, leading to potential data breaches, lateral movement within the organization, or
  further malicious activities using the compromised account.
references:
- https://attack.mitre.org/techniques/T1110/001/
- https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray
- https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
- https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes
tags:
- attack.T1110_001
date: '2020-12-16'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: AzureActiveDirectory
  selection_1:
    Operation: UserLoginFailed
  selection_2:
    record_type: AzureActiveDirectoryStsLogon
  condition: selection_0 and selection_1 and selection_2
