title: Microsoft Defender ATP Alerts
id: 38f034ed-1598-46c8-95e8-14edf05fdf5d
status: stable
level: medium
author: Bryan Pluta, Bhavin Patel, Splunk
description: The following analytic is to leverage alerts from Microsoft Defender ATP Alerts. This query aggregates and summarizes all alerts from Microsoft Defender ATP Alerts, providing details such as
  the source, file name, severity, process command line, ip address, registry key, signature, description, unique id, and timestamps. This detection is not intended to detect new activity from raw data,
  but leverages Microsoft provided alerts to be correlated with other data as part of risk based alerting. The data contained in the alert is mapped not only to the risk object, but also the threat object.
  This detection filters out evidence that has a verdict of clean from Microsoft. It dynamically maps the MITRE technique at search time to auto populate the annotation field with the value provided in
  the alert. It also uses a dynamic mapping to set the risk score in Enterprise Security based on the severity of the alert.
references:
- https://learn.microsoft.com/en-us/defender-xdr/api-list-incidents?view=o365-worldwide
- https://learn.microsoft.com/en-us/graph/api/resources/security-alert?view=graph-rest-1.0
- https://splunkbase.splunk.com/app/6207
- https://jasonconger.com/splunk-azure-gdi/
date: '2024-10-30'
logsource:
  product: m365
  service: defender
detection:
  selection_0:
    dest|contains: '*'
  selection_1:
    User|contains: '*'
  condition: selection_0 and selection_1
