title: O365 New Email Forwarding Rule Created
id: 68469fd0-1315-44ba-b7e4-e92847bb76d6
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies the creation of new email forwarding rules in an Office 365 environment. It detects events logged under New-InboxRule and Set-InboxRule operations within the
  o365_management_activity data source, focusing on parameters like ForwardTo, ForwardAsAttachmentTo, and RedirectTo. This activity is significant as unauthorized email forwarding can lead to data exfiltration
  and unauthorized access to sensitive information. If confirmed malicious, attackers could intercept and redirect emails, potentially compromising confidential communications and leading to data breaches.
references:
- https://attack.mitre.org/techniques/T1114/003/
tags:
- attack.T1114_003
date: '2024-04-17'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation: New-InboxRule
  selection_1:
    Operation: set-InboxRule
  condition: selection_0 and selection_1
