title: O365 Privileged Role Assigned
id: db435700-4ddc-4c23-892e-49e7525d7d39
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies the assignment of sensitive and privileged Azure Active Directory roles to an Azure AD user. Adversaries and red teams alike may assign these roles to a compromised
  account to establish Persistence in an Azure AD environment. This detection leverages the O365 Universal Audit Log data source.
references:
- https://attack.mitre.org/techniques/T1098/003/
- https://learn.microsoft.com/en-us/azure/active-directory/roles/permissions-reference
- https://learn.microsoft.com/en-us/microsoft-365/admin/add-users/about-exchange-online-admin-role?view=o365-worldwide
tags:
- attack.T1098_003
date: '2024-04-13'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: AzureActiveDirectory
  selection_1:
    Operation|contains:
    - Add member to role.
    - Add eligible member to role.
  condition: selection_0 and selection_1
