title: O365 Safe Links Detection
id: 711d9e8c-2cb0-45cf-8813-5f191ecb9b26
status: stable
level: medium
author: Steven Dick
description: The following analytic detects when any Microsoft Safe Links alerting is triggered. This behavior may indicate when user has interacted with a phishing or otherwise malicious link within the
  Microsoft Office ecosystem.
references:
- https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/safe-links-about?view=o365-worldwide
- https://attack.mitre.org/techniques/T1566/
tags:
- attack.T1566_001
date: '2024-04-07'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Name|contains: '*a potentially malicious URL*'
  selection_1:
    Operation: AlertEntityGenerated
  condition: selection_0 and selection_1
