title: O365 Email Access By Security Administrator
id: c6998a30-fef4-4e89-97ac-3bb0123719b4
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when a user with sufficient access to O365 Security & Compliance portal uses premium investigation features (Threat Explorer) to directly view email. Adversaries
  may exploit privileged access with this premium feature to enumerate or exfiltrate sensitive data.
references:
- https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/threat-explorer-investigate-delivered-malicious-email?view=o365-worldwide
tags:
- attack.T1114_002
- attack.T1567
date: '2024-04-07'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SecurityComplianceCenter
  selection_1:
    Operation: AdminMailAccess
  condition: selection_0 and selection_1
