title: O365 Email Security Feature Changed
id: 4d28013d-3a0f-4d65-a33f-4e8009fee0ae
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when specific O365 advanced security settings are altered within the Office 365 tenant. If an attacker successfully disables O365 security settings, they can
  operate within the tenant with reduced risk of detection. This can lead to unauthorized data access, data exfiltration, account compromise, or other malicious activities without leaving a detailed audit
  trail.
references:
- https://learn.microsoft.com/en-us/entra/fundamentals/security-defaults
- https://attack.mitre.org/techniques/T1562/008/
tags:
- attack.T1685_002
date: '2024-04-07'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: Exchange
  selection_1:
    Operation|contains:
    - Set-*
    - Disable-*
    - New-*
    - Remove-*
  selection_2:
    Operation|contains:
    - '*AntiPhish*'
    - '*SafeLink*'
    - '*SafeAttachment*'
    - '*Malware*'
  condition: selection_0 and selection_1 and selection_2
