title: O365 Threat Intelligence Suspicious Email Delivered
id: 605cc93a-70e4-4ee3-9a3d-1a62e8c9b6c2
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when a suspicious email is detected within the Microsoft Office 365 ecosystem through the Advanced Threat Protection engine and delivered to an end user. Attackers
  may execute several attacks through email, any detections from built-in Office 365 capabilities should be monitored and responded to appropriately. Certain premium Office 365 capabilities such as Safe
  Attachment and Safe Links further enhance these detection and response functions.
references:
- https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/anti-malware-protection-for-spo-odfb-teams-about?view=o365-worldwide
- https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/office-365-ti?view=o365-worldwide
tags:
- attack.T1566_001
- attack.T1566_002
date: '2024-04-07'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: ThreatIntelligence
  selection_1:
    Operation: TIMailData
  selection_2:
    DeliveryAction!: Blocked
  selection_3:
    Directionality: InBound
  condition: selection_0 and selection_1 and selection_2 and selection_3
