title: O365 Bypass MFA via Trusted IP
id: c783dd98-c703-4252-9e8a-f19d9f66949e
status: stable
level: medium
author: Bhavin Patel, Mauricio Velazco, Splunk
description: The following analytic identifies instances where new IP addresses are added to the trusted IPs list in Office 365, potentially allowing users from these IPs to bypass Multi-Factor Authentication
  (MFA) during login. It leverages O365 audit logs, specifically focusing on events related to the modification of trusted IP settings. This activity is significant because adding trusted IPs can weaken
  the security posture by bypassing MFA, which is a critical security control. If confirmed malicious, this could lead to unauthorized access, compromising sensitive information and systems. Immediate investigation
  is required to validate the legitimacy of the IP addition.
references:
- https://i.blackhat.com/USA-20/Thursday/us-20-Bienstock-My-Cloud-Is-APTs-Cloud-Investigating-And-Defending-Office-365.pdf
- https://attack.mitre.org/techniques/T1562/007/
- https://learn.microsoft.com/en-us/azure/active-directory/authentication/howto-mfa-mfasettings
tags:
- attack.T1686_001
date: '2021-01-13'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation: Set Company Information.
  selection_1:
    Name: StrongAuthenticationPolicy
  condition: selection_0 and selection_1
