title: O365 ApplicationImpersonation Role Assigned
id: 49cdce75-f814-4d56-a7a4-c64ec3a481f2
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the assignment of the ApplicationImpersonation role in Office 365 to a user or application. It uses the Office 365 Management Activity API to monitor Azure Active
  Directory audit logs for role assignment events. This activity is significant because the ApplicationImpersonation role allows impersonation of any user, enabling access to and modification of their mailbox.
  If confirmed malicious, an attacker could gain unauthorized access to sensitive information, manipulate mailbox data, and perform actions as a legitimate user, posing a severe security risk to the organization.
references:
- https://attack.mitre.org/techniques/T1098/002/
- https://www.mandiant.com/resources/blog/remediation-and-hardening-strategies-for-microsoft-365-to-defend-against-unc2452
- https://www.mandiant.com/media/17656
tags:
- attack.T1098_002
date: '2023-12-06'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: Exchange
  selection_1:
    Operation: New-ManagementRoleAssignment
  selection_2:
    Role: ApplicationImpersonation
  condition: selection_0 and selection_1 and selection_2
