title: O365 Email Suspicious Behavior Alert
id: 85c7555a-05af-4322-81aa-76b4ddf52baa
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when one of O365 the built-in security detections for suspicious email behaviors are triggered.  These alerts often indicate that an attacker may have compromised
  a mailbox within the environment. Any detections from built-in Office 365 capabilities should be monitored and responded to appropriately. Certain premium Office 365 capabilities further enhance these
  detection and response functions.
references:
- https://learn.microsoft.com/en-us/purview/alert-policies
tags:
- attack.t1114.003
date: '2024-04-07'
original_spl: |-
  `o365_management_activity` Workload=SecurityComplianceCenter Operation=AlertEntityGenerated Name IN ("Suspicious email sending patterns detected","User restricted from sending email","Suspicious Email Forwarding Activity","Email sending limit exceeded")
    | fromjson Data
    | rename Name as signature, AlertId as signature_id, ObjectId as user
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest user src
         vendor_account vendor_product signature
         signature_id
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `o365_email_suspicious_behavior_alert_filter`
splunk_rule_id: 85c7555a-05af-4322-81aa-76b4ddf52baa
splunk_rule_type: TTP
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SecurityComplianceCenter
  selection_1:
    Operation: AlertEntityGenerated
  selection_2:
    Name:
    - Suspicious email sending patterns detected
    - User restricted from sending email
    - Suspicious Email Forwarding Activity
    - Email sending limit exceeded
  condition: selection_0 and selection_1 and selection_2
