title: O365 Email Reported By Admin Found Malicious
id: 94396c3e-7728-422a-9956-e4b77b53dbdf
status: stable
level: medium
author: Steven Dick
description: The following analytic detects when an email manually submitted to Microsoft through the Security & Compliance portal is found to be malicious. This capability is an enhanced protection feature
  that can be used within o365 tenants by administrative users to report potentially malicious emails. This correlation looks for any submission that returns a Phish or Malware verdict upon submission.
references:
- https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/submissions-outlook-report-messages?view=o365-worldwide
tags:
- attack.t1566.001
- attack.t1566.002
date: '2024-04-07'
original_spl: |-
  `o365_management_activity` Workload=SecurityComplianceCenter Operation=AdminSubmission
    | search RescanVerdict IN (Phish,Malware)
    | rename Id as signature_id, SenderIP as src, Recipients{} as dest_user, P1Sender as src_user
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest user src
         vendor_account vendor_product signature
         signature_id dest_user src_user
         Subject SubmissionContent
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `o365_email_reported_by_admin_found_malicious_filter`
splunk_rule_id: 94396c3e-7728-422a-9956-e4b77b53dbdf
splunk_rule_type: TTP
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SecurityComplianceCenter
  selection_1:
    Operation: AdminSubmission
  condition: selection_0 and selection_1
