title: O365 ZAP Activity Detection
id: 4df275fd-a0e5-4246-8b92-d3201edaef7a
status: stable
level: medium
author: Steven Dick
description: The following analytic detects when the Microsoft Zero-hour Automatic Purge (ZAP) capability takes action against a user's mailbox. This capability is an enhanced protection feature that retro-actively
  removes email with known malicious content for user inboxes. Since this is a retroactive capability, there is still a window in which the user may fall victim to the malicious content.
references:
- https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/zero-hour-auto-purge?view=o365-worldwide
tags:
- attack.T1566_001
- attack.T1566_002
date: '2024-04-07'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SecurityComplianceCenter
  selection_1:
    Operation: AlertEntityGenerated
  selection_2:
    Name|contains: '*messages containing malicious*'
  condition: selection_0 and selection_1 and selection_2
