title: O365 SharePoint Allowed Domains Policy Changed
id: b0cc6fa8-39b1-49ac-a4fe-f2f2a668e06c
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when the allowed domain settings for O365 SharePoint have been changed. With Azure AD B2B collaboration, users and administrators can invite external users
  to collaborate with internal users. External guest account invitations may also need access to OneDrive/SharePoint resources. These changed should be monitored by security teams as they could potentially
  lead to unauthorized access.
references:
- https://learn.microsoft.com/en-us/sharepoint/external-sharing-overview
tags:
- attack.T1136_003
date: '2024-04-07'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SharePoint
  selection_1:
    Operation: SharingPolicyChanged
  selection_2:
    Name": AllowDomainList
  condition: selection_0 and selection_1 and selection_2
