title: O365 Disable MFA
id: c783dd98-c703-4252-9e8a-f19d9f5c949e
status: stable
level: medium
author: Rod Soto, Splunk
description: The following analytic identifies instances where Multi-Factor Authentication (MFA) is disabled for a user within the Office 365 environment. It leverages O365 audit logs, specifically focusing
  on events related to MFA settings. Disabling MFA removes a critical security layer, making accounts more vulnerable to unauthorized access. If confirmed malicious, this activity could indicate an attacker
  attempting to maintain persistence or an insider threat, significantly increasing the risk of unauthorized access. Immediate investigation is required to validate the reason for disabling MFA, potentially
  re-enable it, and assess any other suspicious activities related to the affected account.
references:
- https://attack.mitre.org/techniques/T1556/
tags:
- attack.t1556
date: '2020-12-16'
original_spl: |-
  `o365_management_activity` Operation="Disable Strong Authentication."
    | rename UserId as user object as src_user
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         src vendor_account vendor_product
         src_user
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `o365_disable_mfa_filter`
splunk_rule_id: c783dd98-c703-4252-9e8a-f19d9f5c949e
splunk_rule_type: TTP
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation: Disable Strong Authentication.
  condition: selection_0
