title: O365 Security And Compliance Alert Triggered
id: 5b367cdd-8dfc-49ac-a9b7-6406cf27f33e
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies alerts triggered by the Office 365 Security and Compliance Center, indicating potential threats or policy violations. It leverages data from the `o365_management_activity`
  dataset, focusing on events where the workload is SecurityComplianceCenter and the operation is AlertTriggered. This activity is significant as it highlights security and compliance issues within the
  O365 environment, which are crucial for maintaining organizational security. If confirmed malicious, these alerts could indicate attempts to breach security policies, leading to unauthorized access, data
  exfiltration, or other malicious activities.
references:
- https://attack.mitre.org/techniques/T1078/004/
- https://learn.microsoft.com/en-us/purview/alert-policies?view=o365-worldwide
- https://learn.microsoft.com/en-us/purview/alert-policies
tags:
- attack.T1078_004
date: '2024-04-17'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SecurityComplianceCenter
  selection_1:
    Category: ThreatManagement
  selection_2:
    Operation: AlertTriggered
  condition: selection_0 and selection_1 and selection_2
