title: O365 Email Suspicious Behavior Alert
id: 85c7555a-05af-4322-81aa-76b4ddf52baa
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when one of O365 the built-in security detections for suspicious email behaviors are triggered.  These alerts often indicate that an attacker may have compromised
  a mailbox within the environment. Any detections from built-in Office 365 capabilities should be monitored and responded to appropriately. Certain premium Office 365 capabilities further enhance these
  detection and response functions.
references:
- https://learn.microsoft.com/en-us/purview/alert-policies
tags:
- attack.T1114_003
date: '2024-04-07'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SecurityComplianceCenter
  selection_1:
    Operation: AlertEntityGenerated
  selection_2:
    Name|contains:
    - Suspicious email sending patterns detected
    - User restricted from sending email
    - Suspicious Email Forwarding Activity
    - Email sending limit exceeded
  condition: selection_0 and selection_1 and selection_2
