title: O365 Email Transport Rule Changed
id: 11ebb7c2-46bd-41c9-81e1-d0b4b34583a2
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when a user with sufficient access to Exchange Online alters the mail flow/transport rule configuration of the organization. Transport rules are a set of rules
  that can be used by attackers to modify or delete emails based on specific conditions, this activity could indicate an attacker hiding or exfiltrated data.
references:
- https://attack.mitre.org/techniques/T1114/003/
- https://cardinalops.com/blog/cardinalops-contributes-new-mitre-attck-techniques-related-to-abuse-of-mail-transport-rules/
- https://www.microsoft.com/en-us/security/blog/2022/09/22/malicious-OAuth-applications-used-to-compromise-email-servers-and-spread-spam/
tags:
- attack.T1114_003
- attack.T1564_008
date: '2025-01-15'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: Exchange
  selection_1:
    Operation|contains:
    - Set-*
    - Disable-*
    - New-*
    - Remove-*
  selection_2:
    Operation|contains: '*TransportRule'
  condition: selection_0 and selection_1 and selection_2
