title: O365 Exfiltration via File Sync Download
id: 350837b5-13d3-4c06-b688-db07afbe5050
status: stable
level: medium
author: Steven Dick
description: The following analytic detects when an excessive number of files are sync from o365 by the same user over a short period of time. A malicious actor abuse the user-agent string through GUI or
  API access to evade triggering the FileDownloaded event. This behavior may indicate an attacker staging data for exfiltration or an insider threat removing organizational data. Additional attention should
  be taken with any Azure Guest (#EXT#) accounts.
references:
- https://attack.mitre.org/techniques/T1567/exfil
- https://www.varonis.com/blog/sidestepping-detection-while-exfiltrating-sharepoint-data
- https://thedfirjournal.com/posts/m365-data-exfiltration-rclone/
tags:
- attack.T1567
- attack.T1530
date: '2025-01-28'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation|contains: filesyncdownload*
  selection_1:
    UserAgent|contains: '*SkyDriveSync*'
  condition: selection_0 and selection_1
