title: O365 OAuth App Mailbox Access via Graph API
id: 9db0d5b0-4058-4cb7-baaf-77d8143539a2
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects when emails are accessed in Office 365 Exchange via the Microsoft Graph API using the client ID '00000003-0000-0000-c000-000000000000'. It leverages the 'MailItemsAccessed'
  operation within the Exchange workload, focusing on OAuth-authenticated applications. This activity is significant as unauthorized access to emails can lead to data breaches and information theft. If
  confirmed malicious, attackers could exfiltrate sensitive information, compromise user accounts, and further infiltrate the organization's network.
references:
- https://attack.mitre.org/techniques/T1114/002/
- https://learn.microsoft.com/en-us/troubleshoot/azure/active-directory/verify-first-party-apps-sign-in
- https://learn.microsoft.com/en-us/graph/permissions-reference
tags:
- attack.t1114.002
date: '2024-02-14'
original_spl: |-
  `o365_management_activity` Workload=Exchange Operation=MailItemsAccessed AppId=* AppId=00000003-0000-0000-c000-000000000000
    | fillnull
    | stats count earliest(_time) as firstTime latest(_time) as lastTime values(ClientIPAddress) as src
      BY user ClientAppId OperationCount
         AppId vendor_account vendor_product
         dest signature
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `o365_oauth_app_mailbox_access_via_graph_api_filter`
splunk_rule_id: 9db0d5b0-4058-4cb7-baaf-77d8143539a2
splunk_rule_type: TTP
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: Exchange
  selection_1:
    Operation: MailItemsAccessed
  selection_2:
    AppId|contains: ''
  selection_3:
    AppId: 3
  condition: selection_0 and selection_1 and selection_2 and selection_3
