title: O365 High Privilege Role Granted
id: e78a1037-4548-4072-bb1b-ad99ae416426
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects when high-privilege roles such as "Exchange Administrator," "SharePoint Administrator," or "Global Administrator" are granted within Office 365. It leverages
  O365 audit logs to identify events where these roles are assigned to any user or service account. This activity is significant for SOCs as these roles provide extensive permissions, allowing broad access
  and control over critical resources and data. If confirmed malicious, this could enable attackers to gain significant control over O365 resources, access, modify, or delete critical data, and compromise
  the overall security and functionality of the O365 environment.
references:
- https://attack.mitre.org/techniques/T1098/003/
- https://learn.microsoft.com/en-us/azure/active-directory/roles/permissions-reference
- https://learn.microsoft.com/en-us/microsoft-365/admin/add-users/about-exchange-online-admin-role?view=o365-worldwide
- https://learn.microsoft.com/en-us/sharepoint/sharepoint-admin-role
tags:
- attack.t1098.003
date: '2023-12-06'
original_spl: '`o365_management_activity` Operation="Add member to role." Workload=AzureActiveDirectory | eval role_id = mvindex(''ModifiedProperties{}.NewValue'',2) | eval role_name = mvindex(''ModifiedProperties{}.NewValue'',1)
  | where role_id IN ("29232cdf-9323-42fd-ade2-1d097af3e4de", "f28a1f50-f6e7-4571-818b-6a12f2af6b6c", "62e90394-69f5-4237-9190-012177145e10") | fillnull | stats count min(_time) as firstTime max(_time)
  as lastTime by signature dest user src vendor_account vendor_product ObjectId role_name role_id | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `o365_high_privilege_role_granted_filter`'
splunk_rule_id: e78a1037-4548-4072-bb1b-ad99ae416426
splunk_rule_type: TTP
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation: Add member to role.
  selection_1:
    Workload: AzureActiveDirectory
  condition: selection_0 and selection_1
