title: O365 User Consent Denied for OAuth Application
id: 2d8679ef-b075-46be-8059-c25116cb1072
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies instances where a user has denied consent to an OAuth application seeking permissions within the Office 365 environment. This detection leverages O365 audit
  logs, focusing on events related to user consent actions. By filtering for denied consent actions associated with OAuth applications, it captures instances where users have actively rejected permission
  requests. This activity is significant as it may indicate users spotting potentially suspicious or unfamiliar applications. If confirmed malicious, it suggests an attempt by a potentially harmful application
  to gain unauthorized access, which was proactively blocked by the user.
references:
- https://attack.mitre.org/techniques/T1528/
- https://www.microsoft.com/en-us/security/blog/2022/09/22/malicious-oauth-applications-used-to-compromise-email-servers-and-spread-spam/
- https://learn.microsoft.com/en-us/azure/active-directory/manage-apps/protect-against-consent-phishing
- https://learn.microsoft.com/en-us/defender-cloud-apps/investigate-risky-oauth
- https://www.alteredsecurity.com/post/introduction-to-365-stealer
- https://github.com/AlteredSecurity/365-Stealer
tags:
- attack.t1528
date: '2023-12-06'
original_spl: |-
  `o365_graph` status.errorCode=65004
    | rename userPrincipalName as user
    | rename ipAddress as src_ip
    | stats min(_time) as firstTime max(_time) as lastTime
      BY user src_ip appDisplayName
         status.failureReason
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `o365_user_consent_denied_for_oauth_application_filter`
splunk_rule_id: 2d8679ef-b075-46be-8059-c25116cb1072
splunk_rule_type: TTP
logsource:
  product: m365
  service: graph_api
detection:
  selection_0:
    status.errorCode: 65004
  condition: selection_0
