title: O365 Multiple Failed MFA Requests For User
id: fd22124e-dbac-4744-a8ce-be10d8ec3e26
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies potential "MFA fatigue" attacks targeting Office 365 users by detecting more than nine Multi-Factor Authentication (MFA) prompts within a 10-minute timeframe.
  It leverages O365 management activity logs, focusing on Azure Active Directory events with the UserLoginFailed operation, a Success ResultStatus, and an ErrorNumber of 500121. This activity is significant
  as attackers may exploit MFA fatigue to gain unauthorized access by overwhelming users with repeated MFA requests. If confirmed malicious, this could lead to data breaches, unauthorized data access, or
  further compromise within the O365 environment. Immediate investigation is crucial.
references:
- https://attack.mitre.org/techniques/T1621/
tags:
- attack.T1621
date: '2023-12-06'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: AzureActiveDirectory
  selection_1:
    Operation: UserLoginFailed
  selection_2:
    ResultStatus: Success
  selection_3:
    ErrorNumber: 500121
  condition: selection_0 and selection_1 and selection_2 and selection_3
