title: O365 New Federated Domain Added
id: e155876a-6048-11eb-ae93-0242ac130002
status: stable
level: medium
author: Rod Soto, Mauricio Velazco Splunk
description: The following analytic identifies the addition of a new federated domain in an Office 365 environment. This behavior is detected by analyzing Office 365 management activity logs, specifically
  filtering for Workload=Exchange and Operation="Add-FederatedDomain". The addition of a new federated domain is significant as it may indicate unauthorized changes or potential compromises. If confirmed
  malicious, attackers could establish a backdoor, bypass security measures, or exfiltrate data, leading to data breaches and unauthorized access to sensitive information. Immediate investigation is required
  to review the details of the added domain and any concurrent suspicious activities.
references:
- https://www.fireeye.com/content/dam/fireeye-www/blog/pdfs/wp-m-unc2452-2021-000343-01.pdf
- https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
- https://www.splunk.com/en_us/blog/security/a-golden-saml-journey-solarwinds-continued.html
- https://blog.sygnia.co/detection-and-hunting-of-golden-saml-attack?hsLang=en
- https://o365blog.com/post/aadbackdoor/
tags:
- attack.t1136.003
date: '2021-01-26'
original_spl: |-
  `o365_management_activity` Operation IN ("*add*", "*new*") AND Operation="*domain*"
    | eval src="NA"
    | fillnull
    | stats count values(ModifiedProperties{}.NewValue) as new_value
      BY user user_agent authentication_service
         signature Workload src
         vendor_account vendor_product dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `o365_new_federated_domain_added_filter`
splunk_rule_id: e155876a-6048-11eb-ae93-0242ac130002
splunk_rule_type: TTP
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation|contains:
    - add
    - new
  selection_1:
    Operation|contains: domain
  condition: selection_0 and selection_1
