title: O365 Compliance Content Search Started
id: f4cabbc7-c19a-4e41-8be5-98daeaccbb50
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects when a content search is initiated within the Office 365 Security and Compliance Center. It leverages the SearchCreated operation from the o365_management_activity
  logs under the SecurityComplianceCenter workload. This activity is significant as it may indicate an attempt to access sensitive organizational data, including emails and documents. If confirmed malicious,
  this could lead to unauthorized data access, potential data exfiltration, and compliance violations. Monitoring this behavior helps ensure the integrity and security of organizational data.
references:
- https://attack.mitre.org/techniques/T1114/002/
- https://learn.microsoft.com/en-us/purview/ediscovery-content-search-overview
- https://learn.microsoft.com/en-us/purview/ediscovery-keyword-queries-and-search-conditions
- https://learn.microsoft.com/en-us/purview/ediscovery-search-for-activities-in-the-audit-log
tags:
- attack.t1114.002
date: '2024-04-17'
original_spl: |-
  `o365_management_activity` Workload=SecurityComplianceCenter Operation=SearchCreated
    | rename user_id as user
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         src vendor_account vendor_product
         ExchangeLocations Query
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `o365_compliance_content_search_started_filter`
splunk_rule_id: f4cabbc7-c19a-4e41-8be5-98daeaccbb50
splunk_rule_type: TTP
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SecurityComplianceCenter
  selection_1:
    Operation: SearchCreated
  condition: selection_0 and selection_1
