title: O365 Mailbox Folder Read Permission Assigned
id: 1435475e-2128-4417-a34f-59770733b0d5
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies instances where read permissions are assigned to mailbox folders within an Office 365 environment. It leverages the `o365_management_activity` data source,
  specifically monitoring the `ModifyFolderPermissions` and `AddFolderPermissions` operations, while excluding Calendar, Contacts, and PersonMetadata objects. This activity is significant as unauthorized
  read permissions can lead to data exposure and potential information leakage. If confirmed malicious, an attacker could gain unauthorized access to sensitive emails, leading to data breaches and compromising
  the confidentiality of organizational communications.
references:
- https://attack.mitre.org/techniques/T1098/002/
- https://learn.microsoft.com/en-us/openspecs/exchange_server_protocols/ms-oxodlgt/5610c6e6-3268-44e3-adff-8804f5315946
- https://learn.microsoft.com/en-us/purview/audit-mailboxes
tags:
- attack.T1098_002
date: '2024-04-17'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: Exchange
  selection_1:
    Operation: ModifyFolderPermissions
  selection_2:
    Operation: AddFolderPermissions
  selection_3:
    Workload: Exchange
  selection_4:
    object!: Calendar
  selection_5:
    object!: Contacts
  selection_6:
    object!: PersonMetadata
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6
