title: O365 Advanced Audit Disabled
id: 49862dd4-9cb2-4c48-a542-8c8a588d9361
status: stable
level: medium
author: Mauricio Velazco, Michael Haag, Splunk
description: The following analytic detects instances where the O365 advanced audit is disabled for a specific user within the Office 365 tenant. It uses O365 audit logs, focusing on events related to audit
  license changes in AzureActiveDirectory workloads. This activity is significant because the O365 advanced audit provides critical logging and insights into user and administrator activities. Disabling
  it can blind security teams to potential malicious actions. If confirmed malicious, attackers could operate within the user's mailbox or account with reduced risk of detection, leading to unauthorized
  data access, data exfiltration, or account compromise.
references:
- https://attack.mitre.org/techniques/T1562/008/
- https://www.mandiant.com/sites/default/files/2022-08/remediation-hardening-strategies-for-m365-defend-against-apt29-white-paper.pdf
- https://www.csoonline.com/article/570381/microsoft-365-advanced-audit-what-you-need-to-know.html
tags:
- attack.T1685_002
date: '2023-12-06'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation: Change user license.
  condition: selection_0
