title: O365 BEC Email Hiding Rule Created
id: 603ebac2-f157-4df7-a6ac-34e8d0350f86
status: stable
level: medium
author: 0xC0FFEEEE, Github Community
description: This analytic detects mailbox rule creation, a common technique used in Business Email Compromise. It uses a scoring mechanism to identify a combination of attributes often featured in mailbox
  rules created by attackers. This may indicate that an attacker has gained access to the account.
references:
- https://attack.mitre.org/techniques/T1564/008/
tags:
- attack.T1564_008
date: '2025-02-14'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: Exchange
  selection_1:
    Operation|contains:
    - New-InboxRule
    - Set-InboxRule
  condition: selection_0 and selection_1
