title: O365 ZAP Activity Detection
id: 4df275fd-a0e5-4246-8b92-d3201edaef7a
status: stable
level: medium
author: Steven Dick
description: The following analytic detects when the Microsoft Zero-hour Automatic Purge (ZAP) capability takes action against a user's mailbox. This capability is an enhanced protection feature that retro-actively
  removes email with known malicious content for user inboxes. Since this is a retroactive capability, there is still a window in which the user may fall victim to the malicious content.
references:
- https://learn.microsoft.com/en-us/microsoft-365/security/office-365-security/zero-hour-auto-purge?view=o365-worldwide
tags:
- attack.t1566.001
- attack.t1566.002
date: '2024-04-07'
original_spl: |-
  `o365_management_activity` Workload=SecurityComplianceCenter Operation=AlertEntityGenerated Name="*messages containing malicious*"
    | fromjson Data
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime values(zu) as url values(zfn) as file_name values(ms) as subject values(ttr) as result values(tsd) as src_user
      BY AlertId,trc,signature,Name,dest,src,vendor_account,vendor_product
    | rename Name as signature, AlertId as signature_id, trc as user
    | eval action = CASE(match(result,"Success"), "blocked", true(),"allowed"), url = split(url,";")
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `o365_zap_activity_detection_filter`
splunk_rule_id: 4df275fd-a0e5-4246-8b92-d3201edaef7a
splunk_rule_type: Anomaly
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Workload: SecurityComplianceCenter
  selection_1:
    Operation: AlertEntityGenerated
  selection_2:
    Name|contains: messages containing malicious
  condition: selection_0 and selection_1 and selection_2
