title: O365 Mailbox Read Access Granted to Application
id: 27ab61c5-f08a-438a-b4d3-325e666490b3
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies instances where the Mail.Read Graph API permissions are granted to an application registration within an Office 365 tenant. It leverages O365 audit logs, specifically
  events related to changes in application permissions within the AzureActiveDirectory workload. This activity is significant because the Mail.Read permission allows applications to access and read all
  emails within a user's mailbox, which often contain sensitive or confidential information. If confirmed malicious, this could lead to data exfiltration, spear-phishing attacks, or further compromise based
  on the information gathered from the emails.
references:
- https://attack.mitre.org/techniques/T1098/003/
- https://attack.mitre.org/techniques/T1114/002/
- https://www.mandiant.com/sites/default/files/2022-08/remediation-hardening-strategies-for-m365-defend-against-apt29-white-paper.pdf
- https://www.cisa.gov/sites/default/files/publications/Supply_Chain_Compromise_Detecting_APT_Activity_from_known_TTPs.pdf
- https://learn.microsoft.com/en-us/graph/permissions-reference
- https://graphpermissions.merill.net/permission/Mail.Read
tags:
- attack.T1098_003
- attack.T1114_002
date: '2023-12-06'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation: Update application.
  condition: selection_0
