title: O365 Service Principal Privilege Escalation
id: b686d0bd-cca7-44ca-ae07-87f6465131d9
status: stable
level: medium
author: Dean Luxton
description: This detection identifies when an Azure Service Principal elevates privileges by adding themself to a new app role assignment.
references:
- https://splunkbase.splunk.com/app/4055
- https://github.com/mvelazc0/BadZure
- https://www.splunk.com/en_us/blog/security/hunting-m365-invaders-navigating-the-shadows-of-midnight-blizzard.html
- https://posts.specterops.io/microsoft-breach-what-happened-what-should-azure-admins-do-da2b7e674ebc
tags:
- attack.T1098_003
date: '2025-01-05'
logsource:
  product: m365
  service: management
detection:
  selection_0:
    Operation: Add app role assignment to service principal.
  selection_1:
    ID": ServicePrincipal
  selection_2:
    ResultStatus: Success
  condition: selection_0 and selection_1 and selection_2
