title: Suspicious Email Attachment Extensions
id: 473bd65f-06ca-4dfe-a2b8-ba04ab4a0084
status: experimental
level: medium
author: David Dorsey, Splunk
description: The following analytic detects emails containing attachments with suspicious file extensions. It leverages the Email data model in Splunk, using the tstats command to identify emails where
  the attachment filename is not empty. This detection is significant for SOC analysts as it highlights potential phishing or malware delivery attempts, which are common vectors for data breaches and malware
  infections. If confirmed malicious, this activity could lead to unauthorized access to sensitive information, system compromise, or data exfiltration. Immediate review and analysis of the identified emails
  and attachments are crucial to mitigate these risks.
tags:
- attack.t1566.001
date: '2020-04-29'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time)
  as lastTime from datamodel=Email.All_Email where All_Email.file_name="*"

  by All_Email.src_user All_Email.file_name All_Email.file_size All_Email.message_id
     All_Email.message_info All_Email.process All_Email.process_id All_Email.orig_dest
     All_Email.orig_recipient

  | `drop_dm_object_name(All_Email)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | lookup update=true is_suspicious_file_extension_lookup file_name OUTPUT suspicious
  | search suspicious=true
  | `suspicious_email_attachment_extensions_filter`
splunk_rule_id: 473bd65f-06ca-4dfe-a2b8-ba04ab4a0084
splunk_rule_type: Anomaly
logsource:
  category: all_email
detection:
  selection_0:
    All_Email.file_name|contains: ''
  condition: selection_0
