title: Suspicious Email Attachment Extensions
id: 473bd65f-06ca-4dfe-a2b8-ba04ab4a0084
status: experimental
level: medium
author: David Dorsey, Splunk
description: The following analytic detects emails containing attachments with suspicious file extensions. It leverages the Email data model in Splunk, using the tstats command to identify emails where
  the attachment filename is not empty. This detection is significant for SOC analysts as it highlights potential phishing or malware delivery attempts, which are common vectors for data breaches and malware
  infections. If confirmed malicious, this activity could lead to unauthorized access to sensitive information, system compromise, or data exfiltration. Immediate review and analysis of the identified emails
  and attachments are crucial to mitigate these risks.
tags:
- attack.T1566_001
date: '2020-04-29'
logsource:
  category: all_email
detection:
  selection_0:
    file_name|contains: '*'
  condition: selection_0
