title: Windows MSExchange Management Mailbox Cmdlet Usage
id: 396de86f-25e7-4b0e-be09-a330be35249d
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies suspicious Cmdlet usage in Exchange Management logs, focusing on commands like New-MailboxExportRequest and New-ManagementRoleAssignment. It leverages EventCode
  1 and specific Message patterns to detect potential ProxyShell and ProxyNotShell abuse. This activity is significant as it may indicate unauthorized access or manipulation of mailboxes and roles, which
  are critical for maintaining email security. If confirmed malicious, attackers could export mailbox data, assign new roles, or search mailboxes, leading to data breaches and privilege escalation.
references:
- https://gist.github.com/MHaggis/f66f1d608ea046efb9157020cd34c178
tags:
- attack.t1059.001
date: '2022-11-21'
original_spl: |-
  `msexchange_management` EventCode=1 Message IN ("*New-MailboxExportRequest*", "*New-ManagementRoleAssignment*", "*New-MailboxSearch*", "*Get-Recipient*", "*Search-Mailbox*")
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY host Message
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | rename host AS dest
    | `windows_msexchange_management_mailbox_cmdlet_usage_filter`
splunk_rule_id: 396de86f-25e7-4b0e-be09-a330be35249d
splunk_rule_type: Anomaly
logsource:
  product: m365
  service: exchange
detection:
  selection_0:
    EventID: 1
  selection_1:
    Message|contains:
    - New-MailboxExportRequest
    - New-ManagementRoleAssignment
    - New-MailboxSearch
    - Get-Recipient
    - Search-Mailbox
  condition: selection_0 and selection_1
