title: Windows Steal Authentication Certificates CryptoAPI
id: 905d5692-6d7c-432f-bc7e-a6b4f464d40e
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the extraction of authentication certificates using Windows Event Log - CAPI2 (CryptoAPI 2). It leverages EventID 70, which is generated when a certificate's
  private key is acquired. This detection is significant because it can identify potential misuse of certificates, such as those extracted by tools like Mimikatz or Cobalt Strike. If confirmed malicious,
  this activity could allow attackers to impersonate users, escalate privileges, or access sensitive information, posing a severe risk to the organization's security.
references:
- https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-vista/cc749296(v=ws.10)
tags:
- attack.t1649
date: '2023-02-09'
original_spl: |-
  `capi2_operational` EventCode=70
    | xmlkv UserData_Xml
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY Computer, UserData_Xml
    | rename Computer as dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_steal_authentication_certificates_cryptoapi_filter`
splunk_rule_id: 905d5692-6d7c-432f-bc7e-a6b4f464d40e
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: capi2
detection:
  selection_0:
    EventID: 70
  condition: selection_0
