title: Detect New Open GCP Storage Buckets
id: f6ea3466-d6bb-11ea-87d0-0242ac130003
status: experimental
level: medium
author: Shannon Davis, Splunk
description: The following analytic identifies the creation of new open/public GCP Storage buckets. It leverages GCP PubSub events, specifically monitoring for the `storage.setIamPermissions` method and
  checks if the `allUsers` member is added. This activity is significant because open storage buckets can expose sensitive data to the public, posing a severe security risk. If confirmed malicious, an attacker
  could access, modify, or delete data within the bucket, leading to data breaches and potential compliance violations.
tags:
- attack.t1530
date: '2020-08-19'
original_spl: |-
  `google_gcp_pubsub_message` data.resource.type=gcs_bucket data.protoPayload.methodName=storage.setIamPermissions
    | spath output=action path=data.protoPayload.serviceData.policyDelta.bindingDeltas{}.action
    | spath output=user path=data.protoPayload.authenticationInfo.principalEmail
    | spath output=location path=data.protoPayload.resourceLocation.currentLocations{}
    | spath output=src path=data.protoPayload.requestMetadata.callerIp
    | spath output=bucketName path=data.protoPayload.resourceName
    | spath output=role path=data.protoPayload.serviceData.policyDelta.bindingDeltas{}.role
    | spath output=member path=data.protoPayload.serviceData.policyDelta.bindingDeltas{}.member
    | search (member=allUsers AND action=ADD)
    | table  _time, bucketName, src, user, location, action, role, member
    | search `detect_new_open_gcp_storage_buckets_filter`
splunk_rule_id: f6ea3466-d6bb-11ea-87d0-0242ac130003
splunk_rule_type: TTP
logsource:
  product: gcp
  service: pubsub
detection:
  selection_0:
    data.resource.type: gcs_bucket
  selection_1:
    data.protoPayload.methodName: storage.setIamPermissions
  condition: selection_0 and selection_1
