title: GCP Multiple Users Failing To Authenticate From Ip
id: da20828e-d6fb-4ee5-afb7-d0ac200923d5
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects a single source IP address failing to authenticate into more than 20 unique Google Workspace user accounts within a 5-minute window. It leverages Google Workspace
  login failure events to identify potential password spraying attacks. This activity is significant as it may indicate an adversary attempting to gain unauthorized access or elevate privileges within the
  Google Cloud Platform. If confirmed malicious, this behavior could lead to unauthorized access to sensitive resources, data breaches, or further exploitation within the environment.
references:
- https://cloud.google.com/blog/products/identity-security/how-google-cloud-can-help-stop-credential-stuffing-attacks
- https://www.slideshare.net/dafthack/ok-google-how-do-i-red-team-gsuite
- https://attack.mitre.org/techniques/T1110/003/
- https://www.blackhillsinfosec.com/wp-content/uploads/2020/05/Breaching-the-Cloud-Perimeter-Slides.pdf
tags:
- attack.t1110.003
- attack.t1110.004
- attack.t1586.003
date: '2022-10-12'
original_spl: |-
  `gws_reports_login` event.type = login event.name = login_failure
    | bucket span=5m _time
    | stats count dc(user) AS unique_accounts values(user) as tried_accounts values(authentication_method) AS authentication_method earliest(_time) as firstTime latest(_time) as lastTime
      BY _time event.name src
         app id.applicationName
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | where unique_accounts > 20
    | `gcp_multiple_users_failing_to_authenticate_from_ip_filter`
splunk_rule_id: da20828e-d6fb-4ee5-afb7-d0ac200923d5
splunk_rule_type: Anomaly
logsource:
  product: google_workspace
  service: login
detection:
  selection_0:
    event.type: login
  selection_1:
    event.name: login_failure
  condition: selection_0 and selection_1
