title: GCP Multiple Failed MFA Requests For User
id: cbb3cb84-c06f-4393-adcc-5cb6195621f1
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects multiple failed multi-factor authentication (MFA) requests for a single user within a Google Cloud Platform (GCP) tenant. It triggers when 10 or more MFA prompts
  fail within a 5-minute window, using Google Workspace login failure events. This behavior is significant as it may indicate an adversary attempting to bypass MFA by bombarding the user with repeated authentication
  requests. If confirmed malicious, this activity could lead to unauthorized access, allowing attackers to compromise accounts and potentially escalate privileges within the GCP environment.
references:
- https://www.mandiant.com/resources/blog/russian-targeting-gov-business
- https://arstechnica.com/information-technology/2022/03/lapsus-and-solar-winds-hackers-both-use-the-same-old-trick-to-bypass-mfa/
- https://therecord.media/russian-hackers-bypass-2fa-by-annoying-victims-with-repeated-push-notifications/
- https://attack.mitre.org/techniques/T1621/
- https://attack.mitre.org/techniques/T1078/004/
tags:
- attack.t1078.004
- attack.t1586.003
- attack.t1621
date: '2022-08-25'
original_spl: |-
  `gws_reports_login` event.name=login_failure `gws_login_mfa_methods`
    | bucket span=5m _time
    | stats dc(_raw) AS mfa_prompts values(user) AS user
      BY src_ip, login_challenge_method, _time
    | where mfa_prompts >= 10
    | `gcp_multiple_failed_mfa_requests_for_user_filter`
splunk_rule_id: cbb3cb84-c06f-4393-adcc-5cb6195621f1
splunk_rule_type: TTP
logsource:
  product: google_workspace
  service: login
detection:
  selection_0:
    event.name: login_failure
  condition: selection_0
