title: Gdrive suspicious file sharing
id: a7131dae-34e3-11ec-a2de-acde48001122
status: experimental
level: medium
author: Rod Soto, Teoderick Contreras
description: The following analytic identifies suspicious file-sharing activity on Google Drive, where internal users share documents with more than 50 external recipients. It leverages GSuite Drive logs,
  focusing on changes in user access and filtering for emails outside the organization's domain. This activity is significant as it may indicate compromised accounts or intentional data exfiltration. If
  confirmed malicious, this behavior could lead to unauthorized access to sensitive information, data leaks, and potential compliance violations.
references:
- https://www.splunk.com/en_us/blog/security/investigating-gsuite-phishing-attacks-with-splunk.html
tags:
- attack.t1566
date: '2021-10-24'
original_spl: |-
  `gsuite_drive` name=change_user_access
    | rename parameters.* as *
    | search email = "*@yourdomain.com" target_user != "*@yourdomain.com"
    | stats count values(owner) as owner values(target_user) as target values(doc_type) as doc_type values(doc_title) as doc_title dc(target_user) as distinct_target
      BY src_ip email
    | where distinct_target > 50
    | `gdrive_suspicious_file_sharing_filter`
splunk_rule_id: a7131dae-34e3-11ec-a2de-acde48001122
splunk_rule_type: Hunting
logsource:
  product: google_workspace
  service: drive
detection:
  selection_0:
    name: change_user_access
  condition: selection_0
