title: Gdrive suspicious file sharing
id: a7131dae-34e3-11ec-a2de-acde48001122
status: experimental
level: medium
author: Rod Soto, Teoderick Contreras
description: The following analytic identifies suspicious file-sharing activity on Google Drive, where internal users share documents with more than 50 external recipients. It leverages GSuite Drive logs,
  focusing on changes in user access and filtering for emails outside the organization's domain. This activity is significant as it may indicate compromised accounts or intentional data exfiltration. If
  confirmed malicious, this behavior could lead to unauthorized access to sensitive information, data leaks, and potential compliance violations.
references:
- https://www.splunk.com/en_us/blog/security/investigating-gsuite-phishing-attacks-with-splunk.html
tags:
- attack.T1566
date: '2021-10-24'
logsource:
  product: google_workspace
  service: drive
detection:
  selection_0:
    name: change_user_access
  condition: selection_0
