title: Gsuite suspicious calendar invite
id: 03cdd68a-34fb-11ec-9bd3-acde48001122
status: experimental
level: medium
author: Rod Soto, Teoderick Contreras
description: The following analytic detects suspicious calendar invites sent via GSuite, potentially indicating compromised accounts or malicious internal activity. It leverages GSuite calendar logs, focusing
  on events where a high volume of invites (over 100) is sent within a 5-minute window. This behavior is significant as it may involve the distribution of malicious links or attachments, posing a security
  risk. If confirmed malicious, this activity could lead to widespread phishing attacks, unauthorized access, or malware distribution within the organization.
references:
- https://www.techrepublic.com/article/how-to-avoid-the-dreaded-google-calendar-malicious-invite-issue/
- https://gcn.com/cybersecurity/2012/09/the-20-most-common-words-in-phishing-attacks/280956/
tags:
- attack.T1566
date: '2021-10-24'
logsource:
  product: google_workspace
  service: calendar
detection:
  selection_0:
    target_calendar_id!: 'null'
  selection_1:
    email|contains: '*yourdomain.com'
  condition: selection_0 and selection_1
