title: Gsuite Email With Known Abuse Web Service Link
id: 8630aa22-042b-11ec-af39-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects emails in Gsuite containing links to known abuse web services such as Pastebin, Telegram, and Discord. It leverages Gsuite Gmail logs to identify emails with
  these specific domains in their links. This activity is significant because these services are commonly used by attackers to deliver malicious payloads. If confirmed malicious, this could lead to the
  delivery of malware, phishing attacks, or other harmful activities, potentially compromising sensitive information or systems within the organization.
references:
- https://news.sophos.com/en-us/2021/07/22/malware-increasingly-targets-discord-for-abuse/
tags:
- attack.T1566_001
date: '2021-08-23'
logsource:
  product: google_workspace
  service: gmail
detection:
  selection_0:
    '"link_domain{}"|contains':
    - '*pastebin.com*'
    - '*discord*'
    - '*telegram*'
    - t.me
  condition: selection_0
