title: GSuite Email Suspicious Attachment
id: 6d663014-fe92-11eb-ab07-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious attachment file extensions in GSuite emails, potentially indicating a spear-phishing attack. It leverages GSuite Gmail logs to identify emails with
  attachments having file extensions commonly associated with malware, such as .exe, .bat, and .js. This activity is significant as these file types are often used to deliver malicious payloads, posing
  a risk of compromising targeted machines. If confirmed malicious, this could lead to unauthorized code execution, data breaches, or further network infiltration.
references:
- https://www.redhat.com/en/topics/devops/what-is-devsecops
tags:
- attack.T1566_001
date: '2021-08-16'
logsource:
  product: google_workspace
  service: gmail
detection:
  selection_0:
    file_extension_type"|contains:
    - pl
    - py
    - rb
    - sh
    - bat
    - exe
    - dll
    - cpl
    - com
    - js
    - vbs
    - ps1
    - reg
    - swf
    - cmd
    - go
  condition: selection_0
