title: Gsuite Outbound Email With Attachment To External Domain
id: dc4dc3a8-ff54-11eb-8bf7-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Stanislav Miskovic, Splunk
description: The following analytic detects outbound emails with attachments sent from an internal email domain to an external domain. It leverages Gsuite Gmail logs, parsing the source and destination
  email domains, and flags emails with fewer than 20 outbound instances. This activity is significant as it may indicate potential data exfiltration or insider threats. If confirmed malicious, an attacker
  could use this method to exfiltrate sensitive information, leading to data breaches and compliance violations.
references:
- https://www.redhat.com/en/topics/devops/what-is-devsecops
tags:
- attack.t1048.003
date: '2021-08-17'
original_spl: |-
  `gsuite_gmail` num_message_attachments > 0
    | rex field=source.from_header_address "[^@]+@(?<source_domain>[^@]+)"
    | rex field=destination{}.address "[^@]+@(?<dest_domain>[^@]+)"
    | where source_domain="internal_test_email.com" and not dest_domain="internal_test_email.com"
    | eval phase="plan"
    | eval severity="low"
    | stats values(subject) as subject, values(source.from_header_address) as src_domain_list, count as numEvents, dc(source.from_header_address) as numSrcAddresses, min(_time) as firstTime max(_time) as lastTime
      BY dest_domain phase severity
    | where numSrcAddresses < 20
    | sort - numSrcAddresses
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `gsuite_outbound_email_with_attachment_to_external_domain_filter`
splunk_rule_id: dc4dc3a8-ff54-11eb-8bf7-acde48001122
splunk_rule_type: Hunting
logsource:
  product: google_workspace
  service: gmail
detection:
  selection_0:
    num_message_attachments: 0
  condition: selection_0
