title: Gsuite Outbound Email With Attachment To External Domain
id: dc4dc3a8-ff54-11eb-8bf7-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Stanislav Miskovic, Splunk
description: The following analytic detects outbound emails with attachments sent from an internal email domain to an external domain. It leverages Gsuite Gmail logs, parsing the source and destination
  email domains, and flags emails with fewer than 20 outbound instances. This activity is significant as it may indicate potential data exfiltration or insider threats. If confirmed malicious, an attacker
  could use this method to exfiltrate sensitive information, leading to data breaches and compliance violations.
references:
- https://www.redhat.com/en/topics/devops/what-is-devsecops
tags:
- attack.T1048_003
date: '2021-08-17'
logsource:
  product: google_workspace
  service: gmail
detection:
  selection_0:
    num_message_attachments: 0
  condition: selection_0
