title: Gsuite Drive Share In External Email
id: f6ee02d6-fea0-11eb-b2c2-acde48001122
status: experimental
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects Google Drive or Google Docs files shared externally from an internal domain. It leverages GSuite Drive logs, extracting and comparing the source and destination
  email domains to identify external sharing. This activity is significant as it may indicate potential data exfiltration by an attacker or insider. If confirmed malicious, this could lead to unauthorized
  access to sensitive information, data leakage, and potential compliance violations. Monitoring this behavior helps in early detection and mitigation of data breaches.
references:
- https://www.redhat.com/en/topics/devops/what-is-devsecops
tags:
- attack.T1567_002
date: '2021-08-16'
logsource:
  product: google_workspace
  service: drive
detection:
  filter_0:
    email: 'null'
  condition: filter_0
