title: Linux Auditd Preload Hijack Library Calls
id: 35c50572-a70b-452f-afa9-bebdf3c3ce36
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of the LD_PRELOAD environment variable to hijack or hook library functions on a Linux platform. It leverages data from Linux Auditd, focusing on process
  execution logs that include command-line details. This activity is significant because adversaries, malware authors, and red teamers commonly use this technique to gain elevated privileges and establish
  persistence on a compromised machine. If confirmed malicious, this behavior could allow attackers to execute arbitrary code, escalate privileges, and maintain long-term access to the system.
references:
- https://compilepeace.medium.com/memory-malware-part-0x2-writing-userland-rootkits-via-ld-preload-30121c8343d5
tags:
- attack.t1574.006
date: '2024-08-09'
original_spl: |-
  `linux_auditd` execve_command = "*LD_PRELOAD*"
    | rename host as dest
    | rename comm as process_name
    | rename exe as process
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY argc execve_command dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_preload_hijack_library_calls_filter`
splunk_rule_id: 35c50572-a70b-452f-afa9-bebdf3c3ce36
splunk_rule_type: TTP
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains: LD_PRELOAD
  condition: selection_0
