title: Linux Auditd Insert Kernel Module Using Insmod Utility
id: bc0ca53f-dea6-4906-9b12-09c396fdf1d3
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the insertion of a Linux kernel module using the insmod utility. It leverages data from Linux Auditd, focusing on process execution logs that include process
  names and command-line details. This activity is significant as it may indicate the installation of a rootkit or malicious kernel module, potentially allowing an attacker to gain elevated privileges and
  bypass security detections. If confirmed malicious, this could lead to unauthorized code execution, persistent access, and severe compromise of the affected system.
references:
- https://docs.fedoraproject.org/en-US/fedora/rawhide/system-administrators-guide/kernel-module-driver-configuration/Working_with_Kernel_Modules/
- https://security.stackexchange.com/questions/175953/how-to-load-a-malicious-lkm-at-startup
- https://0x00sec.org/t/kernel-rootkits-getting-your-hands-dirty/1485
tags:
- attack.t1547.006
date: '2024-08-09'
original_spl: |-
  `linux_auditd` type=SYSCALL comm=insmod
    | rename host as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY comm exe syscall
         uid ppid pid
         success dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_insert_kernel_module_using_insmod_utility_filter`
splunk_rule_id: bc0ca53f-dea6-4906-9b12-09c396fdf1d3
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SYSCALL
  selection_1:
    comm: insmod
  condition: selection_0 and selection_1
