title: Linux Auditd Kernel Module Enumeration
id: d1b088de-c47a-4572-9339-bdcc26493b32
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic identifies the use of the 'kmod' process to list kernel modules on a Linux system. This detection leverages data from Linux Auditd, focusing on process names and command-line
  executions. While listing kernel modules is not inherently malicious, it can be a precursor to loading unauthorized modules using 'insmod'. If confirmed malicious, this activity could allow an attacker
  to load kernel modules, potentially leading to privilege escalation, persistence, or other malicious actions within the system.
references:
- https://man7.org/linux/man-pages/man8/kmod.8.html
tags:
- attack.T1082
- attack.T1014
date: '2024-08-09'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SYSCALL
  selection_1:
    comm: lsmod
  condition: selection_0 and selection_1
