title: Linux Auditd Auditd Daemon Start
id: 6b0cb0ff-9a7e-4475-a687-43827fdb31d6
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the (re)initialization of the Linux audit daemon (auditd) by identifying log entries of type DAEMON_START. This event indicates that the audit subsystem has resumed
  logging after being stopped or has started during system boot. While DAEMON_START may be expected during reboots or legitimate configuration changes, it can also signal attempts to re-enable audit logging
  after evasion, or restarts with modified or reduced rule sets. Monitoring this event in correlation with DAEMON_END, DAEMON_ABORT, and auditctl activity provides visibility into the continuity and integrity
  of audit logs. Frequent or unexplained DAEMON_START events should be investigated, especially if they are not accompanied by valid administrative or system activity.
references:
- https://docs.redhat.com/en/documentation/red_hat_enterprise_linux/6/html/security_guide/sec-audit_record_types
tags:
- attack.t1685.004
date: '2024-08-12'
original_spl: |-
  `linux_auditd` type=DAEMON_START
    | rename host as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY type op res
         auid dest pid
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_auditd_daemon_start_filter`
splunk_rule_id: 6b0cb0ff-9a7e-4475-a687-43827fdb31d6
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: DAEMON_START
  condition: selection_0
