title: Linux Auditd File Permissions Modification Via Chattr
id: f2d1110d-b01c-4a58-9975-90a9edeb083a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious file permissions modifications using the chattr command, which may indicate an attacker attempting to manipulate file attributes to evade detection
  or prevent alteration. The chattr command can be used to make files immutable or restrict deletion, which can be leveraged to protect malicious files or disrupt system operations. By monitoring for unusual
  or unauthorized chattr usage, this analytic helps identify potential tampering with critical files, enabling security teams to quickly respond to and mitigate threats associated with unauthorized file
  attribute changes.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
tags:
- attack.T1222_002
date: '2024-08-12'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains: '*chattr *'
  selection_1:
    proctitle|contains: '* -i*'
  condition: selection_0 and selection_1
