title: Linux Auditd Unix Shell Configuration Modification
id: 66f737c6-3f7f-46ed-8e9b-cc0e5bf01f04
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects suspicious access or modifications to Unix shell configuration files, which may indicate an attempt to alter system behavior or gain unauthorized access.
  Unix shell configuration files, such as `.bashrc` or `.profile`, control user environment settings and command execution.
  Unauthorized changes to these files can be used to execute malicious commands, escalate privileges, or hide malicious activities.
  By monitoring for unusual or unauthorized modifications to shell configuration files, this analytic helps identify potential security threats, allowing security teams to respond quickly and mitigate risks.
  Correlate this with related EXECVE or PROCTITLE events to identify the process or user responsible for the access or modification.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
- https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
tags:
- attack.T1546_004
date: '2024-08-22'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: PATH
  selection_1:
    type: CWD
  condition: selection_0 and selection_1
