title: Linux Auditd Sudo Or Su Execution
id: 817a5c89-5b92-4818-a22d-aa35e1361afe
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the "sudo" or "su" command on a Linux operating system. It leverages data from Linux Auditd, focusing on process names and parent process names.
  This activity is significant because "sudo" and "su" commands are commonly used by adversaries to elevate privileges, potentially leading to unauthorized access or control over the system. If confirmed
  malicious, this activity could allow attackers to execute commands with root privileges, leading to severe security breaches, data exfiltration, or further system compromise.
references:
- https://attack.mitre.org/techniques/T1548/003/
tags:
- attack.t1548.003
date: '2024-08-09'
original_spl: |-
  `linux_auditd`  proctitle IN ("*sudo *", "*su *")
    | rename host as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY proctitle dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_sudo_or_su_execution_filter`
splunk_rule_id: 817a5c89-5b92-4818-a22d-aa35e1361afe
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains:
    - 'sudo '
    - 'su '
  condition: selection_0
