title: Linux Auditd Nopasswd Entry In Sudoers File
id: 651df959-ad17-4b73-a323-90cb96d5fa1b
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the addition of NOPASSWD entries to the /etc/sudoers file on Linux systems. It leverages Linux Auditd data to identify command lines containing "NOPASSWD:". This
  activity is significant because it allows users to execute commands with elevated privileges without requiring a password, which can be exploited by adversaries to maintain persistent, privileged access.
  If confirmed malicious, this could lead to unauthorized privilege escalation, persistent access, and potential compromise of sensitive data and system integrity.
references:
- https://askubuntu.com/questions/334318/sudoers-file-enable-nopasswd-for-user-all-commands
- https://help.ubuntu.com/community/Sudoers
tags:
- attack.t1548.003
date: '2024-08-09'
original_spl: |-
  `linux_auditd` proctitle = "*NOPASSWD*"
    | rename host as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY proctitle dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_nopasswd_entry_in_sudoers_file_filter`
splunk_rule_id: 651df959-ad17-4b73-a323-90cb96d5fa1b
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains: NOPASSWD
  condition: selection_0
