title: Linux Auditd Possible Access To Credential Files
id: 0419cb7a-57ea-467b-974f-77c303dfe2a3
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects attempts to access or dump the contents of /etc/passwd and /etc/shadow files on Linux systems. It leverages data from Linux Auditd, focusing on processes like
  'cat', 'nano', 'vim', and 'vi' accessing these files. This activity is significant as it may indicate credential dumping, a technique used by adversaries to gain persistence or escalate privileges. If
  confirmed malicious, privileges. If confirmed malicious, attackers could obtain hashed passwords for offline cracking, leading to unauthorized access and potential system compromise.
references:
- https://askubuntu.com/questions/445361/what-is-difference-between-etc-shadow-and-etc-passwd
- https://attack.mitre.org/techniques/T1003/008/
tags:
- attack.T1003_008
date: '2024-08-19'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains:
    - '*shadow*'
    - '*passwd*'
  selection_1:
    proctitle|contains:
    - '*cat *'
    - '*nano *'
    - '*vim *'
    - '*vi *'
  condition: selection_0 and selection_1
