title: Linux Auditd Clipboard Data Copy
id: 9ddfe470-c4d0-4e60-8668-7337bd699edd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of the Linux 'xclip' command to copy data from the clipboard. It leverages Linux Auditd telemetry, focusing on process names and command-line arguments
  related to clipboard operations. This activity is significant because adversaries can exploit clipboard data to capture sensitive information such as passwords or IP addresses. If confirmed malicious,
  this technique could lead to unauthorized data exfiltration, compromising sensitive information and potentially aiding further attacks within the environment.
references:
- https://attack.mitre.org/techniques/T1115/
- https://linux.die.net/man/1/xclip
tags:
- attack.t1115
date: '2022-06-17'
original_spl: |-
  `linux_auditd` execve_command IN ("*xclip*", "*clipboard*") AND execve_command IN ("*-o*", "*-selection *", "*-sel *" )
    | rename host as dest
    | rename comm as process_name
    | rename exe as process
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY argc execve_command dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_clipboard_data_copy_filter`
splunk_rule_id: 9ddfe470-c4d0-4e60-8668-7337bd699edd
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains:
    - xclip
    - clipboard
  selection_1:
    execve_command|contains:
    - -o
    - '-selection '
    - '-sel '
  condition: selection_0 and selection_1
