title: Linux Magic SysRq Key Abuse
id: 22c03600-f84a-47fa-abaa-ffbe3e72c782
status: stable
level: medium
author: Milad Cheraghi
description: |
  Detects potential abuse of the Linux Magic SysRq (System Request) key by adversaries with root or sufficient privileges to manipulate or destabilize a system.
  Writing to /proc/sysrq-trigger can crash the system, kill processes, or bypass standard logging.
  Monitoring SysRq abuse helps detect stealthy post-exploitation activity.
  Correlate with related EXECVE or PROCTITLE events to identify the process or user responsible for the access or modification.
references:
- https://www.kernel.org/doc/html/v4.10/_sources/admin-guide/sysrq.txt
- https://docs.redhat.com/en/documentation/red_hat_enterprise_linux/4/html/reference_guide/s3-proc-sys-kernel
- https://www.splunk.com/en_us/blog/security/threat-update-awfulshred-script-wiper.html
tags:
- attack.T1059_004
- attack.T1529
- attack.T1489
- attack.T1499
date: '2025-08-28'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: PATH
  selection_1:
    type: CWD
  condition: selection_0 and selection_1
