title: Linux Auditd File And Directory Discovery
id: 0bbfb79c-a755-49a5-a38a-1128d0a452f1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious file and directory discovery activities, which may indicate an attacker's effort to locate sensitive documents and files on a compromised system. This
  behavior often precedes data exfiltration, as adversaries seek to identify valuable or confidential information for theft. By identifying unusual or unauthorized attempts to browse or enumerate files
  and directories, this analytic helps security teams detect potential reconnaissance or preparatory actions by an attacker, enabling timely intervention to prevent data breaches or unauthorized access.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
- https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
tags:
- attack.T1083
date: '2024-08-22'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains:
    - '*grep*'
    - '*find*'
  selection_1:
    execve_command|contains:
    - '*.tif*'
    - '*.tiff*'
    - '*.gif*'
    - '*.jpeg*'
    - '*.jpg*'
    - '*.jif*'
    - '*.jfif*'
    - '*.jp2*'
    - '*.jpx*'
    - '*.j2k*'
    - '*.j2c*'
    - '*.fpx*'
    - '*.pcd*'
    - '*.png*'
    - '*.flv*'
    - '*.pdf*'
    - '*.mp4*'
    - '*.mp3*'
    - '*.gifv*'
    - '*.avi*'
    - '*.mov*'
    - '*.mpeg*'
    - '*.wav*'
    - '*.doc*'
    - '*.docx*'
    - '*.xls*'
    - '*.xlsx*'
    - '*.svg*'
  condition: selection_0 and selection_1
