title: Linux Auditd Disable Or Modify System Firewall
id: 07052556-d4b5-4bae-89aa-cbdc1bb11250
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the suspicious disable or modify system firewall. This behavior is critical for a SOC to monitor because it may indicate attempts to gain unauthorized access
  or maintain control over a system. Such actions could be signs of malicious activity. If confirmed, this could lead to serious consequences, including a compromised system, unauthorized access to sensitive
  data, or even a wider breach affecting the entire network. Detecting and responding to these signs early is essential to prevent potential security incidents.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
tags:
- attack.T1686
date: '2024-08-12'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SERVICE_STOP
  selection_1:
    unit|contains:
    - firewalld
    - ufw
  condition: selection_0 and selection_1
