title: Linux Auditd Hidden Files And Directories Creation
id: 555cc358-bf16-4e05-9b3a-0f89c73b7261
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious creation of hidden files and directories, which may indicate an attacker's attempt to conceal malicious activities or unauthorized data. Hidden files
  and directories are often used to evade detection by security tools and administrators, providing a stealthy means for storing malware, logs, or sensitive information. By monitoring for unusual or unauthorized
  creation of hidden files and directories, this analytic helps identify potential attempts to hide or unauthorized creation of hidden files and directories, this analytic helps identify potential attempts
  to hide malicious operations, enabling security teams to uncover and address hidden threats effectively.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
- https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
tags:
- attack.T1083
date: '2024-08-12'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains:
    - '*touch *'
    - '*mkdir *'
    - '*vim *'
    - '*vi *'
    - '*nano *'
  selection_1:
    execve_command|contains:
    - '* ./.*'
    - '* .*'
    - '*/.*'
  condition: selection_0 and selection_1
