title: Linux Auditd Stop Services
id: 43bc9281-753b-4743-b4b7-60af84f085f3
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects attempts to stop a service on Linux systems. It leverages data from Linux Auditd. This activity is significant as adversaries often stop or terminate security
  or critical services to disable defenses or disrupt operations, as seen in malware like Industroyer2. If confirmed malicious, this could lead to the disabling of security mechanisms, allowing attackers
  to persist, escalate privileges, or deploy destructive payloads, severely impacting system integrity and availability.
references:
- https://www.welivesecurity.com/2022/04/12/industroyer2-industroyer-reloaded/
- https://cert.gov.ua/article/39518
tags:
- attack.T1489
date: '2024-08-12'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SERVICE_STOP
  condition: selection_0
