title: Linux Auditd Dd File Overwrite
id: d1b74420-4cea-4752-a123-9b40dfcca49a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the use of the 'dd' command to overwrite files on a Linux system. It leverages data from Linux Auditd telemetry, focusing on process execution logs that include
  command-line details. This activity is significant because adversaries often use the 'dd' command to destroy or irreversibly overwrite files, disrupting system availability and services. If confirmed
  malicious, this behavior could lead to data destruction, making recovery difficult and potentially causing significant operational disruptions.
references:
- https://gtfobins.github.io/gtfobins/dd/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1485/T1485.md
tags:
- attack.T1485
date: '2024-08-09'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains: '*dd *'
  selection_1:
    proctitle|contains: '*of=*'
  selection_2:
    proctitle|contains: '*if=/dev/zero*'
  condition: selection_0 and selection_1 and selection_2
