title: Linux Auditd Add User Account
id: aae66dc0-74b4-4807-b480-b35f8027abb4
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of new user accounts on Linux systems using commands like "useradd" or "adduser." It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on process names and command-line executions. This activity is significant as adversaries often create new user accounts to establish persistence on compromised hosts. If confirmed malicious,
  this could allow attackers to maintain access, escalate privileges, and further compromise the system, posing a severe security risk.
references:
- https://linuxize.com/post/how-to-create-users-in-linux-using-the-useradd-command/
tags:
- attack.t1136.001
date: '2022-01-10'
original_spl: |-
  `linux_auditd` proctitle IN ("*useradd*", "*adduser*")
    | rename host as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY proctitle dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_add_user_account_filter`
splunk_rule_id: aae66dc0-74b4-4807-b480-b35f8027abb4
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains:
    - useradd
    - adduser
  condition: selection_0
