title: Linux Auditd Service Started
id: b5eed06d-5c97-4092-a3a1-fa4b7e77c71a
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the suspicious service started. This behavior is critical for a SOC to monitor because it may indicate attempts to gain unauthorized access or maintain control
  over a system. Such actions could be signs of malicious activity. If confirmed, this could lead to serious consequences, including a compromised system, unauthorized access to sensitive data, or even
  a wider breach affecting the entire network. Detecting and responding to these signs early is essential to prevent potential security incidents.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
tags:
- attack.t1569.002
date: '2024-08-12'
original_spl: |-
  `linux_auditd`  proctitle IN ("*systemctl *", "*service *") AND proctitle IN ("* start*", "* enable*")
    | rename host as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY proctitle dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_service_started_filter`
splunk_rule_id: b5eed06d-5c97-4092-a3a1-fa4b7e77c71a
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains:
    - 'systemctl '
    - 'service '
  selection_1:
    proctitle|contains:
    - ' start'
    - ' enable'
  condition: selection_0 and selection_1
