title: Linux Auditd Private Keys and Certificate Enumeration
id: 892eb674-3344-4143-8e52-4775b1daf3f1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious attempts to find private keys, which may indicate an attacker's effort to access sensitive cryptographic information. Private keys are crucial for
  securing encrypted communications and data, and unauthorized access to them can lead to severe security breaches, including data decryption and identity theft. By monitoring for unusual or unauthorized
  searches for private keys, this analytic helps identify potential threats to cryptographic security, enabling security teams to take swift action to protect the integrity and confidentiality of encrypted
  information.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
- https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
tags:
- attack.t1552.004
date: '2024-08-12'
original_spl: |-
  `linux_auditd` execve_command IN ("*find*", "*grep*") AND execve_command IN ("*.pem*", "*.cer*", "*.crt*", "*.pgp*", "*.key*", "*.gpg*", "*.ppk*", "*.p12*", "*.pfx*", "*.p7b*")
    | rename host as dest
    | rename comm as process_name
    | rename exe as process
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY argc execve_command dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_private_keys_and_certificate_enumeration_filter`
splunk_rule_id: 892eb674-3344-4143-8e52-4775b1daf3f1
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains:
    - find
    - grep
  selection_1:
    execve_command|contains:
    - .pem
    - .cer
    - .crt
    - .pgp
    - .key
    - .gpg
    - .ppk
    - .p12
    - .pfx
    - .p7b
  condition: selection_0 and selection_1
