title: Linux Auditd Unload Module Via Modprobe
id: 90964d6a-4b5f-409a-85bd-95e261e03fe9
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious use of the `modprobe` command to unload kernel modules, which may indicate an attempt to disable critical system components or evade detection. The
  `modprobe` utility manages kernel modules, and unauthorized unloading of modules can disrupt system security features, remove logging capabilities, or conceal malicious activities. By monitoring for unusual
  or unauthorized `modprobe` operations involving module unloading, this analytic helps identify potential tampering with kernel functionality, enabling security teams to investigate and address possible
  threats to system integrity.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
tags:
- attack.t1547.006
date: '2024-08-12'
original_spl: |-
  `linux_auditd` execve_command = "*modprobe*" AND execve_command = "*-r *"
    | rename host as dest
    | rename comm as process_name
    | rename exe as process
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY argc execve_command dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_unload_module_via_modprobe_filter`
splunk_rule_id: 90964d6a-4b5f-409a-85bd-95e261e03fe9
splunk_rule_type: TTP
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains: modprobe
  selection_1:
    execve_command|contains: '-r '
  condition: selection_0 and selection_1
