title: Linux Auditd Doas Conf File Creation
id: 61059783-574b-40d2-ac2f-69b898afd6b4
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects the creation of the doas.conf file on a Linux host.
  This file is used by the doas utility to allow standard users to perform tasks as root, similar to sudo.
  The detection leverages Linux Auditd data, focusing on the creation of the doas.conf file.
  This activity is significant because it can indicate an attempt to gain elevated privileges, potentially by an adversary. If confirmed malicious, this could allow an attacker to execute commands with root commands with root privileges, leading to full system compromise.
references:
- https://wiki.gentoo.org/wiki/Doas
- https://www.makeuseof.com/how-to-install-and-use-doas/
tags:
- attack.T1548_003
date: '2024-08-09'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: PATH
    nametype: CREATE
  selection_1:
    type: CWD
  condition: selection_0 and selection_1
