title: Linux Auditd Edit Cron Table Parameter
id: f4bb7321-7e64-4d1e-b1aa-21f8b019a91f
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the suspicious editing of cron jobs in Linux using the crontab command-line parameter (-e). It identifies this activity by monitoring command-line executions
  involving 'crontab' and the edit parameter. This behavior is significant for a SOC as cron job manipulations can indicate unauthorized persistence attempts or scheduled malicious actions. If confirmed
  malicious, this activity could lead to system compromise, unauthorized access, or broader network compromise.
references:
- https://attack.mitre.org/techniques/T1053/003/
tags:
- attack.T1053_003
date: '2024-08-12'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SYSCALL
  selection_1:
    syscall|contains:
    - rename
    - execve
  selection_2:
    comm|contains: crontab
  selection_3:
    exe|contains: '*/crontab'
  selection_4:
    success: 'yes'
  filter_5:
    UID: daemon
  condition: (selection_0 and selection_1 and selection_2 and selection_3 and selection_4) and not (filter_5)
