title: Linux Auditd File Permission Modification Via Chmod
id: 5f1d2ea7-eec0-4790-8b24-6875312ad492
status: stable
level: medium
author: Teoderick Contreras, Splunk, Ivar Nygård
description: The following analytic detects suspicious file permission modifications using the `chmod` command, which may indicate an attacker attempting to alter access controls on critical files or directories.
  Such modifications can be used to grant unauthorized users elevated privileges or to conceal malicious activities by restricting legitimate access. By monitoring for unusual or unauthorized `chmod` usage,
  this analytic helps identify potential security breaches, allowing security teams to respond promptly to prevent privilege escalation, data tampering, or other unauthorized actions on the system.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
tags:
- attack.T1222_002
date: '2024-08-12'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains: '*chmod*'
  selection_1:
    proctitle|contains:
    - '* 777 *'
    - '* 755 *'
    - '*+*x*'
    - '* 754 *'
  condition: selection_0 and selection_1
