title: Linux Auditd Doas Tool Execution
id: 91b8ca78-f205-4826-a3ef-cd8d6b24e97b
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the 'doas' tool on a Linux host. This tool allows standard users to perform tasks with root privileges, similar to 'sudo'. The detection leverages
  data from Linux Auditd, focusing on process names and command-line executions. This activity is significant as 'doas' can be exploited by adversaries to gain elevated privileges on a compromised host.
  If confirmed malicious, this could lead to unauthorized administrative access, potentially compromising the entire system.
references:
- https://wiki.gentoo.org/wiki/Doas
- https://www.makeuseof.com/how-to-install-and-use-doas/
tags:
- attack.t1548.003
date: '2024-08-09'
original_spl: |-
  `linux_auditd` type=SYSCALL comm=doas
    | rename host as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY comm exe syscall
         uid ppid pid
         success dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_doas_tool_execution_filter`
splunk_rule_id: 91b8ca78-f205-4826-a3ef-cd8d6b24e97b
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SYSCALL
  selection_1:
    comm: doas
  condition: selection_0 and selection_1
