title: Linux Auditd Whoami User Discovery
id: d1ff2e22-310d-446a-80b3-faedaa7b3b52
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the suspicious use of the whoami command, which may indicate an attacker trying to gather information about the current user account on a compromised system.
  The whoami command is commonly used to verify user privileges and identity, especially during initial stages of an attack to assess the level of access. By monitoring for unusual or unauthorized executions
  of whoami, this analytic helps in identifying potential reconnaissance activities, enabling security teams to take action before the attacker escalates privileges or conducts further malicious operations.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
- https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
tags:
- attack.T1033
date: '2024-08-12'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SYSCALL
    comm: whoami
  selection_1:
    exe|contains: '*/whoami'
  condition: selection_0 and selection_1
