title: Linux Auditd Data Transfer Size Limits Via Split
id: 4669561d-3bbd-44e3-857c-0e3c6ef2120c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious data transfer activities that involve the use of the `split` syscall, potentially indicating an attempt to evade detection by breaking large files
  into smaller parts. Attackers may use this technique to bypass size-based security controls, facilitating the covert exfiltration of sensitive data. By monitoring for unusual or unauthorized use of the
  `split` syscall, this analytic helps identify potential data exfiltration attempts, allowing security teams to intervene and prevent the unauthorized transfer of critical information from the network.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
tags:
- attack.t1030
date: '2024-08-12'
original_spl: |-
  `linux_auditd` execve_command = "*split*" AND execve_command = "*-b *"
    | rename host as dest
    | rename comm as process_name
    | rename exe as process
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY argc execve_command dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_data_transfer_size_limits_via_split_filter`
splunk_rule_id: 4669561d-3bbd-44e3-857c-0e3c6ef2120c
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains: split
  selection_1:
    execve_command|contains: '-b '
  condition: selection_0 and selection_1
