title: Linux Auditd Find Credentials From Password Managers
id: 784241aa-85a5-4782-a503-d071bd3446f9
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious attempts to find credentials stored in password managers, which may indicate an attacker's effort to retrieve sensitive login information. Password
  managers are often targeted by adversaries seeking to access stored passwords for further compromise or lateral movement within a network. By monitoring for unusual or unauthorized access to password
  manager files or processes, this analytic helps identify potential credential theft attempts, enabling security teams to respond quickly to protect critical accounts and prevent further unauthorized access.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
- https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
tags:
- attack.T1555_005
date: '2024-08-23'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains:
    - '*find*'
    - '*grep*'
  selection_1:
    execve_command|contains:
    - '*.kdbx*'
    - '*KeePass*'
    - '*.enforced*'
    - '*.lpdb*'
    - '*.opvault*'
    - '*.agilekeychain*'
    - '*.dashlane*'
    - '*.rfx*'
    - '*passbolt*'
    - '*.spdb*'
    - '*StickyPassword*'
    - '*.walletx*'
    - '*enpass*'
    - '*vault*'
    - '*.kdb*'
  condition: selection_0 and selection_1
