title: Linux Auditd Copy Fail Privilege Escalation
id: dd16294f-44d2-40b4-a869-542c0b85113a
status: stable
level: medium
author: Raven Tait, Nasreddine Bencherchali, Splunk
description: |-
  Detects the exploitation pattern associated with Copy Fail.
  Copy Fail (CVE-2026-31431) is a logic bug in the Linux kernel's authentication cryptographic template.
  It lets an unprivileged local user trigger a deterministic, controlled 4-byte write into the page cache of any readable file on the system.
  A single 732-byte Python script can edit a setuid binary and obtain root on essentially all Linux distributions shipped since 2017.
  This search relies on the auditd configuration linked in the references section. If you are using a custom configuration, make sure the Key names are the same or adapt the search accordingly.
references:
- https://xint.io/blog/copy-fail-linux-distributions
- https://github.com/theori-io/copy-fail-CVE-2026-31431
- https://github.com/Neo23x0/auditd/blob/master/audit.rules
tags:
- attack.T1068
date: '2026-05-04'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SYSCALL
  selection_1:
    key|contains:
    - af_alg
    - process_creation
    - splice_user
  condition: selection_0 and selection_1
