title: Linux Auditd Data Destruction Command
id: 4da5ce1a-f71b-4e71-bb73-c0a3c73f3c3c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of a Unix shell command designed to wipe root directories on a Linux host. It leverages data from Linux Auditd, focusing on the 'rm' command with
  force recursive deletion and the '--no-preserve-root' option. This activity is significant as it indicates potential data destruction attempts, often associated with malware like Awfulshred. If confirmed
  malicious, this behavior could lead to severe data loss, system instability, and compromised integrity of the affected Linux host. Immediate investigation and response are crucial to mitigate potential
  damage.
references:
- https://cert.gov.ua/article/3718487
- https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/overview-of-the-cyber-weapons-used-in-the-ukraine-russia-war/
tags:
- attack.t1485
date: '2023-02-08'
original_spl: |-
  `linux_auditd`  (proctitle = "*rm *" AND proctitle = "*-rf *" AND proctitle = "*--no-preserve-root*")
    | rename host as dest
    | rename comm as process_name
    | rename exe as process
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY proctitle dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_data_destruction_command_filter`
splunk_rule_id: 4da5ce1a-f71b-4e71-bb73-c0a3c73f3c3c
splunk_rule_type: TTP
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains: 'rm '
  selection_1:
    proctitle|contains: '-rf '
  selection_2:
    proctitle|contains: --no-preserve-root
  condition: selection_0 and selection_1 and selection_2
