title: Linux Auditd At Application Execution
id: 9f306e0a-1c36-469e-8892-968ca12470dd
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the "At" application in Linux, which can be used by attackers to create persistence entries on a compromised host. This detection leverages data
  from Endpoint Detection and Response (EDR) agents, focusing on process names and parent process names associated with "at" or "atd". This activity is significant because the "At" application can be exploited
  to maintain unauthorized access or deliver additional malicious payloads. If confirmed malicious, this behavior could lead to data theft, ransomware attacks, or other severe consequences. Immediate investigation
  is required to determine the legitimacy of the execution and mitigate potential risks.
references:
- https://attack.mitre.org/techniques/T1053/001/
- https://www.linkedin.com/pulse/getting-attacker-ip-address-from-malicious-linux-job-craig-rowland/
tags:
- attack.T1053_002
date: '2021-12-21'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: SYSCALL
    comm:
    - at
    - atd
  selection_1:
    exe:
    - /usr/bin/at
    - /usr/bin/atd
    uid: daemon
  condition: selection_0 and selection_1
