title: Linux Auditd Setuid Using Chmod Utility
id: 8230c407-1b47-4d95-ac2e-718bd6381386
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of the chmod utility to set the SUID or SGID bit on files, which can allow users to temporarily gain root or group-level access. This detection
  leverages data from Linux Auditd, focusing on process names and command-line arguments related to chmod. This activity is significant as it can indicate an attempt to escalate privileges or maintain persistence
  on a system. If confirmed malicious, an attacker could gain elevated access, potentially compromising sensitive data or critical system functions.
references:
- https://www.hackingarticles.in/linux-privilege-escalation-using-capabilities/
tags:
- attack.t1548.001
date: '2024-08-09'
original_spl: |-
  `linux_auditd`  proctitle IN ("*chmod *")  AND proctitle IN ("* u+s *", "* g+s *", "* 4777 *", "* 4577 *")
    | rename host as dest
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY proctitle dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_setuid_using_chmod_utility_filter`
splunk_rule_id: 8230c407-1b47-4d95-ac2e-718bd6381386
splunk_rule_type: Anomaly
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    proctitle|contains: 'chmod '
  selection_1:
    proctitle|contains:
    - ' u+s '
    - ' g+s '
    - ' 4777 '
    - ' 4577 '
  condition: selection_0 and selection_1
