title: Linux Auditd Unix Shell Configuration Modification
id: 66f737c6-3f7f-46ed-8e9b-cc0e5bf01f04
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |
  The following analytic detects suspicious access or modifications to Unix shell configuration files, which may indicate an attempt to alter system behavior or gain unauthorized access.
  Unix shell configuration files, such as `.bashrc` or `.profile`, control user environment settings and command execution.
  Unauthorized changes to these files can be used to execute malicious commands, escalate privileges, or hide malicious activities.
  By monitoring for unusual or unauthorized modifications to shell configuration files, this analytic helps identify potential security threats, allowing security teams to respond quickly and mitigate risks.
  Correlate this with related EXECVE or PROCTITLE events to identify the process or user responsible for the access or modification.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
- https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
tags:
- attack.t1546.004
date: '2024-08-22'
original_spl: |-
  `linux_auditd`
  (type=PATH OR type=CWD)
  | rex "msg=audit\([^)]*:(?<audit_id>\d+)\)"

  | stats
    values(type) as types
    values(name) as names
    values(nametype) as nametype
    values(cwd) as cwd_list
    values(_time) as event_times
    by audit_id, host

  | eval current_working_directory = coalesce(mvindex(cwd_list, 0), "N/A")
  | eval candidate_paths = mvmap(names, if(match(names, "^/"), names, current_working_directory + "/" + names))
  | eval matched_paths = mvfilter(match(candidate_paths, "/etc/profile|/etc/shells|/etc/profile\\.d/.*|/etc/bash\\.bashrc.*|/etc/bashrc|.*/zsh/zprofile|.*/zsh/zshrc|.*/zsh/zlogin|.*/zsh/zlogout|/etc/csh\\.cshrc.*|/etc/csh\\.login.*|/root/\\.bashrc.*|/root/\\.bash_profile.*|/root/\\.profile.*|/root/\\.zshrc.*|/root/\\.zprofile.*|/home/.*/\\.bashrc.*|/home/.*/\\.zshrc.*|/home/.*/\\.bash_profile.*|/home/.*/\\.zprofile.*|/home/.*/\\.profile.*|/home/.*/\\.bash_login.*|/home/.*/\\.bash_logout.*|/home/.*/\\.zlogin.*|/home/.*/\\.zlogout.*"))
  | eval match_count = mvcount(matched_paths)
  | eval reconstructed_path = mvindex(matched_paths, 0)
  | eval e_time = mvindex(event_times, 0)
  | where match_count > 0
  | rename host as dest

  | stats count min(e_time) as firstTime max(e_time) as lastTime
    values(nametype) as nametype
    by current_working_directory
       reconstructed_path
       match_count
       dest
       audit_id

  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_auditd_unix_shell_configuration_modification_filter`
splunk_rule_id: 66f737c6-3f7f-46ed-8e9b-cc0e5bf01f04
splunk_rule_type: TTP
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: PATH
  selection_1:
    type: CWD
  condition: selection_0 and selection_1
