title: Linux Auditd Possible Access Or Modification Of Sshd Config File
id: acb3ea33-70f7-47aa-b335-643b3aebcb2f
status: stable
level: medium
author: Teoderick Contreras, Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects access, deletion or modification of the ssh_config file on Linux systems.
  It leverages data from Linux Auditd, focusing on events of type PATH with a nametype of ("NORMAL", "CREATE", "DELETE").
  This activity could be significant because unauthorized changes to ssh_config can allow threat actors to redirect port connections or use unauthorized keys, potentially compromising the system.
  Correlate this with related EXECVE or PROCTITLE events to identify the process or user responsible for the access or modification.
  If confirmed malicious, this could lead to unauthorized access, privilege escalation, or persistent backdoor access, posing a severe security risk.
references:
- https://www.hackingarticles.in/ssh-penetration-testing-port-22/
- https://attack.mitre.org/techniques/T1098/004/
tags:
- attack.T1098_004
date: '2022-01-12'
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    type: PATH
    nametype:
    - NORMAL
    - CREATE
    - DELETE
  selection_1:
    type: CWD
  condition: selection_0 and selection_1
