title: Linux Auditd Find Credentials From Password Stores
id: 4de73044-9a1d-4a51-a1c2-85267d8dcab3
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious attempts to find credentials stored in password stores, indicating a potential attacker's effort to access sensitive login information. Password stores
  are critical repositories that contain valuable credentials, and unauthorized access to them can lead to significant security breaches. By monitoring for unusual or unauthorized activities related to
  password store access, this analytic helps identify potential credential theft attempts, allowing security teams to respond promptly and prevent unauthorized access to critical systems and data.
references:
- https://www.splunk.com/en_us/blog/security/deep-dive-on-persistence-privilege-escalation-technique-and-detection-in-linux-platform.html
- https://github.com/peass-ng/PEASS-ng/tree/master/linPEAS
tags:
- attack.t1555.005
date: '2024-08-12'
original_spl: |-
  `linux_auditd` execve_command IN ("*find*", "*grep*") AND execve_command IN ("*password*", "*pass *", "*credential*", "*creds*")
    | rename host as dest
    | rename comm as process_name
    | rename exe as process
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY argc execve_command dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `linux_auditd_find_credentials_from_password_stores_filter`
splunk_rule_id: 4de73044-9a1d-4a51-a1c2-85267d8dcab3
splunk_rule_type: TTP
logsource:
  product: linux
  service: auditd
detection:
  selection_0:
    execve_command|contains:
    - find
    - grep
  selection_1:
    execve_command|contains:
    - password
    - 'pass '
    - credential
    - creds
  condition: selection_0 and selection_1
