title: Cisco Secure Firewall - High EVE Threat Confidence
id: 8c15183e-2e70-4db4-86c3-88f8d9129b66
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects connections with a high Encrypted Visibility Engine (EVE) threat confidence score, indicating potentially malicious behavior within encrypted traffic. It leverages Cisco Secure Firewall Threat Defense logs and evaluates the EVE_ThreatConfidencePct field, which reflects the system's confidence in classifying encrypted sessions as threats based on machine learning models and behavioral analysis. A score equal to or greater than 80 suggests the connection is highly likely to be associated with malware command and control (C2), remote access tools, or suspicious tunneling behavior. If confirmed malicious, this may indicate covert communication over TLS from compromised hosts.
references:
- https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
tags:
- attack.T1041
- attack.T1071_001
- attack.T1105
- attack.T1573_002
date: '2025-04-03'
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: ConnectionEvent
  selection_1:
    EVE_ThreatConfidencePct: 80
  condition: selection_0 and selection_1
