title: Cisco Secure Firewall - SSH Connection to sshd_operns
id: 8a9c1d2e-3f4b-5c6d-7e8f-9a0b1c2d3e4f
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic detects inbound SSH connections to the sshd_operns service on network devices using Cisco Secure Firewall Intrusion Events.
  APT actors have been observed enabling sshd_operns and opening it on non-standard ports to maintain encrypted remote access to compromised network infrastructure.
  This detection leverages Snort signature 65368 to identify connections to this service, which when combined with other indicators may signal persistent access mechanisms established by threat actors.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-239a
tags:
- attack.t1021.004
date: '2026-01-12'
original_spl: |-
  `cisco_secure_firewall`
  EventType=IntrusionEvent
  signature_id=65368
  | fillnull
  | stats dc(signature_id) as unique_signature_count
          values(signature_id) as signature_id
          values(signature) as signature
          values(class_desc) as class_desc
          values(MitreAttackGroups) as MitreAttackGroups
          values(InlineResult) as InlineResult
          values(InlineResultReason) as InlineResultReason
          values(src) as src
          values(dest_port) as dest_port
          values(rule) as rule
          values(transport) as transport
          values(app) as app
          min(_time) as firstTime
          max(_time) as lastTime
          by dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_secure_firewall___ssh_connection_to_sshd_operns_filter`
splunk_rule_id: 8a9c1d2e-3f4b-5c6d-7e8f-9a0b1c2d3e4f
splunk_rule_type: Anomaly
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  selection_1:
    signature_id: 65368
  condition: selection_0 and selection_1
