title: Cisco Secure Firewall - File Download Over Uncommon Port
id: f26445a8-a6a2-4855-bec0-0c39e52e5b8f
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects file transfers flagged as malware that occurred over non-standard ports (other than 80 and 443). Adversaries may attempt to bypass protocol-based detection or use alternate ports to blend in with other traffic. This analytic identifies these non-conventional flows and surfaces potential evasion techniques. If confirmed malicious this indicate potential malware delivery or other nefarious activity.
references:
- https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
tags:
- attack.t1105
- attack.t1571
date: '2025-04-09'
original_spl: |-
  `cisco_secure_firewall` EventType=FileEvent FileDirection="Download" NOT dest_port IN (80, 443)
  | lookup cisco_secure_firewall_filetype_lookup Name as FileType OUTPUT Description
  | stats count min(_time) as firstTime max(_time) as lastTime
          values(file_name) as file_name
          values(uri) as uri
          values(ClientApplication) as ClientApplication
          values(file_hash) as file_hash
          values(SHA_Disposition) as SHA_Disposition
          by FileDirection FileType app ThreatName dest_port Description src dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | table firstTime lastTime src dest dest_port FileDirection FileType Description uri ClientApplication file_name file_hash SHA_Disposition ThreatName
  | `cisco_secure_firewall___file_download_over_uncommon_port_filter`
splunk_rule_id: f26445a8-a6a2-4855-bec0-0c39e52e5b8f
splunk_rule_type: Anomaly
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: FileEvent
  selection_1:
    FileDirection: Download
  filter_2:
    dest_port:
    - 80
    - 443
  condition: (selection_0 and selection_1) and not (filter_2)
