title: Cisco IOS Suspicious Privileged Account Creation
id: 63e3aff9-45d7-4d41-bcdb-9da561fb4533
status: stable
level: medium
author: Bhavin Patel, Michael Haag, Splunk
description: This analytic detects the creation of privileged user accounts on Cisco IOS devices, which could indicate an attacker establishing backdoor access. The detection focuses on identifying when
  user accounts are created with privilege level 15 (the highest administrative privilege level in Cisco IOS) or when existing accounts have their privileges elevated. This type of activity is particularly
  concerning when performed by unauthorized users or during unusual hours, as it may represent a key step in establishing persistence following the exploitation of vulnerabilities like CVE-2018-0171 in
  Cisco Smart Install. Threat actors like Static Tundra have been observed creating privileged accounts as part of their attack chain after gaining initial access to network devices.
references:
- https://blog.talosintelligence.com/static-tundra/
- https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-smi2
- https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/security/a1/sec-a1-cr-book/sec-cr-a2.html#wp3796044403
tags:
- attack.t1136
- attack.t1078
date: '2025-08-21'
original_spl: |-
  | tstats `security_content_summariesonly` count values(All_Changes.command) as command min(_time) as firstTime max(_time) as lastTime FROM datamodel=Change.All_Changes
    WHERE (
          (All_Changes.command="*username * privilege 15*")
          OR
          (All_Changes.command="*username * password*"
          AND
          All_Changes.command="*USER TABLE MODIFIED*")
          OR
          (All_Changes.command="*USER_PRIVILEGE_UPDATE*priv-15*")
      )
    BY All_Changes.dvc All_Changes.user
  | `drop_dm_object_name("All_Changes")`
  | rename dvc as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_ios_suspicious_privileged_account_creation_filter`
splunk_rule_id: 63e3aff9-45d7-4d41-bcdb-9da561fb4533
splunk_rule_type: Anomaly
logsource:
  category: process_creation
  product: cisco
detection:
  selection_0:
    CommandLine|contains: username * privilege 15
  selection_1:
    CommandLine|contains: '*username * password*'
  selection_2:
    CommandLine|contains: USER_PRIVILEGE_UPDATE*priv-15
  condition: selection_0 and selection_1 and selection_2
