title: Cisco Secure Firewall - Lumma Stealer Outbound Connection Attempt
id: 66f22f52-fbae-4be7-a263-561dacb63612
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk, Talos NTDR
description: |
  This analytic detects Lumma Stealer outbound connection attempts using Cisco Secure Firewall Intrusion Events.
  It leverages Cisco Secure Firewall Threat Defense IntrusionEvent logs to identify cases where Snort signatures with IDs 64797, 64798, 64799, 64800, 64801, 64167, 64168, 64169, 62709 have been triggered. If confirmed malicious, this behavior could indicate an active infection of Lumma Stealer.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.lumma
tags:
- attack.T1041
- attack.T1573_002
date: '2025-04-16'
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  condition: selection_0
