title: Cisco Secure Firewall - SSH Connection to Non-Standard Port
id: 9b0c2d3e-4f5a-6b7c-8d9e-0f1a2b3c4d5e
status: stable
level: medium
author: Nasreddine Bencherchali, Michael Haag, Splunk
description: |
  This analytic detects inbound SSH connections to non-standard ports on network devices using Cisco Secure Firewall Intrusion Events. APT actors have been observed enabling SSH servers on high, non-default TCP ports to maintain encrypted remote access to compromised network infrastructure.
  This detection leverages Snort signature 65369 to identify SSH protocol traffic on unusual ports, which may indicate persistence mechanisms or backdoor access established by threat actors.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-239a
tags:
- attack.t1021.004
date: '2026-01-12'
original_spl: |-
  `cisco_secure_firewall`
  EventType=IntrusionEvent
  signature_id=65369
  | fillnull
  | stats dc(signature_id) as unique_signature_count
          values(signature_id) as signature_id
          values(signature) as signature
          values(class_desc) as class_desc
          values(MitreAttackGroups) as MitreAttackGroups
          values(InlineResult) as InlineResult
          values(InlineResultReason) as InlineResultReason
          values(src) as src
          values(dest_port) as dest_port
          values(rule) as rule
          values(transport) as transport
          values(app) as app
          min(_time) as firstTime
          max(_time) as lastTime
          by dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_secure_firewall___ssh_connection_to_non_standard_port_filter`
splunk_rule_id: 9b0c2d3e-4f5a-6b7c-8d9e-0f1a2b3c4d5e
splunk_rule_type: Anomaly
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  selection_1:
    signature_id: 65369
  condition: selection_0 and selection_1
