title: Cisco Smart Install Port Discovery and Status
id: ded9f9d7-edb8-48cf-8b72-1b459eee6785
status: stable
level: medium
author: Bhavin Patel, Michael Haag, Splunk
description: This analytic detects network traffic to TCP port 4786, which is used by the Cisco Smart Install protocol. Smart Install is a plug-and-play configuration and image-management feature that helps
  customers to deploy Cisco switches. This protocol has been exploited via CVE-2018-0171, a vulnerability that allows unauthenticated remote attackers to execute arbitrary code or cause denial of service
  conditions. Recently, Cisco Talos reported that a Russian state-sponsored threat actor called "Static Tundra" has been actively exploiting this vulnerability to compromise unpatched and end-of-life network
  devices. Monitoring for traffic to this port can help identify potential exploitation attempts or unauthorized Smart Install activity.
references:
- https://blog.talosintelligence.com/static-tundra/
- https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-smi2
- https://github.com/AlrikRr/Cisco-Smart-Exploit
- https://www.exploit-db.com/exploits/44451
tags:
- attack.T1190
date: '2025-08-21'
logsource:
  category: network_connection
  product: cisco
detection:
  selection_0:
    DestinationPort: 4786
  selection_1:
    transport: tcp
  condition: selection_0 and selection_1
