title: Cisco Secure Firewall - Blocked Connection
id: 17e9b764-3a2b-4d36-9751-32d13ce4718b
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: The following analytic detects a blocked connection event by identifying a "Block" value in the action field. It leverages logs from Cisco Secure Firewall Threat Defense devices. This activity
  is significant as it can identify attempts from users or applications initiating network connection to explicitly or implicitly blocked range or zones. If confirmed malicious, attackers could be attempting
  to perform a forbidden action on the network such as data exfiltration, lateral movement, or network disruption.
references:
- https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
tags:
- attack.T1018
- attack.T1046
- attack.T1110
- attack.T1203
- attack.T1595_002
date: '2025-04-03'
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: ConnectionEvent
  selection_1:
    action|contains:
    - Block with reset
    - Block
    - blocked
  condition: selection_0 and selection_1
