title: Cisco Secure Firewall - Lumma Stealer Activity
id: 96bce783-c22e-4e48-8cf1-3eb2794c5083
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk, Talos NTDR
description: |
  This analytic detects Lumma Stealer activity using Cisco Secure Firewall Intrusion Events.
  It leverages Cisco Secure Firewall Threat Defense IntrusionEvent logs to identify cases where four of the following Snort signature IDs 64793, 64794, 64797, 64798, 64799, 64800, 64801, 62709, 64167, 64168, 64169, 64796, 62710, 62711, 62712, 62713, 62714, 62715, 62716, 62717, 64812, 64810, 64811 occurs in the span of 15 minutes from the same host.
  If confirmed malicious, this behavior is highly indicative of a successful infection of Lumma Stealer.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.lumma
tags:
- attack.T1190
- attack.T1210
- attack.T1027
- attack.T1204
date: '2025-04-16'
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  condition: selection_0
