title: Cisco IOS XE WebUI Login From IOSd Local Port
id: 77a1751f-552f-456c-b9ae-cdb66eec3e42
status: stable
level: medium
author: Nasreddine Bencherchali
description: |
  This analytic detects Cisco IOS-XE WebUI authentication failure and success logs that include local port 21111.
  This is a strong an indicator of WebUI exploitation because normal users should not authenticate through the underlying IOS-XE Linux shell path.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-239a
- https://blog.talosintelligence.com/salt-typhoon-analysis/
tags:
- attack.T1190
- attack.T1078
date: '2026-05-19'
logsource:
  product: cisco
  service: ios
detection:
  selection_0:
    facility: SEC_LOGIN
  selection_1:
    mnemonic|contains:
    - QUIET_MODE_ON
    - LOGIN_SUCCESS
    - LOGIN_FAILED
  selection_2:
    message_text|contains: '*[localport: 21111]*'
  condition: selection_0 and selection_1 and selection_2
