title: Cisco Secure Firewall - Lumma Stealer Outbound Connection Attempt
id: 66f22f52-fbae-4be7-a263-561dacb63612
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk, Talos NTDR
description: |
  This analytic detects Lumma Stealer outbound connection attempts using Cisco Secure Firewall Intrusion Events.
  It leverages Cisco Secure Firewall Threat Defense IntrusionEvent logs to identify cases where Snort signatures with IDs 64797, 64798, 64799, 64800, 64801, 64167, 64168, 64169, 62709 have been triggered. If confirmed malicious, this behavior could indicate an active infection of Lumma Stealer.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.lumma
tags:
- attack.t1041
- attack.t1573.002
date: '2025-04-16'
original_spl: |-
  `cisco_secure_firewall` EventType=IntrusionEvent signature_id IN (64797, 64798, 64799, 64800, 64801, 64167, 64168, 64169, 62709)
  | fillnull
  | stats min(_time) as firstTime max(_time) as lastTime
          by src dest dest_port transport signature_id signature class_desc MitreAttackGroups rule InlineResult InlineResultReason app
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_secure_firewall___lumma_stealer_outbound_connection_attempt_filter`
splunk_rule_id: 66f22f52-fbae-4be7-a263-561dacb63612
splunk_rule_type: Anomaly
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  selection_1:
    signature_id:
    - 64797
    - 64798
    - 64799
    - 64800
    - 64801
    - 64167
    - 64168
    - 64169
    - 62709
  condition: selection_0 and selection_1
