title: Cisco Secure Firewall - Snort Rule Triggered Across Multiple Hosts
id: a4c76d0a-56b6-44be-814b-939746c4d406
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic identifies Snort intrusion signatures that have been triggered by ten or more distinct internal IP addresses within a one-hour window. It leverages Cisco Secure Firewall Threat Defense logs and focuses on the IntrusionEvent event type to detect activity that may indicate broad targeting or mass exploitation attempts. This behavior is often associated with opportunistic scanning, worm propagation, or automated exploitation of known vulnerabilities across multiple systems. If confirmed malicious, this could represent the early phase of a coordinated attack aiming to gain a foothold on several hosts or move laterally across the environment.
references:
- https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
tags:
- attack.t1105
- attack.t1027
date: '2025-04-16'
original_spl: |-
  `cisco_secure_firewall` EventType=IntrusionEvent
  | bin _time span=1h
  | stats dc(src) as unique_src_ips, values(src) as src
          min(_time) as firstTime max(_time) as lastTime
          Values(dest) as dest
          Values(dest_port) as dest_port
          Values(rule) as rule
          Values(transport) as transport
          Values(app) as app
          by signature_id, signature class_desc MitreAttackGroups InlineResult InlineResultReason
  | where unique_src_ips >= 10
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_secure_firewall___snort_rule_triggered_across_multiple_hosts_filter`
splunk_rule_id: a4c76d0a-56b6-44be-814b-939746c4d406
splunk_rule_type: Anomaly
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  condition: selection_0
