title: Cisco Secure Firewall - SSH Connection to Non-Standard Port
id: 9b0c2d3e-4f5a-6b7c-8d9e-0f1a2b3c4d5e
status: stable
level: medium
author: Nasreddine Bencherchali, Michael Haag, Splunk
description: |
  This analytic detects inbound SSH connections to non-standard ports on network devices using Cisco Secure Firewall Intrusion Events. APT actors have been observed enabling SSH servers on high, non-default TCP ports to maintain encrypted remote access to compromised network infrastructure.
  This detection leverages Snort signature 65369 to identify SSH protocol traffic on unusual ports, which may indicate persistence mechanisms or backdoor access established by threat actors.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-239a
tags:
- attack.T1021_004
date: '2026-01-12'
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  selection_1:
    SignatureId: 65369
  condition: selection_0 and selection_1
