title: Cisco Secure Firewall - React Server Components RCE Attempt
id: d36459b1-7901-401a-a67e-44426c15b168
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk, Talos NTDR
description: |
  This analytic detects exploitation activity of CVE-2025-55182 using Cisco Secure Firewall Intrusion Events.
  It leverages Cisco Secure Firewall Threat Defense IntrusionEvent logs to identify cases where Snort signature 65554 (React Server Components remote code execution attempt) is triggered
  If confirmed malicious, this behavior could be indicative of a potential exploitation of CVE-2025-55182.
references:
- https://react.dev/blog/2025/12/03/critical-security-vulnerability-in-react-server-components
- https://nextjs.org/blog/CVE-2025-66478
- https://nvd.nist.gov/vuln/detail/CVE-2025-55182
- https://gist.github.com/maple3142/48bc9393f45e068cf8c90ab865c0f5f3
- https://www.wiz.io/blog/critical-vulnerability-in-react-cve-2025-55182
tags:
- attack.t1190
date: '2025-07-17'
original_spl: |-
  `cisco_secure_firewall`
  EventType=IntrusionEvent
  signature_id = 65554
  | fillnull
  | stats min(_time) as firstTime
          max(_time) as lastTime
          values(signature_id) as signature_id
          values(signature) as signature
          values(class_desc) as class_desc
          values(MitreAttackGroups) as MitreAttackGroups
          values(InlineResult) as InlineResult
          values(InlineResultReason) as InlineResultReason
          values(src) as src
          values(dest_port) as dest_port
          values(rule) as rule
          values(transport) as transport
          values(app) as app
          by dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_secure_firewall___react_server_components_rce_attempt_filter`
splunk_rule_id: d36459b1-7901-401a-a67e-44426c15b168
splunk_rule_type: TTP
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  selection_1:
    signature_id: 65554
  condition: selection_0 and selection_1
