title: Cisco Smart Install Port Discovery and Status
id: ded9f9d7-edb8-48cf-8b72-1b459eee6785
status: stable
level: medium
author: Bhavin Patel, Michael Haag, Splunk
description: This analytic detects network traffic to TCP port 4786, which is used by the Cisco Smart Install protocol. Smart Install is a plug-and-play configuration and image-management feature that helps
  customers to deploy Cisco switches. This protocol has been exploited via CVE-2018-0171, a vulnerability that allows unauthenticated remote attackers to execute arbitrary code or cause denial of service
  conditions. Recently, Cisco Talos reported that a Russian state-sponsored threat actor called "Static Tundra" has been actively exploiting this vulnerability to compromise unpatched and end-of-life network
  devices. Monitoring for traffic to this port can help identify potential exploitation attempts or unauthorized Smart Install activity.
references:
- https://blog.talosintelligence.com/static-tundra/
- https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-smi2
- https://github.com/AlrikRr/Cisco-Smart-Exploit
- https://www.exploit-db.com/exploits/44451
tags:
- attack.t1190
date: '2025-08-21'
original_spl: |-
  | tstats `security_content_summariesonly` count values(All_Traffic.src_ip) as src_ip values(All_Traffic.src_port) as src_port values(All_Traffic.dest_ip) as dest_ip earliest(_time) as firstTime latest(_time) as lastTime FROM datamodel=Network_Traffic
    WHERE All_Traffic.dest_port=4786
      AND
      All_Traffic.transport=tcp
    BY All_Traffic.dest_ip All_Traffic.dest_port
  | `drop_dm_object_name("All_Traffic")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_smart_install_port_discovery_and_status_filter`
splunk_rule_id: ded9f9d7-edb8-48cf-8b72-1b459eee6785
splunk_rule_type: TTP
logsource:
  category: network_connection
  product: cisco
detection:
  selection_0:
    All_Traffic.dest_port: 4786
  selection_1:
    All_Traffic.transport: tcp
  condition: selection_0 and selection_1
