title: Cisco Secure Firewall - Citrix NetScaler Memory Overread Attempt
id: 93db24a0-fd21-45d7-9daf-84afd5a8cca2
status: stable
level: medium
author: Michael Haag, Nasreddine Bencherchali, Splunk, Talos NTDR
description: |
  This analytic detects exploitation activity of CVE-2025-5777 using Cisco Secure Firewall Intrusion Events.
  It leverages Cisco Secure Firewall Threat Defense IntrusionEvent logs to identify cases where Snort signature 65118 (Citrix NetScaler memory overread attempt) is triggered
  If confirmed malicious, this behavior is highly indicative of a potential exploitation of CVE-2025-5777.
references:
- https://support.citrix.com/support-home/kbsearch/article?articleNumber=CTX693420
- https://support.citrix.com/support-home/kbsearch/article?articleNumber=CTX693420
- https://www.netscaler.com/blog/news/critical-security-updates-for-netscaler-netscaler-gateway-and-netscaler-console/
- https://github.com/mingshenhk/CitrixBleed-2-CVE-2025-5777-PoC-
- https://horizon3.ai/attack-research/attack-blogs/cve-2025-5777-citrixbleed-2-write-up-maybe/
- https://labs.watchtowr.com/how-much-more-must-we-bleed-citrix-netscaler-memory-disclosure-citrixbleed-2-cve-2025-5777/
- https://github.com/projectdiscovery/nuclei-templates/blob/main/http/cves/2025/CVE-2025-5777.yaml
tags:
- attack.T1203
- attack.T1059
date: '2025-07-17'
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  selection_1:
    SignatureId: 65118
  condition: selection_0 and selection_1
