title: Cisco Secure Firewall - Connection to File Sharing Domain
id: f7e5e792-d907-46c1-a58e-4ff974dc462a
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects outbound connections to commonly abused file sharing and pastebin-style hosting domains. It leverages Cisco Secure Firewall Threat Defense logs and focuses on allowed connections (action=Allow) where the url field matches a list of known data hosting or temporary storage services. While many of these platforms serve legitimate purposes, they are frequently leveraged by adversaries for malware delivery, data exfiltration, command and control (C2) beacons, or staging of encoded payloads. This analytic is valuable for identifying potential abuse of legitimate infrastructure as part of an attacker's kill chain. If confirmed malicious, this activity may indicate tool staging, credential dumping, or outbound data leaks over HTTP(S).
references:
- https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
tags:
- attack.T1071_001
- attack.T1090_002
- attack.T1105
- attack.T1567_002
- attack.T1588_002
date: '2025-04-03'
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    action|contains:
    - Trust
    - Allow
    - allowed
  selection_1:
    EventType: ConnectionEvent
  selection_2:
    url|contains:
    - '*//objects.githubusercontent.com*'
    - '*anonfiles.com*'
    - '*cdn.discordapp.com*'
    - '*ddns.net*'
    - '*dl.dropboxusercontent.com*'
    - '*ghostbin.co*'
    - '*glitch.me*'
    - '*gofile.io*'
    - '*hastebin.com*'
    - '*mediafire.com*'
    - '*mega.nz*'
    - '*onrender.com*'
    - '*pages.dev*'
    - '*paste.ee*'
    - '*pastebin.com*'
    - '*pastebin.pl*'
    - '*pastetext.net*'
    - '*privatlab.com*'
    - '*privatlab.net*'
    - '*send.exploit.in*'
    - '*sendspace.com*'
    - '*storage.googleapis.com*'
    - '*storjshare.io*'
    - '*supabase.co*'
    - '*temp.sh*'
    - '*transfer.sh*'
    - '*trycloudflare.com*'
    - '*ufile.io*'
    - '*w3spaces.com*'
    - '*workers.dev*'
  condition: selection_0 and selection_1 and selection_2
