title: Cisco Secure Firewall - High Priority Intrusion Classification
id: ec99bb81-c31b-4837-8c7d-1b32aa70b337
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  This analytic identifies high-severity intrusion events based on the classification assigned to Snort rules within Cisco Secure Firewall logs.
  It leverages Cisco Secure Firewall Threat Defense logs and focuses on events classified as:

  - A Network Trojan was Detected
  - Successful Administrator Privilege Gain
  - Successful User Privilege Gain
  - Attempt to Login By a Default Username and Password
  - Known malware command and control traffic
  - Known malicious file or file based exploit
  - Known client side exploit attempt
  - Large Scale Information Leak"

  These classifications typically represent significant threats such as remote code execution, credential theft, lateral movement, or malware communication. Detection of these classifications should be prioritized for immediate investigation.
references:
- https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
tags:
- attack.T1203
- attack.T1003
- attack.T1071
- attack.T1190
- attack.T1078
date: '2025-04-16'
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: IntrusionEvent
  selection_1:
    class_desc|contains:
    - A Network Trojan was Detected
    - Successful Administrator Privilege Gain
    - Successful User Privilege Gain
    - Attempt to Login By a Default Username and Password
    - Known malware command and control traffic
    - Known malicious file or file based exploit
    - Known client side exploit attempt
    - Large Scale Information Leak
  condition: selection_0 and selection_1
