title: Cisco Secure Firewall - Communication Over Suspicious Ports
id: d85c05c8-42c0-4e4a-87e7-4e1bb3e844e3
status: stable
level: medium
author: Nasreddine Bencherchali, Splunk
description: |
  The following analytic detects potential reverse shell activity by identifying connections involving ports commonly associated with remote access tools, shell listeners, or tunneling utilities. It leverages Cisco Secure Firewall Threat Defense logs and monitors destination ports against a list of non-standard, high-risk port values often used in post-exploitation scenarios. Adversaries frequently configure tools like netcat, Meterpreter, or other backdoors to listen or connect over uncommon ports such as 4444, 2222, or 51820 to bypass standard monitoring and firewall rules. If confirmed malicious, this activity may represent command and control (C2) tunneling, lateral movement, or unauthorized remote access.
references:
- https://www.cisco.com/c/en/us/td/docs/security/firepower/741/api/FQE/secure_firewall_estreamer_fqe_guide_740.pdf
tags:
- attack.t1021
- attack.t1055
- attack.t1059.001
- attack.t1105
- attack.t1219
- attack.t1571
date: '2025-04-03'
original_spl: |-
  `cisco_secure_firewall` EventType=ConnectionEvent dest_port IN ("888", "999", "2200", "2222", "4000", "4444", "6789", "8531", "50501", "51820") | fillnull value="unknown" url
  | stats min(_time) as firstTime max(_time) as lastTime
        values(src_port) as src_port
        values(url) as url
        values(rule) as rule
        count by src, dest, dest_port, transport, action
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_secure_firewall___communication_over_suspicious_ports_filter`
splunk_rule_id: d85c05c8-42c0-4e4a-87e7-4e1bb3e844e3
splunk_rule_type: Anomaly
logsource:
  product: cisco
  service: firewall
detection:
  selection_0:
    EventType: ConnectionEvent
  selection_1:
    dest_port:
    - '888'
    - '999'
    - '2200'
    - '2222'
    - '4000'
    - '4444'
    - '6789'
    - '8531'
    - '50501'
    - '51820'
  condition: selection_0 and selection_1
