title: Cisco TFTP Server Configuration for Data Exfiltration
id: 1abce487-f480-4d5f-a551-01de0bece0bd
status: stable
level: medium
author: Bhavin Patel, Michael Haag, Splunk
description: This analytic detects the configuration of TFTP services on Cisco IOS devices that could be used to exfiltrate sensitive configuration files. Threat actors like Static Tundra have been observed
  configuring TFTP servers to make device configuration files accessible for exfiltration after gaining initial access. The detection specifically looks for commands that expose critical configuration files
  such as startup-config, running-config, and other sensitive system information through TFTP. This activity is particularly concerning as it may represent an attempt to steal credentials, network topology
  information, and other sensitive data stored in device configurations.
references:
- https://blog.talosintelligence.com/static-tundra/
- https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180328-smi2
- https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/fundamentals/command/cf_command_ref/T_through_X.html#wp3081407060
tags:
- attack.t1567
- attack.t1005
date: '2025-08-21'
original_spl: |-
  | tstats `security_content_summariesonly` count values(All_Changes.command) as command min(_time) as firstTime max(_time) as lastTime FROM datamodel=Change.All_Changes
    WHERE (
          All_Changes.command="*tftp-server*"
      )
      AND ( All_Changes.command="*nvram:startup-config*" OR All_Changes.command="*bootflash:running-config*" OR All_Changes.command="*system:running-config*" OR All_Changes.command="*bootflash:info*" OR All_Changes.command="*startup-config*" OR All_Changes.command="*running-config*" )
    BY All_Changes.dvc All_Changes.user
  | `drop_dm_object_name("All_Changes")`
  | rename dvc as dest
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_tftp_server_configuration_for_data_exfiltration_filter`
splunk_rule_id: 1abce487-f480-4d5f-a551-01de0bece0bd
splunk_rule_type: TTP
logsource:
  category: process_creation
  product: cisco
detection:
  selection_0:
    CommandLine|contains: tftp-server
  condition: selection_0
