title: Cisco IOS XE WebUI Programmatic Configuration
id: f9686576-a23d-4c4d-bfad-a45499dc448a
status: stable
level: medium
author: Nasreddine Bencherchali
description: |
  This analytic detects Cisco IOS-XE configuration changes performed by the WebUI WSMA process.
references:
- https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-239a
- https://blog.talosintelligence.com/salt-typhoon-analysis/
tags:
- attack.t1190
- attack.t1078
date: '2026-05-19'
original_spl: |-
  `cisco_ios`
  facility="SYS"
  mnemonic="CONFIG_P"
  message_text="*Configured programmatically by process SEP_webui_wsma_http*"
  | rex field=_raw "process\s(?<process>\S+)\sfrom.*as\s(?<user>\S+)\son\s(?<vty>\S+)"
  | eval dest=coalesce(host, dvc, dest, "unknown")
  | stats count min(_time) as firstTime
                max(_time) as lastTime
                values(process) as process
                values(vty) as vty
    by dest user
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `cisco_ios_xe_webui_programmatic_configuration_filter`
splunk_rule_id: f9686576-a23d-4c4d-bfad-a45499dc448a
splunk_rule_type: Anomaly
logsource:
  product: cisco
  service: ios
detection:
  selection_0:
    facility: SYS
  selection_1:
    mnemonic: CONFIG_P
  selection_2:
    message_text|contains: Configured programmatically by process SEP_webui_wsma_http
  condition: selection_0 and selection_1 and selection_2
