title: Detect Port Security Violation
id: 2de3d5b8-a4fa-45c5-8540-6d071c194d24
status: experimental
level: medium
author: Mikael Bjerkeland, Splunk
description: The following analytic detects port security violations on Cisco switches. It leverages logs from Cisco network devices, specifically looking for events with mnemonics indicating port security
  violations. This activity is significant because it indicates an unauthorized device attempting to connect to a secured port, potentially bypassing network access controls. If confirmed malicious, this
  could allow an attacker to gain unauthorized access to the network, leading to data exfiltration, network disruption, or further lateral movement within the environment.
tags:
- attack.T1200
- attack.T1498
- attack.T1557_002
date: '2020-10-28'
logsource:
  product: cisco
  service: ios
detection:
  selection_0:
    facility: PM
    mnemonic: ERR_DISABLE
    disable_cause: psecure-violation
  selection_1:
    facility: PORT_SECURITY
    mnemonic: PSECURE_VIOLATION
  selection_2:
    mnemonic: PSECURE_VIOLATION_VLAN
  condition: selection_0 and selection_1 and selection_2
