title: Detect Traffic Mirroring
id: 42b3b753-5925-49c5-9742-36fa40a73990
status: experimental
level: medium
author: Mikael Bjerkeland, Splunk
description: The following analytic detects the initiation of traffic mirroring sessions on Cisco network devices. It leverages logs with specific mnemonics and facilities related to traffic mirroring,
  such as "ETH_SPAN_SESSION_UP" and "PKTCAP_START." This activity is significant because adversaries may use traffic mirroring to exfiltrate data by duplicating and forwarding network traffic to an external
  destination. If confirmed malicious, this could allow attackers to capture sensitive information, monitor network communications, and potentially compromise the integrity and confidentiality of the network.
tags:
- attack.t1020.001
- attack.t1200
- attack.t1498
date: '2020-10-28'
original_spl: |-
  `cisco_networks` (facility="MIRROR" mnemonic="ETH_SPAN_SESSION_UP") OR (facility="SPAN" mnemonic="SESSION_UP") OR (facility="SPAN" mnemonic="PKTCAP_START") OR (mnemonic="CFGLOG_LOGGEDCMD" command="monitor session*")
    | stats min(_time) AS firstTime max(_time) AS lastTime count
      BY host facility mnemonic
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `detect_traffic_mirroring_filter`
splunk_rule_id: 42b3b753-5925-49c5-9742-36fa40a73990
splunk_rule_type: TTP
logsource:
  product: cisco
  service: ios
detection:
  selection_0:
    facility: MIRROR
    mnemonic: ETH_SPAN_SESSION_UP
  selection_1:
    facility: SPAN
    mnemonic: SESSION_UP
  selection_2:
    facility: SPAN
    mnemonic: PKTCAP_START
  selection_3:
    mnemonic: CFGLOG_LOGGEDCMD
    command|startswith: monitor session*
  condition: selection_0 and selection_1 and selection_2 and selection_3
