title: Detect Port Security Violation
id: 2de3d5b8-a4fa-45c5-8540-6d071c194d24
status: experimental
level: medium
author: Mikael Bjerkeland, Splunk
description: The following analytic detects port security violations on Cisco switches. It leverages logs from Cisco network devices, specifically looking for events with mnemonics indicating port security
  violations. This activity is significant because it indicates an unauthorized device attempting to connect to a secured port, potentially bypassing network access controls. If confirmed malicious, this
  could allow an attacker to gain unauthorized access to the network, leading to data exfiltration, network disruption, or further lateral movement within the environment.
tags:
- attack.t1200
- attack.t1498
- attack.t1557.002
date: '2020-10-28'
original_spl: |-
  `cisco_networks` (facility="PM" mnemonic="ERR_DISABLE" disable_cause="psecure-violation") OR (facility="PORT_SECURITY" mnemonic="PSECURE_VIOLATION" OR mnemonic="PSECURE_VIOLATION_VLAN")
    | eval src_interface=src_int_prefix_long+src_int_suffix
    | stats min(_time) AS firstTime max(_time) AS lastTime values(disable_cause) AS disable_cause values(src_mac) AS src_mac values(src_vlan) AS src_vlan values(action) AS action count
      BY host src_interface
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `detect_port_security_violation_filter`
splunk_rule_id: 2de3d5b8-a4fa-45c5-8540-6d071c194d24
splunk_rule_type: TTP
logsource:
  product: cisco
  service: ios
detection:
  selection_0:
    facility: PM
    mnemonic: ERR_DISABLE
    disable_cause: psecure-violation
  selection_1:
    facility: PORT_SECURITY
    mnemonic: PSECURE_VIOLATION
  selection_2:
    mnemonic: PSECURE_VIOLATION_VLAN
  condition: selection_0 and selection_1 and selection_2
