title: Detect ARP Poisoning
id: b44bebd6-bd39-467b-9321-73971bcd1aac
status: experimental
level: medium
author: Mikael Bjerkeland, Splunk
description: The following analytic detects ARP Poisoning attacks by monitoring for Dynamic ARP Inspection (DAI) errors on Cisco network devices. It leverages logs from Cisco devices, specifically looking
  for events where the ARP inspection feature has disabled an interface due to suspicious activity. This activity is significant because ARP Poisoning can allow attackers to intercept, modify, or disrupt
  network traffic, leading to potential data breaches or denial of service. If confirmed malicious, this could enable attackers to perform man-in-the-middle attacks, compromising the integrity and confidentiality
  of network communications.
tags:
- attack.T1200
- attack.T1498
- attack.T1557_002
date: '2020-08-11'
logsource:
  product: cisco
  service: ios
detection:
  selection_0:
    facility: PM
  selection_1:
    mnemonic: ERR_DISABLE
  selection_2:
    disable_cause: arp-inspection
  condition: selection_0 and selection_1 and selection_2
