title: Detect ARP Poisoning
id: b44bebd6-bd39-467b-9321-73971bcd1aac
status: experimental
level: medium
author: Mikael Bjerkeland, Splunk
description: The following analytic detects ARP Poisoning attacks by monitoring for Dynamic ARP Inspection (DAI) errors on Cisco network devices. It leverages logs from Cisco devices, specifically looking
  for events where the ARP inspection feature has disabled an interface due to suspicious activity. This activity is significant because ARP Poisoning can allow attackers to intercept, modify, or disrupt
  network traffic, leading to potential data breaches or denial of service. If confirmed malicious, this could enable attackers to perform man-in-the-middle attacks, compromising the integrity and confidentiality
  of network communications.
tags:
- attack.t1200
- attack.t1498
- attack.t1557.002
date: '2020-08-11'
original_spl: |-
  `cisco_networks` facility="PM" mnemonic="ERR_DISABLE" disable_cause="arp-inspection"
    | eval src_interface=src_int_prefix_long+src_int_suffix
    | stats min(_time) AS firstTime max(_time) AS lastTime count
      BY host src_interface
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `detect_arp_poisoning_filter`
splunk_rule_id: b44bebd6-bd39-467b-9321-73971bcd1aac
splunk_rule_type: TTP
logsource:
  product: cisco
  service: ios
detection:
  selection_0:
    facility: PM
  selection_1:
    mnemonic: ERR_DISABLE
  selection_2:
    disable_cause: arp-inspection
  condition: selection_0 and selection_1 and selection_2
