title: Java Writing JSP File
id: eb65619c-4f8d-4383-a975-d352765d344b
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the Java process writing a .jsp file to disk, which may indicate a web shell being deployed. It leverages data from the Endpoint datamodel, specifically monitoring
  process and filesystem activities. This activity is significant because web shells can provide attackers with remote control over the compromised server, leading to further exploitation. If confirmed
  malicious, this could allow unauthorized access, data exfiltration, or further compromise of the affected system, posing a severe security risk.
references:
- https://www.microsoft.com/security/blog/2022/04/04/springshell-rce-vulnerability-guidance-for-protecting-against-and-detecting-cve-2022-22965/
- https://github.com/TheGejr/SpringShell
- https://www.tenable.com/blog/spring4shell-faq-spring-framework-remote-code-execution-vulnerability
tags:
- attack.t1190
- attack.t1133
date: '2022-04-05'
original_spl: |-
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Processes
    WHERE Processes.process_name IN ("java","java.exe", "javaw.exe")
    BY _time Processes.action Processes.dest
       Processes.original_file_name Processes.parent_process Processes.parent_process_exec
       Processes.parent_process_guid Processes.parent_process_id Processes.parent_process_name
       Processes.parent_process_path Processes.process Processes.process_exec
       Processes.process_guid Processes.process_hash Processes.process_id
       Processes.process_integrity_level Processes.process_name Processes.process_path
       Processes.user Processes.user_id Processes.vendor_product
  | `drop_dm_object_name(Processes)`
  | join process_guid [
  | tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Filesystem
    WHERE Filesystem.file_name="*.jsp*"
    BY _time Filesystem.action Filesystem.dest
       Filesystem.file_access_time Filesystem.file_create_time Filesystem.file_hash
       Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path
       Filesystem.file_acl Filesystem.file_size Filesystem.process_guid
       Filesystem.process_id Filesystem.user Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | fields _time process_guid file_path file_name file_create_time user dest process_name]
  | stats count min(_time) as firstTime max(_time) as lastTime
    BY dest process_name process_guid
       file_name file_path file_create_time
       user
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `java_writing_jsp_file_filter`
splunk_rule_id: eb65619c-4f8d-4383-a975-d352765d344b
splunk_rule_type: TTP
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    Image:
    - java
    - java.exe
    - javaw.exe
  condition: selection_0
