title: Linux Sudoers Tmp File Creation
id: be254a5c-63e7-11ec-89da-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of the "sudoers.tmp" file, which occurs when editing the /etc/sudoers file using visudo or another editor on a Linux platform. This detection leverages
  filesystem data to identify the presence of "sudoers.tmp" files. Monitoring this activity is crucial as adversaries may exploit it to gain elevated privileges on a compromised host. If confirmed malicious,
  this activity could allow attackers to modify sudoers configurations, potentially granting them unauthorized access to execute commands as other users, including root, thereby compromising the system's
  security.
references:
- https://forum.ubuntuusers.de/topic/sudo-visudo-gibt-etc-sudoers-tmp/
tags:
- attack.t1548.003
date: '2022-01-05'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
    WHERE Filesystem.file_path IN ("*sudoers.tmp*")
    BY Filesystem.action Filesystem.dest Filesystem.file_access_time
       Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
       Filesystem.file_name Filesystem.file_path Filesystem.file_acl
       Filesystem.file_size Filesystem.process_guid Filesystem.process_id
       Filesystem.user Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)`
  | `linux_sudoers_tmp_file_creation_filter`
splunk_rule_id: be254a5c-63e7-11ec-89da-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    TargetFilename|contains: sudoers.tmp
  condition: selection_0
