title: Linux Deletion of SSL Certificate
id: 839ab790-a60a-4f81-bfb3-02567063f615
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the deletion of SSL certificates on a Linux machine. It leverages filesystem event logs to identify when files with extensions .pem or .crt are deleted from the
  /etc/ssl/certs/ directory. This activity is significant because attackers may delete or modify SSL certificates to disable security features or evade defenses on a compromised system. If confirmed malicious,
  this behavior could indicate an attempt to disrupt secure communications, evade detection, or execute a destructive payload, potentially leading to significant security breaches and data loss.
references:
- https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/
tags:
- attack.T1070_004
- attack.T1485
date: '2022-04-12'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    action: deleted
  selection_1:
    TargetFilename|contains: /etc/ssl/certs/*
  selection_2:
    TargetFilename|contains:
    - '*.pem'
    - '*.crt'
  condition: selection_0 and selection_1 and selection_2
