title: Linux Deletion Of Services
id: b509bbd3-0331-4aaa-8e4a-d2affe100af6
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the deletion of services on a Linux machine. It leverages filesystem event logs to identify when service files within system directories (e.g., /etc/systemd/,
  /lib/systemd/, /run/systemd/) are deleted. This activity is significant because attackers may delete or modify services to disable security features or evade defenses. If confirmed malicious, this behavior
  could indicate an attempt to impair system functionality or execute a destructive payload, potentially leading to system instability or data loss. Immediate investigation is required to determine the
  responsible process and user.
references:
- https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/
- https://unix.stackexchange.com/questions/224992/where-do-i-put-my-systemd-unit-file
- https://cert.gov.ua/article/3718487
tags:
- attack.T1070_004
- attack.T1485
date: '2022-04-12'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    action: deleted
  selection_1:
    TargetFilename|contains:
    - /etc/systemd/*
    - '*/lib/systemd/*'
    - '*/run/systemd/*'
  selection_2:
    TargetFilename|contains: '*.service'
  condition: selection_0 and selection_1 and selection_2
