title: Linux File Creation In Profile Directory
id: 46ba0082-61af-11ec-9826-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of files in the /etc/profile.d directory on Linux systems. It leverages filesystem data to identify new files in this directory, which is often used
  by adversaries for persistence by executing scripts upon system boot. This activity is significant as it may indicate an attempt to maintain long-term access to the compromised host. If confirmed malicious,
  this could allow attackers to execute arbitrary code with elevated privileges each time the system boots, potentially leading to further compromise and data exfiltration.
references:
- https://attack.mitre.org/techniques/T1546/004/
- https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/
tags:
- attack.t1546.004
date: '2021-12-23'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
    WHERE Filesystem.file_path IN ("*/etc/profile.d/*")
    BY Filesystem.action Filesystem.dest Filesystem.file_access_time
       Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
       Filesystem.file_name Filesystem.file_path Filesystem.file_acl
       Filesystem.file_size Filesystem.process_guid Filesystem.process_id
       Filesystem.user Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)`
  | `linux_file_creation_in_profile_directory_filter`
splunk_rule_id: 46ba0082-61af-11ec-9826-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    TargetFilename|contains: /etc/profile.d/
  condition: selection_0
