title: Linux Account Manipulation Of SSH Config and Keys
id: 73a56508-1cf5-4df7-b8d9-5737fbdc27d2
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the deletion of SSH keys on a Linux machine. It leverages filesystem event logs to identify when files within "/etc/ssh/*" or "~/.ssh/*" are deleted. This activity
  is significant because attackers may delete or modify SSH keys to evade security measures or as part of a destructive payload, similar to the AcidRain malware. If confirmed malicious, this behavior could
  lead to impaired security features, hindered forensic investigations, or further unauthorized access, necessitating immediate investigation to identify the responsible process and user.
references:
- https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/
tags:
- attack.T1070_004
- attack.T1485
date: '2022-04-12'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    action: deleted
  selection_1:
    TargetFilename|contains:
    - /etc/ssh/*
    - ~/.ssh/*
  condition: selection_0 and selection_1
