title: Linux Sudoers Tmp File Creation
id: be254a5c-63e7-11ec-89da-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of the "sudoers.tmp" file, which occurs when editing the /etc/sudoers file using visudo or another editor on a Linux platform. This detection leverages
  filesystem data to identify the presence of "sudoers.tmp" files. Monitoring this activity is crucial as adversaries may exploit it to gain elevated privileges on a compromised host. If confirmed malicious,
  this activity could allow attackers to modify sudoers configurations, potentially granting them unauthorized access to execute commands as other users, including root, thereby compromising the system's
  security.
references:
- https://forum.ubuntuusers.de/topic/sudo-visudo-gibt-etc-sudoers-tmp/
tags:
- attack.T1548_003
date: '2022-01-05'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    TargetFilename|contains: '*sudoers.tmp*'
  condition: selection_0
