title: Linux Possible Ssh Key File Creation
id: c04ef40c-72da-11ec-8eac-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of SSH key files in the ~/.ssh/ directory. It leverages filesystem data to identify new files in this specific path. This activity is significant
  because threat actors often create SSH keys to gain persistent access and escalate privileges on a compromised host. If confirmed malicious, this could allow attackers to remotely access the machine using
  the OpenSSH daemon service, leading to potential unauthorized control and data exfiltration.
references:
- https://www.hackingarticles.in/ssh-penetration-testing-port-22/
- https://attack.mitre.org/techniques/T1098/004/
tags:
- attack.T1098_004
date: '2022-01-12'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    TargetFilename|contains: '*/.ssh*'
  condition: selection_0
