title: Linux Deletion Of Services
id: b509bbd3-0331-4aaa-8e4a-d2affe100af6
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the deletion of services on a Linux machine. It leverages filesystem event logs to identify when service files within system directories (e.g., /etc/systemd/,
  /lib/systemd/, /run/systemd/) are deleted. This activity is significant because attackers may delete or modify services to disable security features or evade defenses. If confirmed malicious, this behavior
  could indicate an attempt to impair system functionality or execute a destructive payload, potentially leading to system instability or data loss. Immediate investigation is required to determine the
  responsible process and user.
references:
- https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/
- https://unix.stackexchange.com/questions/224992/where-do-i-put-my-systemd-unit-file
- https://cert.gov.ua/article/3718487
tags:
- attack.t1070.004
- attack.t1485
date: '2022-04-12'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
    WHERE Filesystem.action=deleted Filesystem.file_path IN ( "/etc/systemd/*", "*/lib/systemd/*", "*/run/systemd/*") Filesystem.file_path = "*.service"
    BY Filesystem.action Filesystem.dest Filesystem.file_access_time
       Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
       Filesystem.file_name Filesystem.file_path Filesystem.file_acl
       Filesystem.file_size Filesystem.process_guid Filesystem.process_id
       Filesystem.user Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `linux_deletion_of_services_filter`
splunk_rule_id: b509bbd3-0331-4aaa-8e4a-d2affe100af6
splunk_rule_type: TTP
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    Filesystem.action: deleted
  selection_1:
    TargetFilename:
    - /etc/systemd/*
    - '*/lib/systemd/*'
    - '*/run/systemd/*'
  selection_2:
    TargetFilename|endswith: .service
  condition: selection_0 and selection_1 and selection_2
