title: Linux At Allow Config File Creation
id: 977b3082-5f3d-11ec-b954-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of the /etc/at.allow or /etc/at.deny configuration files in Linux. It leverages file creation events from the Endpoint datamodel to identify when
  these files are created. This activity is significant as these files control user permissions for the "at" scheduling application and can be abused by attackers to establish persistence. If confirmed
  malicious, this could allow unauthorized execution of malicious code, leading to potential data theft or further system compromise. Analysts should review the file path, creation time, and associated
  processes to assess the threat.
references:
- https://linuxize.com/post/at-command-in-linux/
tags:
- attack.t1053.003
date: '2021-12-21'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Filesystem
    WHERE Filesystem.file_path IN ("*/etc/at.allow", "*/etc/at.deny")
    BY Filesystem.action Filesystem.dest Filesystem.file_access_time
       Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
       Filesystem.file_name Filesystem.file_path Filesystem.file_acl
       Filesystem.file_size Filesystem.process_guid Filesystem.process_id
       Filesystem.user Filesystem.vendor_product
  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)`
  | `linux_at_allow_config_file_creation_filter`
splunk_rule_id: 977b3082-5f3d-11ec-b954-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    TargetFilename|endswith:
    - /etc/at.allow
    - /etc/at.deny
  condition: selection_0
