title: Linux File Creation In Init Boot Directory
id: 97d9cfb2-61ad-11ec-bb2d-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the creation of files in Linux init boot directories, which are used for automatic execution upon system startup.
  It leverages file system logs to identify new files in directories such as /etc/init.d/ and /etc/rc.d/. This activity is significant as it is a common persistence technique used by adversaries, malware authors, and red teamers.
  If confirmed malicious, this could allow an attacker to maintain persistence on the compromised host, potentially leading to further exploitation and unauthorized control over the system.
references:
- https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/
tags:
- attack.t1037.004
date: '2021-12-23'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime

  FROM datamodel=Endpoint.Filesystem WHERE

  Filesystem.action = "created"
  Filesystem.file_path IN (
      "*/etc/init.d/*",
      "*/etc/rc.d/*",
      "*/etc/rc.local*",
      "*/sbin/init.d/*"
  )
  BY Filesystem.action Filesystem.dest Filesystem.file_access_time
     Filesystem.file_create_time Filesystem.file_hash Filesystem.file_modify_time
     Filesystem.file_name Filesystem.file_path Filesystem.file_acl
     Filesystem.file_size Filesystem.process_guid Filesystem.process_id
     Filesystem.user Filesystem.vendor_product

  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(lastTime)`
  | `security_content_ctime(firstTime)`
  | `linux_file_creation_in_init_boot_directory_filter`
splunk_rule_id: 97d9cfb2-61ad-11ec-bb2d-acde48001122
splunk_rule_type: Anomaly
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    Filesystem.action: created
  selection_1:
    TargetFilename|contains:
    - /etc/init.d/
    - /etc/rc.d/
    - /etc/rc.local
    - /sbin/init.d/
  condition: selection_0 and selection_1
