title: Linux Service File Created In Systemd Directory
id: c7495048-61b6-11ec-9a37-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of suspicious service files within the systemd directories on Linux platforms. It leverages logs containing file name, file path, and process GUID
  data from endpoints. This activity is significant for a SOC as it may indicate an adversary attempting to establish persistence on a compromised host. If confirmed malicious, this could lead to system
  compromise or data exfiltration, allowing attackers to maintain control over the system and execute further malicious activities.
references:
- https://attack.mitre.org/techniques/T1053/006/
- https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/
- https://redcanary.com/blog/attck-t1501-understanding-systemd-service-persistence/
- https://github.com/microsoft/MSTIC-Sysmon/blob/main/linux/configs/attack-based/persistence/T1053.003_Cron_Activity.xml
tags:
- attack.T1053_006
date: '2021-12-23'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    Image|contains: '*.service'
  selection_1:
    TargetFilename|contains:
    - '*/etc/systemd/system*'
    - '*/lib/systemd/system*'
    - '*/usr/lib/systemd/system*'
    - '*/run/systemd/system*'
    - '*~/.config/systemd/*'
    - '*~/.local/share/systemd/*'
    - '*/etc/systemd/user*'
    - '*/lib/systemd/user*'
    - '*/usr/lib/systemd/user*'
    - '*/run/systemd/user*'
  condition: selection_0 and selection_1
