title: Linux Deletion Of Init Daemon Script
id: 729aab57-d26f-4156-b97f-ab8dda8f44b1
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the deletion of init daemon scripts on a Linux machine. It leverages filesystem event logs to identify when files within the /etc/init.d/ directory are deleted.
  This activity is significant because init daemon scripts control the start and stop of critical services, and their deletion can indicate an attempt to impair security features or evade defenses. If confirmed
  malicious, this behavior could allow an attacker to disrupt essential services, execute destructive payloads, or persist undetected in the environment.
references:
- https://www.sentinelone.com/labs/acidrain-a-modem-wiper-rains-down-on-europe/
tags:
- attack.T1070_004
- attack.T1485
date: '2022-04-12'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    action: deleted
  selection_1:
    TargetFilename|contains: /etc/init.d/*
  condition: selection_0 and selection_1
