title: Linux File Creation In Profile Directory
id: 46ba0082-61af-11ec-9826-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of files in the /etc/profile.d directory on Linux systems. It leverages filesystem data to identify new files in this directory, which is often used
  by adversaries for persistence by executing scripts upon system boot. This activity is significant as it may indicate an attempt to maintain long-term access to the compromised host. If confirmed malicious,
  this could allow attackers to execute arbitrary code with elevated privileges each time the system boots, potentially leading to further compromise and data exfiltration.
references:
- https://attack.mitre.org/techniques/T1546/004/
- https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/
tags:
- attack.T1546_004
date: '2021-12-23'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    TargetFilename|contains: '*/etc/profile.d/*'
  condition: selection_0
