title: Linux Doas Conf File Creation
id: f6343e86-6e09-11ec-9376-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation of the doas.conf file on a Linux host. This file is used by the doas utility to allow standard users to perform tasks as root, similar to sudo. The
  detection leverages filesystem data from the Endpoint data model, focusing on the creation of the doas.conf file. This activity is significant because it can indicate an attempt to gain elevated privileges,
  potentially by an adversary. If confirmed malicious, this could allow an attacker to execute commands with root privileges, leading to full system compromise.
references:
- https://wiki.gentoo.org/wiki/Doas
- https://www.makeuseof.com/how-to-install-and-use-doas/
tags:
- attack.T1548_003
date: '2022-01-10'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    TargetFilename|contains: '*/etc/doas.conf'
  condition: selection_0
