title: Linux File Creation In Init Boot Directory
id: 97d9cfb2-61ad-11ec-bb2d-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  The following analytic detects the creation of files in Linux init boot directories, which are used for automatic execution upon system startup.
  It leverages file system logs to identify new files in directories such as /etc/init.d/ and /etc/rc.d/. This activity is significant as it is a common persistence technique used by adversaries, malware authors, and red teamers.
  If confirmed malicious, this could allow an attacker to maintain persistence on the compromised host, potentially leading to further exploitation and unauthorized control over the system.
references:
- https://www.intezer.com/blog/research/kaiji-new-chinese-linux-malware-turning-to-golang/
tags:
- attack.T1037_004
date: '2021-12-23'
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    action: created
  selection_1:
    TargetFilename|contains:
    - '*/etc/init.d/*'
    - '*/etc/rc.d/*'
    - '*/etc/rc.local*'
    - '*/sbin/init.d/*'
  condition: selection_0 and selection_1
