title: Shai-Hulud 2 Exfiltration Artifact Files
id: 9e7d3c0f-4a5b-6c8d-1e2f-3a4b5c6d7e8f
status: stable
level: medium
author: Michael Haag, Splunk
description: |
  Detects creation of exfiltration artifact files associated with Shai-Hulud 2.0 npm supply
  chain malware. The malware creates cloud.json, contents.json, environment.json, truffleSecrets.json,
  and actionsSecrets.json files containing harvested credentials from AWS, Azure, GCP, GitHub secrets,
  and environment variables. These files are staged before being pushed to attacker-controlled repositories.
references:
- https://www.wiz.io/blog/shai-hulud-2-0-ongoing-supply-chain-attack
- https://securelist.com/shai-hulud-worm-infects-500-npm-packages-in-a-supply-chain-attack/117547/
tags:
- attack.t1074.001
- attack.t1552.001
- attack.t1195.002
date: '2025-11-25'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime

  from datamodel=Endpoint.Filesystem where

  Filesystem.file_name IN (
    "cloud.json",
    "contents.json",
    "environment.json",
    "truffleSecrets.json",
    "actionsSecrets.json"
  )

  by Filesystem.action Filesystem.dest Filesystem.file_access_time Filesystem.file_create_time
     Filesystem.file_hash Filesystem.file_modify_time Filesystem.file_name Filesystem.file_path Filesystem.file_acl Filesystem.file_size Filesystem.process_guid Filesystem.process_id Filesystem.user
     Filesystem.vendor_product

  | `drop_dm_object_name(Filesystem)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `shai_hulud_2_exfiltration_artifact_files_filter`
splunk_rule_id: 9e7d3c0f-4a5b-6c8d-1e2f-3a4b5c6d7e8f
splunk_rule_type: TTP
logsource:
  category: file_event
  product: linux
detection:
  selection_0:
    Image:
    - cloud.json
    - contents.json
    - environment.json
    - truffleSecrets.json
    - actionsSecrets.json
  condition: selection_0
