title: Windows Admon Default Group Policy Object Modified
id: 83458004-db60-4170-857d-8572f16f070b
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects modifications to the default Group Policy Objects (GPOs) in an Active Directory environment. It leverages Splunk's Admon to monitor updates to the "Default Domain
  Policy" and "Default Domain Controllers Policy." This activity is significant because changes to these default GPOs can indicate an adversary with privileged access attempting to gain further control,
  establish persistence, or deploy malware across multiple hosts. If confirmed malicious, such modifications could lead to widespread policy enforcement changes, unauthorized access, and potential compromise
  of the entire domain environment.
references:
- https://attack.mitre.org/techniques/T1484/
- https://attack.mitre.org/techniques/T1484/001
- https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
- https://adsecurity.org/?p=2716
- https://help.splunk.com/en/splunk-cloud-platform/get-started/get-data-in/9.3.2411/get-windows-data/monitor-active-directory
tags:
- attack.T1484_001
date: '2023-03-28'
logsource:
  product: windows
  service: active_directory
detection:
  selection_0:
    admonEventType: Update
  selection_1:
    objectCategory|contains: CN=Group-Policy-Container,CN=Schema,CN=Configuration,DC=*
  selection_2:
    displayName: Default Domain Policy
  selection_3:
    displayName: Default Domain Controllers Policy
  condition: selection_0 and selection_1 and selection_2 and selection_3
