title: Windows Admon Group Policy Object Created
id: 69201633-30d9-48ef-b1b6-e680805f0582
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects the creation of a new Group Policy Object (GPO) using Splunk's Admon data. It identifies events where a new GPO is created, excluding default "New Group Policy
  Object" entries. Monitoring GPO creation is crucial as adversaries can exploit GPOs to escalate privileges or deploy malware across an Active Directory network. If confirmed malicious, this activity could
  allow attackers to control system configurations, deploy ransomware, or propagate malware, significantly compromising the network's security.
references:
- https://attack.mitre.org/techniques/T1484/
- https://attack.mitre.org/techniques/T1484/001
- https://www.trustedsec.com/blog/weaponizing-group-policy-objects-access/
- https://adsecurity.org/?p=2716
- https://help.splunk.com/en/splunk-cloud-platform/get-started/get-data-in/9.3.2411/get-windows-data/monitor-active-directory
tags:
- attack.T1484_001
date: '2023-03-28'
logsource:
  product: windows
  service: active_directory
detection:
  selection_0:
    admonEventType: Update
  selection_1:
    objectCategory|contains: CN=Group-Policy-Container,CN=Schema,CN=Configuration,DC=*
  selection_2:
    versionNumber: 0
  selection_3:
    displayName!: New Group Policy Object
  condition: selection_0 and selection_1 and selection_2 and selection_3
