title: Clop Ransomware Known Service Name
id: 07e08a12-870c-11eb-b5f9-acde48001122
status: stable
level: medium
author: Teoderick Contreras
description: The following analytic identifies the creation of a service with a known name used by CLOP ransomware for persistence and high-privilege code execution. It detects this activity by monitoring
  Windows Event Logs (EventCode 7045) for specific service names ("SecurityCenterIBM", "WinCheckDRVs"). This activity is significant because the creation of such services is a common tactic used by ransomware
  to maintain control over infected systems. If confirmed malicious, this could allow attackers to execute code with elevated privileges, maintain persistence, and potentially disrupt or encrypt critical
  data.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
- attack.t1543
date: '2021-03-19'
original_spl: |-
  `wineventlog_system` EventCode=7045 ServiceName IN ("SecurityCenterIBM", "WinCheckDRVs")
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY Computer EventCode ServiceName
         StartType ServiceType
    | rename Computer as dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `clop_ransomware_known_service_name_filter`
splunk_rule_id: 07e08a12-870c-11eb-b5f9-acde48001122
splunk_rule_type: TTP
logsource:
  product: windows
  service: system
detection:
  selection_0:
    EventID: 7045
  selection_1:
    ServiceName:
    - SecurityCenterIBM
    - WinCheckDRVs
  condition: selection_0 and selection_1
