title: Windows Service Created with Suspicious Service Path
id: 429141be-8311-11eb-adb6-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Mauricio Velazco, Splunk
description: The following analytic detects the creation of a Windows Service with a binary path located in uncommon directories, using Windows Event ID 7045. It leverages logs from the `wineventlog_system`
  to identify services installed outside typical system directories. This activity is significant as adversaries, including those deploying Clop ransomware, often create malicious services for lateral movement,
  remote code execution, persistence, and execution. If confirmed malicious, this could allow attackers to maintain persistence, execute arbitrary code, and potentially escalate privileges, posing a severe
  threat to the environment.
references:
- https://www.mandiant.com/resources/fin11-email-campaigns-precursor-for-ransomware-data-theft
- https://blog.virustotal.com/2020/11/keep-your-friends-close-keep-ransomware.html
tags:
- attack.T1569_002
date: '2022-08-26'
logsource:
  product: windows
  service: system
detection:
  selection_0:
    EventID: 7045
  selection_1:
    ImagePath|contains: '*.exe'
  filter_2:
    ImagePath:
    - '*:\Windows\*'
    - '*:\Program File*'
    - '*:\Programdata\*'
    - '*%systemroot%\*'
  condition: (selection_0 and selection_1) and not (filter_2)
