title: Windows KrbRelayUp Service Creation
id: e40ef542-8241-4419-9af4-6324582ea60a
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of a service with the default name "KrbSCM" associated with the KrbRelayUp tool. It leverages Windows System Event Logs, specifically EventCode 7045,
  to identify this activity. This behavior is significant as KrbRelayUp is a known tool used for privilege escalation attacks. If confirmed malicious, this activity could allow an attacker to escalate privileges,
  potentially gaining unauthorized access to sensitive systems and data.
references:
- https://github.com/Dec0ne/KrbRelayUp
tags:
- attack.t1543.003
date: '2022-05-02'
original_spl: |-
  `wineventlog_system` EventCode=7045 ServiceName IN ("KrbSCM")
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest EventCode ImagePath
         ServiceName StartType ServiceType
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_krbrelayup_service_creation_filter`
splunk_rule_id: e40ef542-8241-4419-9af4-6324582ea60a
splunk_rule_type: TTP
logsource:
  product: windows
  service: system
detection:
  selection_0:
    EventID: 7045
  selection_1:
    ServiceName: KrbSCM
  condition: selection_0 and selection_1
