title: Windows Service Stop Win Updates
id: 0dc25c24-6fcf-456f-b08b-dd55a183e4de
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the disabling of Windows Update services, such as "Update Orchestrator Service for Windows Update," "WaaSMedicSvc," and "Windows Update." It leverages Windows
  System Event ID 7040 logs to identify changes in service start modes to 'disabled.' This activity is significant as it can indicate an adversary's attempt to evade defenses by preventing critical updates,
  leaving the system vulnerable to exploits. If confirmed malicious, this could allow attackers to maintain persistence and exploit unpatched vulnerabilities, compromising the integrity and security of
  the affected host.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.redline_stealer
tags:
- attack.T1489
date: '2023-05-02'
logsource:
  product: windows
  service: system
detection:
  selection_0:
    EventID: 7040
  selection_1:
    service_name|contains:
    - Update Orchestrator Service for Windows Update
    - WaaSMedicSvc
    - Windows Update
  selection_2:
    param1|contains:
    - UsoSvc
    - WaaSMedicSvc
    - wuauserv
  condition: selection_0 and selection_1 and selection_2
