title: Windows Service Create RemComSvc
id: 0be4b5d6-c449-4084-b945-2392b519c33b
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of the RemComSvc service on a Windows endpoint, typically indicating lateral movement using RemCom.exe. It leverages Windows EventCode 7045 from
  the System event log, specifically looking for the "RemCom Service" name. This activity is significant as it often signifies unauthorized lateral movement within the network, which is a common tactic
  used by attackers to spread malware or gain further access. If confirmed malicious, this could lead to unauthorized access to sensitive systems, data exfiltration, or further compromise of the network.
references:
- https://www.crowdstrike.com/blog/bears-midst-intrusion-democratic-national-committee/
- https://github.com/kavika13/RemCom
tags:
- attack.t1543.003
date: '2023-03-20'
original_spl: |-
  `wineventlog_system` EventCode=7045 ServiceName="RemCom Service"
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest ImagePath ServiceName
         ServiceType
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_service_create_remcomsvc_filter`
splunk_rule_id: 0be4b5d6-c449-4084-b945-2392b519c33b
splunk_rule_type: Anomaly
logsource:
  product: windows
  service: system
detection:
  selection_0:
    EventID: 7045
  selection_1:
    ServiceName: RemCom Service
  condition: selection_0 and selection_1
