title: Windows Service Create SliverC2
id: 89dad3ee-57ec-43dc-9044-131c4edd663f
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the creation of a Windows service named "Sliver" with the description "Sliver Implant," indicative of SliverC2 lateral movement using the PsExec module. It leverages
  Windows EventCode 7045 from the System Event log to identify this activity. This behavior is significant as it may indicate an adversary's attempt to establish persistence or execute commands remotely.
  If confirmed malicious, this activity could allow attackers to maintain control over the compromised system, execute arbitrary code, and further infiltrate the network.
references:
- https://github.com/BishopFox/sliver/blob/71f94928bf36c1557ea5fbeffa161b71116f56b2/client/command/exec/psexec.go#LL61C5-L61C16
- https://www.microsoft.com/en-us/security/blog/2022/08/24/looking-for-the-sliver-lining-hunting-for-emerging-command-and-control-frameworks/
- https://regex101.com/r/DWkkXm/1
tags:
- attack.t1569.002
date: '2023-03-03'
original_spl: |-
  `wineventlog_system` EventCode=7045 ServiceName="sliver"
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY Computer EventCode ImagePath
         ServiceName ServiceType
    | rename Computer as dest
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `windows_service_create_sliverc2_filter`
splunk_rule_id: 89dad3ee-57ec-43dc-9044-131c4edd663f
splunk_rule_type: TTP
logsource:
  product: windows
  service: system
detection:
  selection_0:
    EventID: 7045
  selection_1:
    ServiceName: sliver
  condition: selection_0 and selection_1
