title: Crowdstrike Admin Weak Password Policy
id: bb1481fd-23c0-4195-b6a0-94d746c9637c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects CrowdStrike alerts for admin weak password policy violations, identifying instances where administrative passwords do not meet security standards. These alerts
  highlight significant vulnerabilities that could be exploited by attackers to gain unauthorized access. Promptly addressing these alerts is crucial for maintaining robust security and protecting critical
  systems and data from potential threats.
references:
- https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
tags:
- attack.t1110
date: '2024-07-31'
original_spl: |-
  `crowdstrike_identities` primaryDisplayName = "*admin*"
    | rename riskFactors{}.severity as severity, riskFactors{}.type as risk_type, roles{}.type as role_type, accounts{}.domain as domain, accounts{}.dn as dn, accounts{}.samAccountName as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY domain dn primaryDisplayName
         risk_type severity riskScore
         riskScoreSeverity user role_type
    | where risk_type = "WEAK_PASSWORD_POLICY"
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `crowdstrike_admin_weak_password_policy_filter`
splunk_rule_id: bb1481fd-23c0-4195-b6a0-94d746c9637c
splunk_rule_type: TTP
logsource:
  product: crowdstrike
  service: crowdstrike
detection:
  selection_0:
    primaryDisplayName|contains: admin
  condition: selection_0
