title: Crowdstrike User Weak Password Policy
id: b49b6ef4-57cd-4d42-bd7e-64e00f11cc87
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects CrowdStrike alerts for weak password policy violations, identifying instances where passwords do not meet the required security standards. These alerts highlight
  potential vulnerabilities that could be exploited by attackers, emphasizing the need for stronger password practices. Addressing these alerts promptly helps to enhance overall security and protect sensitive
  information from unauthorized access.
references:
- https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
tags:
- attack.t1110
date: '2024-07-31'
original_spl: |-
  `crowdstrike_identities`  primaryDisplayName != "*admin*"
    | rename riskFactors{}.severity as severity, riskFactors{}.type as risk_type, roles{}.type as role_type, accounts{}.domain as domain, accounts{}.dn as dn, accounts{}.samAccountName as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY domain dn primaryDisplayName
         risk_type severity riskScore
         riskScoreSeverity user role_type
    | where risk_type = "WEAK_PASSWORD_POLICY"
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `crowdstrike_user_weak_password_policy_filter`
splunk_rule_id: b49b6ef4-57cd-4d42-bd7e-64e00f11cc87
splunk_rule_type: Anomaly
logsource:
  product: crowdstrike
  service: crowdstrike
detection:
  selection_0:
    primaryDisplayName|contains: admin
  condition: selection_0
