title: Crowdstrike Admin With Duplicate Password
id: b8bccfbf-6ac2-40f2-83b6-e72b7efaa7d4
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects CrowdStrike alerts for admin accounts with duplicate password risk, identifying instances where administrative users share the same password. This practice significantly
  increases the risk of unauthorized access and potential breaches. Addressing these alerts promptly is crucial for maintaining strong security protocols, ensuring each admin account uses a unique, secure
  password to protect critical systems and data.
references:
- https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
tags:
- attack.t1110
date: '2024-07-31'
original_spl: |-
  `crowdstrike_identities` primaryDisplayName = "*admin*"
    | rename riskFactors{}.severity as severity, riskFactors{}.type as risk_type, roles{}.type as role_type, accounts{}.domain as domain, accounts{}.dn as dn, accounts{}.samAccountName as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY domain dn primaryDisplayName
         risk_type severity riskScore
         riskScoreSeverity user role_type
    | where risk_type = "DUPLICATE_PASSWORD"
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `crowdstrike_admin_with_duplicate_password_filter`
splunk_rule_id: b8bccfbf-6ac2-40f2-83b6-e72b7efaa7d4
splunk_rule_type: TTP
logsource:
  product: crowdstrike
  service: crowdstrike
detection:
  selection_0:
    primaryDisplayName|contains: admin
  condition: selection_0
