title: Crowdstrike High Identity Risk Severity
id: 0df524ad-6d78-4883-9987-d29418928103
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects CrowdStrike alerts for High Identity Risk Severity with a risk score of 70 or higher. These alerts indicate significant vulnerabilities in user identities, such
  as suspicious behavior or compromised credentials. Promptly investigating and addressing these alerts is crucial to prevent potential security breaches and ensure the integrity and protection of sensitive
  information and systems.
references:
- https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
tags:
- attack.T1110
date: '2024-07-31'
logsource:
  product: crowdstrike
  service: crowdstrike
detection:
  selection_0:
    riskScoreSeverity: HIGH
  selection_1:
    riskScore: 0.7
  condition: selection_0 and selection_1
