title: Crowdstrike User Weak Password Policy
id: b49b6ef4-57cd-4d42-bd7e-64e00f11cc87
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects CrowdStrike alerts for weak password policy violations, identifying instances where passwords do not meet the required security standards. These alerts highlight
  potential vulnerabilities that could be exploited by attackers, emphasizing the need for stronger password practices. Addressing these alerts promptly helps to enhance overall security and protect sensitive
  information from unauthorized access.
references:
- https://www.crowdstrike.com/wp-content/uploads/2022/12/CrowdStrike-Falcon-Event-Streams-Add-on-Guide-v3.pdf
tags:
- attack.T1110
date: '2024-07-31'
logsource:
  product: crowdstrike
  service: crowdstrike
detection:
  selection_0:
    primaryDisplayName|contains: '*admin*'
  condition: selection_0
