title: Disabling Remote User Account Control
id: bbc644bc-37df-4e1a-9c88-ec9a53e2038c
status: stable
level: medium
author: David Dorsey, Patrick Bareiss, Splunk
description: The following analytic identifies modifications to the registry key that controls the enforcement of Windows User Account Control (UAC). It detects changes to the registry path `HKLM\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA`
  where the value is set to `0x00000000`. This activity is significant because disabling UAC can allow unauthorized changes to the system without user consent, potentially leading to privilege escalation.
  If confirmed malicious, an attacker could gain elevated privileges, making it easier to execute further attacks or maintain persistence within the environment.
tags:
- attack.T1548_002
date: '2020-04-29'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Microsoft\Windows\CurrentVersion\Policies\System\EnableLUA*'
  selection_1:
    Details: '0x00000000'
  condition: selection_0 and selection_1
