title: Disabling SystemRestore In Registry
id: f4f837e2-91fb-11eb-8bf6-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic detects the modification of registry keys to disable System Restore on a machine. It leverages data from the Endpoint.Registry data model, specifically monitoring changes
  to registry paths associated with System Restore settings. This activity is significant because disabling System Restore can hinder recovery efforts and is a tactic often used by Remote Access Trojans
  (RATs) to maintain persistence on an infected system. If confirmed malicious, this action could prevent system recovery, allowing the attacker to sustain their foothold and potentially cause further damage
  or data loss.
references:
- https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
tags:
- attack.T1490
date: '2021-03-31'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\SystemRestore\DisableSR'
  selection_1:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Windows NT\CurrentVersion\SystemRestore\DisableConfig'
  selection_2:
    TargetObject|contains: '*\SOFTWARE\Policies\Microsoft\Windows NT\SystemRestore\DisableSR'
  selection_3:
    TargetObject|contains: '*\SOFTWARE\Policies\Microsoft\Windows NT\SystemRestore\DisableConfig'
    Details: '0x00000001'
  condition: selection_0 and selection_1 and selection_2 and selection_3
