title: Disable Windows Behavior Monitoring
id: 79439cae-9200-11eb-a4d3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic identifies modifications in the registry to disable Windows Defender's real-time behavior monitoring. It leverages data from the Endpoint.Registry data model, specifically
  monitoring changes to registry paths associated with Windows Defender settings. This activity is significant because disabling real-time protection is a common tactic used by malware such as RATs, bots,
  or Trojans to evade detection. If confirmed malicious, this action could allow an attacker to execute code, escalate privileges, or persist in the environment without being detected by antivirus software.
references:
- https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
tags:
- attack.t1685
date: '2021-03-31'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry
     WHERE (
             Registry.registry_path= "*\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\Real-Time Protection\\DisableBehaviorMonitoring" OR
             Registry.registry_path= "*\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\Real-Time Protection\\DisableOnAccessProtection" OR
             Registry.registry_path= "*\\SOFTWARE\\Policies\\Microsoft\\Windows Defender\\Real-Time Protection\\DisableScanOnRealtimeEnable" OR
             Registry.registry_path= "*\\SOFTWARE\\Microsoft\\Windows Defender\\Real-Time Protection\\DisableRealtimeMonitoring" OR
             Registry.registry_path= "*\\Real-Time Protection\\DisableIntrusionPreventionSystem" OR
             Registry.registry_path= "*\\Real-Time Protection\\DisableIOAVProtection" OR
             Registry.registry_path= "*\\Real-Time Protection\\DisableScriptScanning" AND
             Registry.registry_value_data IN (1, "0x00000001")
             )
             by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
       | `drop_dm_object_name(Registry)`
       | where isnotnull(registry_value_data)
       | `security_content_ctime(firstTime)`
       | `security_content_ctime(lastTime)`
       | `disable_windows_behavior_monitoring_filter`
splunk_rule_id: 79439cae-9200-11eb-a4d3-acde48001122
splunk_rule_type: TTP
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|endswith: \SOFTWARE\Policies\Microsoft\Windows Defender\Real-Time Protection\DisableBehaviorMonitoring
  selection_1:
    TargetObject|endswith: \SOFTWARE\Policies\Microsoft\Windows Defender\Real-Time Protection\DisableOnAccessProtection
  selection_2:
    TargetObject|endswith: \SOFTWARE\Policies\Microsoft\Windows Defender\Real-Time Protection\DisableScanOnRealtimeEnable
  selection_3:
    TargetObject|endswith: \SOFTWARE\Microsoft\Windows Defender\Real-Time Protection\DisableRealtimeMonitoring
  selection_4:
    TargetObject|endswith: \Real-Time Protection\DisableIntrusionPreventionSystem
  selection_5:
    TargetObject|endswith: \Real-Time Protection\DisableIOAVProtection
  selection_6:
    TargetObject|endswith: '*\Real-Time Protection\DisableScriptScanning'
    Details:
    - 1
    - '0x00000001'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6
