title: Disable Defender AntiVirus Registry
id: aa4f695a-3024-11ec-9987-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic detects the modification of Windows Defender registry settings to disable antivirus and antispyware protections. It leverages data from the Endpoint.Registry data model,
  specifically monitoring changes to registry paths associated with Windows Defender policies. This activity is significant because disabling antivirus protections is a common tactic used by adversaries
  to evade detection and maintain persistence on compromised systems. If confirmed malicious, this action could allow attackers to execute further malicious activities undetected, leading to potential data
  breaches, system compromise, and further propagation of malware within the network.
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
- attack.T1685
date: '2021-10-18'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Policies\Microsoft\Windows Defender*'
  selection_1:
    Details|contains:
    - DisableAntiSpyware
    - DisableAntiVirus
  condition: selection_0 and selection_1
