title: Disable Windows App Hotkeys
id: 1490f224-ad8b-11eb-8c4f-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic detects a suspicious registry modification aimed at disabling Windows hotkeys for native applications. It leverages data from the Endpoint.Registry data model, focusing
  on specific registry paths and values indicative of this behavior. This activity is significant as it can impair an analyst's ability to use essential tools like Task Manager and Command Prompt, hindering
  incident response efforts. If confirmed malicious, this technique can allow an attacker to maintain persistence and evade detection, complicating the remediation process.
references:
- https://thedfirreport.com/2020/04/20/sqlserver-or-the-miner-in-the-basement/
tags:
- attack.T1112
- attack.T1685
date: '2021-05-07'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Windows NT\CurrentVersion\Image File Execution Options\*'
  selection_1:
    Details: HotKey Disabled
  selection_2:
    Details: Debugger
  condition: selection_0 and selection_1 and selection_2
