title: Disabling Windows Local Security Authority Defences via Registry
id: 45cd08f8-a2c9-4f4e-baab-e1a0c624b0ab
status: stable
level: medium
author: Dean Luxton,Teoderick Contreras Splunk
description: The following analytic identifies the deletion of registry keys that disable Local Security Authority (LSA) protection and Microsoft Defender Device Guard. It leverages data from Endpoint Detection
  and Response (EDR) agents, focusing on registry actions and paths associated with LSA and Device Guard settings. This activity is significant because disabling these defenses can leave a system vulnerable
  to various attacks, including credential theft and unauthorized code execution. If confirmed malicious, this action could allow attackers to bypass critical security mechanisms, leading to potential system
  compromise and persistent access.
references:
- https://docs.microsoft.com/en-us/windows-server/security/credentials-protection-and-management/configuring-additional-lsa-protection
- https://docs.microsoft.com/en-us/windows/security/identity-protection/credential-guard/credential-guard-manage
tags:
- attack.T1556
date: '2022-09-08'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains:
    - '*\Lsa\LsaCfgFlags'
    - '*\Lsa\RunAsPPL'
    - '*\SOFTWARE\Policies\Microsoft\Windows\DeviceGuard\*'
  condition: selection_0
