title: Disable Defender AntiVirus Registry
id: aa4f695a-3024-11ec-9987-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic detects the modification of Windows Defender registry settings to disable antivirus and antispyware protections. It leverages data from the Endpoint.Registry data model,
  specifically monitoring changes to registry paths associated with Windows Defender policies. This activity is significant because disabling antivirus protections is a common tactic used by adversaries
  to evade detection and maintain persistence on compromised systems. If confirmed malicious, this action could allow attackers to execute further malicious activities undetected, leading to potential data
  breaches, system compromise, and further propagation of malware within the network.
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
- attack.t1685
date: '2021-10-18'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry
  WHERE (
          Registry.registry_path = "*\\Policies\\Microsoft\\Windows Defender*" AND
          Registry.registry_value_name IN ("DisableAntiSpyware","DisableAntiVirus") AND
          Registry.registry_value_data IN (1, 0x00000001)
        )
          by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
          | `drop_dm_object_name(Registry)`
          | where isnotnull(registry_value_data)
          | `security_content_ctime(firstTime)`
          | `security_content_ctime(lastTime)`
          | `disable_defender_antivirus_registry_filter`
splunk_rule_id: aa4f695a-3024-11ec-9987-acde48001122
splunk_rule_type: TTP
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: \Policies\Microsoft\Windows Defender
  selection_1:
    Details:
    - DisableAntiSpyware
    - DisableAntiVirus
  selection_2:
    Details:
    - 1
    - '0x00000001'
  condition: selection_0 and selection_1 and selection_2
