title: Disable Defender Submit Samples Consent Feature
id: 73922ff8-3022-11ec-bf5e-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic detects the modification of the Windows registry to disable the Windows Defender Submit Samples Consent feature. It leverages data from the Endpoint.Registry data model,
  specifically monitoring changes to the registry path associated with Windows Defender SpyNet and the SubmitSamplesConsent value set to 0x00000000. This activity is significant as it indicates an attempt
  to bypass or evade detection by preventing Windows Defender from submitting samples for further analysis. If confirmed malicious, this could allow an attacker to execute malicious code without being detected
  by Windows Defender, leading to potential system compromise.
references:
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
tags:
- attack.t1685
date: '2021-10-18'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry
    WHERE (
            Registry.registry_path = "*\\Microsoft\\Windows Defender\\SpyNet*" AND
            Registry.registry_value_name = SubmitSamplesConsent AND
            Registry.registry_value_data IN (0, 0x00000000)
           )
            by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
       | `drop_dm_object_name(Registry)`
       | where isnotnull(registry_value_data)
       | `security_content_ctime(firstTime)`
       | `security_content_ctime(lastTime)`
       | `disable_defender_submit_samples_consent_feature_filter`
splunk_rule_id: 73922ff8-3022-11ec-bf5e-acde48001122
splunk_rule_type: TTP
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: \Microsoft\Windows Defender\SpyNet
  selection_1:
    Details: SubmitSamplesConsent
  selection_2:
    Details: '0x00000000'
  condition: selection_0 and selection_1 and selection_2
