title: Disable Windows SmartScreen Protection
id: 664f0fd0-91ff-11eb-a56f-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic detects modifications to the Windows registry that disable SmartScreen protection. It leverages data from the Endpoint.Registry data model, specifically monitoring changes
  to registry paths associated with SmartScreen settings. This activity is significant because SmartScreen provides an early warning system against phishing and malware. Disabling it can indicate malicious
  intent, often seen in Remote Access Trojans (RATs) to evade detection while downloading additional payloads. If confirmed malicious, this action could allow attackers to bypass security measures, increasing
  the risk of successful phishing attacks and malware infections.
references:
- https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
tags:
- attack.t1685
date: '2021-03-31'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry
     WHERE (
            Registry.registry_path IN ("*\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\SmartScreenEnabled", "*\\Microsoft\\Windows\\System\\EnableSmartScreen")
            Registry.registry_value_data  IN ("Off", "0", 0x00000000))
            by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
       | `drop_dm_object_name(Registry)`
       | `security_content_ctime(firstTime)`
       | `security_content_ctime(lastTime)`
       | `disable_windows_smartscreen_protection_filter`
splunk_rule_id: 664f0fd0-91ff-11eb-a56f-acde48001122
splunk_rule_type: TTP
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|endswith:
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\SmartScreenEnabled
    - \Microsoft\Windows\System\EnableSmartScreen
  selection_1:
    Details:
    - 'Off'
    - '0'
    - '0x00000000'
  condition: selection_0 and selection_1
