title: Monitor Registry Keys for Print Monitors
id: f5f6af30-7ba7-4295-bfe9-07de87c01bbc
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick, Bhavin Patel
description: The following analytic detects modifications to the registry key `HKLM\SYSTEM\CurrentControlSet\Control\Print\Monitors`. It leverages data from the Endpoint.Registry data model, focusing on
  events where the registry path is modified. This activity is significant because attackers can exploit this registry key to load arbitrary .dll files, which will execute with elevated SYSTEM permissions
  and persist after a reboot. If confirmed malicious, this could allow attackers to maintain persistence, execute code with high privileges, and potentially compromise the entire system.
tags:
- attack.T1547_010
date: '2020-04-29'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    action: modified
  selection_1:
    TargetObject|contains: '*CurrentControlSet\Control\Print\Monitors*'
  condition: selection_0 and selection_1
