title: NET Profiler UAC bypass
id: 0252ca80-e30d-11eb-8aa3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects modifications to the registry aimed at bypassing the User Account Control (UAC) feature in Windows. It identifies changes to the .NET COR_PROFILER_PATH registry
  key, which can be exploited to load a malicious DLL via mmc.exe. This detection leverages data from the Endpoint.Registry datamodel, focusing on specific registry paths and values. Monitoring this activity
  is crucial as it can indicate an attempt to escalate privileges or persist within the environment. If confirmed malicious, this could allow an attacker to execute arbitrary code with elevated privileges,
  compromising system integrity.
references:
- https://offsec.almond.consulting/UAC-bypass-dotnet.html
tags:
- attack.T1548_002
date: '2021-07-08'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Environment\COR_PROFILER_PATH'
  selection_1:
    Details|contains: '*.dll'
  condition: selection_0 and selection_1
