title: NET Profiler UAC bypass
id: 0252ca80-e30d-11eb-8aa3-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects modifications to the registry aimed at bypassing the User Account Control (UAC) feature in Windows. It identifies changes to the .NET COR_PROFILER_PATH registry
  key, which can be exploited to load a malicious DLL via mmc.exe. This detection leverages data from the Endpoint.Registry datamodel, focusing on specific registry paths and values. Monitoring this activity
  is crucial as it can indicate an attempt to escalate privileges or persist within the environment. If confirmed malicious, this could allow an attacker to execute arbitrary code with elevated privileges,
  compromising system integrity.
references:
- https://offsec.almond.consulting/UAC-bypass-dotnet.html
tags:
- attack.t1548.002
date: '2021-07-08'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime from datamodel=Endpoint.Registry where Registry.registry_path= "*\\Environment\\COR_PROFILER_PATH"
  Registry.registry_value_data = "*.dll" by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data
  Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `net_profiler_uac_bypass_filter`'
splunk_rule_id: 0252ca80-e30d-11eb-8aa3-acde48001122
splunk_rule_type: TTP
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|endswith: \Environment\COR_PROFILER_PATH
  selection_1:
    Details|endswith: .dll
  condition: selection_0 and selection_1
