title: Registry Keys for Creating SHIM Databases
id: f5f6af30-7aa7-4295-bfe9-07fe87c01bbb
status: stable
level: medium
author: Patrick Bareiss, Teoderick Contreras, Splunk, Steven Dick, Bhavin Patel
description: The following analytic detects registry activity related to the creation of application compatibility shims. It leverages data from the Endpoint.Registry data model, specifically monitoring
  registry paths associated with AppCompatFlags. This activity is significant because attackers can use shims to bypass security controls, achieve persistence, or escalate privileges. If confirmed malicious,
  this could allow an attacker to maintain long-term access, execute arbitrary code, or manipulate application behavior, posing a severe risk to the integrity and security of the affected systems.
tags:
- attack.T1546_011
date: '2020-04-29'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*CurrentVersion\AppCompatFlags\Custom*'
  selection_1:
    TargetObject|contains: '*CurrentVersion\AppCompatFlags\InstalledSDB*'
  condition: selection_0 and selection_1
