title: Registry Keys Used For Persistence
id: f5f6af30-7aa7-4295-bfe9-07fe87c01a4b
status: stable
level: medium
author: Jose Hernandez, David Dorsey, Teoderick Contreras, Rod Soto, Splunk
description: The following analytic identifies modifications to registry keys commonly used for persistence mechanisms. It leverages data from endpoint detection sources like Sysmon or Carbon Black, focusing
  on specific registry paths known to initiate applications or services during system startup. This activity is significant as unauthorized changes to these keys can indicate attempts to maintain persistence
  or execute malicious actions upon system boot. If confirmed malicious, this could allow attackers to achieve persistent access, execute arbitrary code, or maintain control over compromised systems, posing
  a severe threat to system integrity and security.
tags:
- attack.T1547_001
date: '2020-04-29'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce'
  selection_1:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\StartupApproved\Run'
  selection_2:
    TargetObject|contains: '*\Software\Microsoft\Windows\CurrentVersion\Explorer\User Shell Folders\*'
  selection_3:
    TargetObject|contains: '*\Software\Microsoft\Windows\CurrentVersion\Explorer\Shell Folders\*'
  selection_4:
    TargetObject|contains: '*\currentversion\run*'
  selection_5:
    TargetObject|contains: '*\currentVersion\Windows\Appinit_Dlls*'
  selection_6:
    TargetObject|contains: '*\CurrentVersion\Winlogon\Shell*'
  selection_7:
    TargetObject|contains: '*\CurrentVersion\Winlogon\Notify*'
  selection_8:
    TargetObject|contains: '*\CurrentVersion\Winlogon\Userinit*'
  selection_9:
    TargetObject|contains: '*\CurrentVersion\Winlogon\VmApplet*'
  selection_10:
    TargetObject|contains: '*\currentversion\policies\explorer\run*'
  selection_11:
    TargetObject|contains: '*\currentversion\runservices*'
  selection_12:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Netsh\*'
  selection_13:
    TargetObject|contains: '*\Software\Microsoft\Windows\CurrentVersion\Explorer\Shell Folders\Common Startup'
  selection_14:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\SharedTaskScheduler'
  selection_15:
    TargetObject|contains: '*\Classes\htmlfile\shell\open\command'
  selection_16:
    TargetObject|contains: '*Microsoft\Windows NT\CurrentVersion\Image File Execution Options*'
    TargetObject: Debugger
  selection_17:
    TargetObject|contains: '*\CurrentControlSet\Control\Lsa'
    TargetObject: Security Packages
  selection_18:
    TargetObject|contains: '*\CurrentControlSet\Control\Lsa\OSConfig'
    TargetObject: Security Packages
  selection_19:
    TargetObject|contains: '*\Microsoft\Windows NT\CurrentVersion\SilentProcessExit\*'
  selection_20:
    TargetObject|contains: '*currentVersion\Windows'
    TargetObject: Load
  selection_21:
    TargetObject|contains: '*\CurrentVersion'
    TargetObject: Svchost
  selection_22:
    TargetObject|contains: '*\CurrentControlSet\Control\Session Manager'
    TargetObject: BootExecute
  selection_23:
    TargetObject|contains: '*\Software\Run'
    TargetObject: auto_update
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4 and selection_5 and selection_6 and selection_7 and selection_8 and selection_9 and selection_10 and selection_11
    and selection_12 and selection_13 and selection_14 and selection_15 and selection_16 and selection_17 and selection_18 and selection_19 and selection_20 and selection_21 and selection_22 and selection_23
