title: Remcos client registry install entry
id: f2a1615a-1d63-11ec-97d2-acde48001122
status: stable
level: medium
author: Steven Dick, Bhavin Patel, Rod Soto, Teoderick Contreras, Splunk
description: The following analytic detects the presence of a registry key associated with the Remcos RAT agent on a host. It leverages data from the Endpoint.Processes and Endpoint.Registry data models
  in Splunk, focusing on instances where the "license" key is found in the "Software\Remcos" path. This behavior is significant as it indicates potential compromise by the Remcos RAT, a remote access Trojan
  used for unauthorized access and data exfiltration. If confirmed malicious, the attacker could gain control over the system, steal sensitive information, or use the compromised host for further attacks.
  Immediate investigation and remediation are required.
references:
- https://attack.mitre.org/software/S0332/
tags:
- attack.t1112
date: '2021-09-27'
original_spl: '| tstats `security_content_summariesonly` count FROM datamodel=Endpoint.Registry WHERE (Registry.registry_path=*\\Software\\Remcos*) by Registry.action Registry.dest Registry.process_guid
  Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user
  Registry.vendor_product | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` |`remcos_client_registry_install_entry_filter`'
splunk_rule_id: f2a1615a-1d63-11ec-97d2-acde48001122
splunk_rule_type: TTP
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: \Software\Remcos
  condition: selection_0
