title: Set Default PowerShell Execution Policy To Unrestricted or Bypass
id: c2590137-0b08-4985-9ec5-6ae23d92f63d
status: stable
level: medium
author: Steven Dick, Patrick Bareiss, Splunk
description: The following analytic detects changes to the PowerShell ExecutionPolicy in the registry to "Unrestricted" or "Bypass." It leverages data from Endpoint Detection and Response (EDR) agents,
  focusing on registry modifications under the path *Software\Microsoft\Powershell\1\ShellIds\Microsoft.PowerShell*. This activity is significant because setting the ExecutionPolicy to these values can
  allow the execution of potentially malicious scripts without restriction. If confirmed malicious, this could enable an attacker to execute arbitrary code, leading to further compromise of the system and
  potential escalation of privileges.
tags:
- attack.T1059_001
date: '2019-10-16'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*Software\Microsoft\Powershell\1\ShellIds\Microsoft.PowerShell*'
  selection_1:
    Details: ExecutionPolicy
  selection_2:
    Details: Unrestricted
  selection_3:
    Details: Bypass
  condition: selection_0 and selection_1 and selection_2 and selection_3
