title: SilentCleanup UAC Bypass
id: 56d7cfcc-da63-11eb-92d4-acde48001122
status: stable
level: medium
author: Steven Dick, Teoderick Contreras, Splunk
description: The following analytic detects suspicious modifications to the registry that may indicate a UAC (User Account Control) bypass attempt via the SilentCleanup task. It leverages data from Endpoint
  Detection and Response (EDR) agents, focusing on registry changes in the path "*\\Environment\\windir" with executable values. This activity is significant as it can allow an attacker to gain high-privilege
  execution without user consent, bypassing UAC protections. If confirmed malicious, this could lead to unauthorized administrative access, enabling further system compromise and persistence.
references:
- https://github.com/hfiref0x/UACME
- https://www.intezer.com/blog/malware-analysis/klingon-rat-holding-on-for-dear-life/
tags:
- attack.T1548_002
date: '2021-07-08'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Environment\windir'
  selection_1:
    Details|contains: '*.exe*'
  condition: selection_0 and selection_1
