title: Windows Registry SIP Provider Modification
id: 3b4e18cb-497f-4073-85ad-1ada7c2107ab
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects modifications to the Windows Registry SIP Provider. It leverages Sysmon EventID 7 to monitor registry changes in paths and values related to Cryptography Providers
  and OID Encoding Types. This activity is significant as it may indicate an attempt to subvert trust controls, a common tactic for bypassing security measures and maintaining persistence. If confirmed
  malicious, an attacker could manipulate the system's cryptographic functions, potentially leading to unauthorized access, data theft, or other damaging outcomes. Review the modified registry paths and
  concurrent processes to identify the attack source.
references:
- https://attack.mitre.org/techniques/T1553/003/
- https://github.com/SigmaHQ/sigma/blob/master/rules/windows/registry/registry_set/registry_set_sip_persistence.yml
- https://specterops.io/wp-content/uploads/sites/3/2022/06/SpecterOps_Subverting_Trust_in_Windows.pdf
- https://github.com/gtworek/PSBits/tree/master/SIP
- https://github.com/mattifestation/PoCSubjectInterfacePackage
- https://pentestlab.blog/2017/11/06/hijacking-digital-signatures/
tags:
- attack.T1553_003
date: '2023-10-10'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains:
    - '*\SOFTWARE\Microsoft\Cryptography\Providers\*'
    - '*\SOFTWARE\Microsoft\Cryptography\OID\EncodingType*'
    - '*\SOFTWARE\WOW6432Node\Microsoft\Cryptography\Providers\*'
    - '*\SOFTWARE\WOW6432Node\Microsoft\Cryptography\OID\EncodingType*'
  selection_1:
    Details|contains:
    - Dll
    - $DLL
  condition: selection_0 and selection_1
