title: Windows WPDBusEnum Registry Key Modification
id: 52b48e8b-eb6e-48b0-b8f1-73273f6b134e
status: stable
level: medium
author: Steven Dick
description: This analytic is used to identify when a USB removable media device is attached to a Windows host. In this scenario we are querying the Endpoint Registry data model to look for modifications
  to the Windows Portable Device keys HKLM\SOFTWARE\Microsoft\Windows Portable Devices\Devices\ or HKLM\System\CurrentControlSet\Enum\SWD\WPDBUSENUM\ . Adversaries and Insider Threats may use removable
  media devices for several malicious activities, including initial access, execution, and exfiltration.
references:
- https://attack.mitre.org/techniques/T1200/
- https://www.cisa.gov/news-events/news/using-caution-usb-drives
- https://www.bleepingcomputer.com/news/security/fbi-hackers-use-badusb-to-target-defense-firms-with-ransomware/
tags:
- attack.t1200
- attack.t1025
- attack.t1091
date: '2025-01-17'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime, max(_time) as lastTime, count FROM datamodel=Endpoint.Registry
    WHERE Registry.registry_path IN ("HKLM\\SOFTWARE\\Microsoft\\Windows Portable Devices\\Devices\\*","HKLM\\System\\CurrentControlSet\\Enum\\SWD\\WPDBUSENUM\\*")
      AND
      Registry.registry_value_name ="FriendlyName"
      AND
      Registry.registry_path="*USBSTOR*"
    BY Registry.action Registry.dest Registry.process_guid
       Registry.process_id Registry.registry_hive Registry.registry_path
       Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
       Registry.registry_value_type Registry.status Registry.user
       Registry.vendor_product
  | `drop_dm_object_name(Registry)`
  | eval object_handle = registry_value_data, object_name = replace(mvindex(split(mvindex(split(registry_path, "??"),1),"&"),2),"PROD_","")
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_wpdbusenum_registry_key_modification_filter`
splunk_rule_id: 52b48e8b-eb6e-48b0-b8f1-73273f6b134e
splunk_rule_type: Anomaly
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|startswith:
    - HKLM\SOFTWARE\Microsoft\Windows Portable Devices\Devices\
    - HKLM\System\CurrentControlSet\Enum\SWD\WPDBUSENUM\
  selection_1:
    Details: FriendlyName
  selection_2:
    TargetObject|contains: USBSTOR
  condition: selection_0 and selection_1 and selection_2
