title: Windows Registry BootExecute Modification
id: eabbac3a-45aa-4659-920f-6b8cff383fb8
status: stable
level: medium
author: Michael Haag, Teoderick Contreras, Splunk
description: The following analytic detects modifications to the BootExecute registry key, which manages applications and services executed during system boot. It leverages data from the Endpoint.Registry
  data model, focusing on changes to the registry path "HKLM\\System\\CurrentControlSet\\Control\\Session Manager\\BootExecute". This activity is significant because unauthorized changes to this key can
  indicate attempts to achieve persistence, load malicious code, or tamper with the boot process. If confirmed malicious, this could allow an attacker to maintain persistence, execute arbitrary code at
  boot, or disrupt system operations.
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
tags:
- attack.T1542
- attack.T1547_001
date: '2023-05-11'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\System\CurrentControlSet\Control\Session Manager\BootExecute'
  condition: selection_0
