title: Windows Outlook WebView Registry Modification
id: 6e1ad5d4-d9af-496a-96ec-f31c11cd09f2
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies modifications to specific Outlook registry values related to WebView and Today features. It detects when a URL is set in these registry locations, which could
  indicate attempts to manipulate Outlook's web-based components. The analytic focuses on changes to the "URL" value within Outlook's WebView and Today registry paths. This activity is significant as it
  may represent an attacker's effort to redirect Outlook's web content or inject malicious URLs. If successful, this technique could lead to phishing attempts, data theft, or serve as a stepping stone for
  further compromise of the user's email client and potentially sensitive information.
references:
- https://gist.github.com/MHaggis/c6318acde2e2f691b550e3a491f49ff1
- https://github.com/trustedsec/specula/wiki
tags:
- attack.t1112
date: '2024-07-30'
original_spl: '| tstats `security_content_summariesonly` count values(Registry.registry_value_name) as registry_value_name values(Registry.registry_value_data) as registry_value_data min(_time) as firstTime
  max(_time) as lastTime from datamodel=Endpoint.Registry where (Registry.registry_path="*\\Software\\Microsoft\\Office\\*\\Outlook\\WebView\\*" OR Registry.registry_path="*\\Software\\Microsoft\\Office\\*\\Outlook\\Today")
  AND Registry.registry_value_name="URL" by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data
  Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user Registry.vendor_product | `security_content_ctime(lastTime)` | `security_content_ctime(firstTime)` | `drop_dm_object_name(Registry)`
  | `windows_outlook_webview_registry_modification_filter`'
splunk_rule_id: 6e1ad5d4-d9af-496a-96ec-f31c11cd09f2
splunk_rule_type: Anomaly
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: \Software\Microsoft\Office\*\Outlook\WebView\
  selection_1:
    TargetObject|endswith: \Software\Microsoft\Office\*\Outlook\Today
  selection_2:
    Details: URL
  condition: selection_0 and selection_1 and selection_2
