title: Windows Disable Notification Center
id: 1cd983c8-8fd6-11ec-a09d-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Splunk, Steven Dick
description: The following analytic detects the modification of the Windows registry to disable the Notification Center on a host machine. It leverages data from the Endpoint.Registry data model, specifically
  looking for changes to the "DisableNotificationCenter" registry value set to "0x00000001." This activity is significant because disabling the Notification Center can be a tactic used by RAT malware to
  hide its presence and subsequent actions. If confirmed malicious, this could allow an attacker to operate stealthily, potentially leading to further system compromise and data exfiltration.
references:
- https://tccontre.blogspot.com/2020/01/remcos-rat-evading-windows-defender-av.html
tags:
- attack.T1112
date: '2021-03-31'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    Details: DisableNotificationCenter
  selection_1:
    Details: '0x00000001'
  condition: selection_0 and selection_1
