title: Windows DisableAntiSpyware Registry
id: 23150a40-9301-4195-b802-5bb4f43067fb
status: stable
level: medium
author: Rod Soto, Jose Hernandez, Michael Haag, Splunk
description: The following analytic detects the modification of the Windows Registry key "DisableAntiSpyware" being set to disable. This detection leverages data from the Endpoint.Registry datamodel, specifically
  looking for the registry value name "DisableAntiSpyware" with a value of "0x00000001". This activity is significant as it is commonly associated with Ryuk ransomware infections, indicating potential malicious
  intent to disable Windows Defender. If confirmed malicious, this action could allow attackers to disable critical security defenses, facilitating further malicious activities such as data encryption,
  exfiltration, or additional system compromise.
references:
- https://blog.malwarebytes.com/malwarebytes-news/2021/02/lazyscripter-from-empire-to-double-rat/
tags:
- attack.T1685
date: '2020-11-06'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    Details: DisableAntiSpyware
  selection_1:
    Details: '0x00000001'
  condition: selection_0 and selection_1
