title: Windows Compatibility Telemetry Tampering Through Registry
id: 43834687-cc48-4878-a2fa-f76e4271791f
status: stable
level: medium
author: Steven Dick
description: This detection identifies suspicious modifications to the Windows Compatibility Telemetry registry settings, specifically within the "TelemetryController" registry key and "Command" registry
  value. It leverages data from the Endpoint.Registry data model, focusing on registry paths and values indicative of such changes. This activity is significant because CompatTelRunner.exe and the "Microsoft
  Compatibility Appraiser" task always run as System and can be used to elevate privileges or establish a highly privileged persistence mechanism. If confirmed malicious, this could enable unauthorized
  code execution, privilege escalation, or persistent access to the compromised system.
references:
- https://attack.mitre.org/techniques/T1546/
- https://scythe.io/threat-thursday/windows-telemetry-persistence
- https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence
tags:
- attack.t1546
- attack.t1053.005
date: '2025-02-13'
original_spl: |-
  | tstats `security_content_summariesonly` min(_time) as firstTime, max(_time) as lastTime, count FROM datamodel=Endpoint.Registry
    WHERE (
          Registry.registry_path = "*\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\AppCompatFlags\\TelemetryController*"
          AND
          Registry.registry_value_name="Command" NOT Registry.registry_value_data IN ("(empty)")
      )
    BY Registry.action Registry.dest Registry.process_guid
       Registry.process_id Registry.registry_hive Registry.registry_path
       Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name
       Registry.registry_value_type Registry.status Registry.user
       Registry.vendor_product
  | `drop_dm_object_name(Registry)`
  | eval process = registry_value_data
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `windows_compatibility_telemetry_tampering_through_registry_filter`
splunk_rule_id: 43834687-cc48-4878-a2fa-f76e4271791f
splunk_rule_type: TTP
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\TelemetryController
  selection_1:
    Details: Command
  filter_2:
    Details: (empty)
  condition: (selection_0 and selection_1) and not (filter_2)
