title: Windows WPDBusEnum Registry Key Modification
id: 52b48e8b-eb6e-48b0-b8f1-73273f6b134e
status: stable
level: medium
author: Steven Dick
description: This analytic is used to identify when a USB removable media device is attached to a Windows host. In this scenario we are querying the Endpoint Registry data model to look for modifications
  to the Windows Portable Device keys HKLM\SOFTWARE\Microsoft\Windows Portable Devices\Devices\ or HKLM\System\CurrentControlSet\Enum\SWD\WPDBUSENUM\ . Adversaries and Insider Threats may use removable
  media devices for several malicious activities, including initial access, execution, and exfiltration.
references:
- https://attack.mitre.org/techniques/T1200/
- https://www.cisa.gov/news-events/news/using-caution-usb-drives
- https://www.bleepingcomputer.com/news/security/fbi-hackers-use-badusb-to-target-defense-firms-with-ransomware/
tags:
- attack.T1200
- attack.T1025
- attack.T1091
date: '2025-01-17'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains:
    - HKLM\SOFTWARE\Microsoft\Windows Portable Devices\Devices\*
    - HKLM\System\CurrentControlSet\Enum\SWD\WPDBUSENUM\*
  selection_1:
    Details: FriendlyName
  selection_2:
    TargetObject|contains: '*USBSTOR*'
  condition: selection_0 and selection_1 and selection_2
