title: Windows Modify Registry Configure BitLocker
id: bd1c770f-1b55-411e-b49e-20d07bcac5f8
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: This analytic is developed to detect suspicious registry modifications targeting BitLocker settings. The malware ShrinkLocker alters various registry keys to change how BitLocker handles encryption,
  potentially bypassing TPM requirements, enabling BitLocker without TPM, and enforcing specific startup key and PIN configurations. Such modifications can weaken system security, making it easier for unauthorized
  access and data breaches. Detecting these changes is crucial for maintaining robust encryption and data protection.
references:
- https://www.bleepingcomputer.com/news/security/new-shrinklocker-ransomware-uses-bitlocker-to-encrypt-your-files/
tags:
- attack.t1112
date: '2024-07-25'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry where (Registry.registry_path= "*\\Policies\\Microsoft\\FVE\\*"
  Registry.registry_value_name IN("EnableBDEWithNoTPM", "EnableNonTPM", "UseAdvancedStartup") Registry.registry_value_data = 0x00000001) OR (Registry.registry_path= "*\\Policies\\Microsoft\\FVE\\*" Registry.registry_value_name
  IN("UsePIN", "UsePartialEncryptionKey", "UseTPM", "UseTPMKey", "UseTPMKeyPIN", "UseTPMPIN") Registry.registry_value_data = 0x00000002) by Registry.action Registry.dest Registry.process_guid Registry.process_id
  Registry.registry_hive Registry.registry_path Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user Registry.vendor_product
  | `drop_dm_object_name(Registry)` | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_modify_registry_configure_bitlocker_filter`'
splunk_rule_id: bd1c770f-1b55-411e-b49e-20d07bcac5f8
splunk_rule_type: TTP
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Policies\Microsoft\FVE\*'
    Details:
    - EnableBDEWithNoTPM
    - EnableNonTPM
    - UseAdvancedStartup
    - '0x00000001'
  selection_1:
    TargetObject|contains: '*\Policies\Microsoft\FVE\*'
    Details:
    - UsePIN
    - UsePartialEncryptionKey
    - UseTPM
    - UseTPMKey
    - UseTPMKeyPIN
    - UseTPMPIN
    - '0x00000002'
  condition: selection_0 and selection_1
