title: Windows Registry Modification for Safe Mode Persistence
id: c6149154-c9d8-11eb-9da7-acde48001122
status: stable
level: medium
author: Teoderick Contreras, Michael Haag, Splunk
description: The following analytic identifies modifications to the SafeBoot registry keys, specifically within the Minimal and Network paths. This detection leverages registry activity logs from endpoint
  data sources like Sysmon or EDR tools. Monitoring these keys is crucial as adversaries can use them to persist drivers or services in Safe Mode, with Network allowing network connections. If confirmed
  malicious, this activity could enable attackers to maintain persistence even in Safe Mode, potentially bypassing certain security measures and facilitating further malicious actions.
references:
- https://malware.news/t/threat-analysis-unit-tau-threat-intelligence-notification-snatch-ransomware/36365
- https://redcanary.com/blog/tracking-driver-inventory-to-expose-rootkits/
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1112/T1112.md
- https://blog.didierstevens.com/2007/03/26/playing-with-safe-mode/
tags:
- attack.T1547_001
date: '2022-03-31'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains:
    - '*SYSTEM\CurrentControlSet\Control\SafeBoot\Minimal\*'
    - '*SYSTEM\CurrentControlSet\Control\SafeBoot\Network\*'
  condition: selection_0
