title: Windows Njrat Fileless Storage via Registry
id: a5fffbbd-271f-4980-94ed-4fbf17f0af1c
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects suspicious registry modifications indicative of NjRat's fileless storage technique. It leverages the Endpoint.Registry data model to identify specific registry
  paths and values commonly used by NjRat for keylogging and executing DLL plugins. This activity is significant as it helps evade traditional file-based detection systems, making it crucial for SOC analysts
  to monitor. If confirmed malicious, this behavior could allow attackers to persist on the host, execute arbitrary code, and capture sensitive keystrokes, leading to potential data breaches and further
  system compromise.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.njrat
tags:
- attack.T1027_011
date: '2023-04-26'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\[kl]'
  selection_1:
    Details|contains:
    - '*[ENTER]*'
    - '*[TAP]*'
    - '*[Back]*'
  condition: selection_0 and selection_1
