title: Windows Routing and Remote Access Service Registry Key Change
id: a93df51e-e612-40b7-a105-33e288160575
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: |-
  This analytic identifies the modification of the Windows RemoteAccess Registry Entry.
  This technique can be used by malware, adversaries, threat actors and red teamers to gain persistence on a system by tampering with the key to add a custom DLL to be loaded.
  This technique was also observed to be used by Gh0st RAT malware.
  Upon seeing this behavior, it is recommended to review the system services events especially the remote access services.
references:
- https://malpedia.caad.fkie.fraunhofer.de/details/win.ghost_rat
- https://learn.microsoft.com/en-us/openspecs/windows_protocols/ms-rrasm/22ad9f0e-4349-43e0-92b3-37f7a9c7ca41
- https://s7d2.scene7.com/is/content/cylance/prod/cylance-web/en-us/resources/knowledge-center/resource-library/reports/Op_Dust_Storm_Report.pdf
- https://www.sentinelone.com/blog/the-curious-case-of-gh0st-malware/
tags:
- attack.T1112
date: '2022-04-18'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Services\RemoteAccess\RouterManagers\Ip*'
  selection_1:
    action: modified
  condition: selection_0 and selection_1
