title: Windows Filtering Platform Policy Added to Block EDR Process
id: 1dea4856-f096-4e9d-9bd3-22c568dac5fe
status: stable
level: medium
author: Raven Tait, Splunk
description: |-
  Detects the modification of a Windows Filtering Platform Policy to block the communication of known EDR processes.
  This can be used by attackers to impair the functionality of these tools and to hide their activities on the machine.
references:
- https://unit42.paloaltonetworks.com/edr-bypass-extortion-attempt-thwarted/
- https://github.com/wavestone-cdt/EDRSandblast?tab=readme-ov-file
tags:
- attack.T1685
date: '2026-05-05'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    action: modified
  selection_1:
    TargetObject|contains: '*\Parameters\FirewallPolicy\FirewallRules*'
  selection_2:
    Details|contains: '*Action=Block*'
  selection_3:
    Details|contains: '*App=*'
  selection_4:
    Details|contains:
    - '*AmSvc.exe*'
    - '*cb.exe*'
    - '*CETASvc.exe*'
    - '*CNTAoSMgr.exe*'
    - '*CrAmTray.exe*'
    - '*CrsSvc.exe*'
    - '*CybereasonAV.exe*'
    - '*CylanceSvc.exe*'
    - '*cyserver.exe*'
    - '*CyveraService.exe*'
    - '*CyvrFsFlt.exe*'
    - '*EIConnector.exe*'
    - '*ekrn.exe*'
    - '*elastic-agent.exe*'
    - '*elastic-endpoint.exe*'
    - '*EndpointBasecamp.exe*'
    - '*ExecutionPreventionSvc.exe*'
    - '*filebeat.exe*'
    - '*fortiedr.exe*'
    - '*hurukai.exe*'
    - '*LogProcessorService.exe*'
    - '*MsMpEng.exe*'
    - '*MsSense.exe*'
    - '*Ntrtscan.exe*'
    - '*PccNTMon.exe*'
    - '*QualysAgent.exe*'
    - '*RepMgr.exe*'
    - '*RepUtils.exe*'
    - '*RepUx.exe*'
    - '*RepWAV.exe*'
    - '*RepWSC.exe*'
    - '*SenseCncProxy.exe*'
    - '*SenseIR.exe*'
    - '*SenseNdr.exe*'
    - '*SenseSampleUploader.exe*'
    - '*SentinelAgent.exe*'
    - '*SentinelAgentWorker.exe*'
    - '*SentinelBrowserNativeHost.exe*'
    - '*SentinelHelperService.exe*'
    - '*SentinelServiceHost.exe*'
    - '*SentinelStaticEngine.exe*'
    - '*SentinelStaticEngineScanner.exe*'
    - '*sfc.exe*'
    - '*TaniumClient.exe*'
    - '*TaniumCX.exe*'
    - '*TaniumDetectEngine.exe*'
    - '*TMBMSRV.exe*'
    - '*TmCCSF.exe*'
    - '*TmListen.exe*'
    - '*TmWSCSvc.exe*'
    - '*Traps.exe*'
    - '*winlogbeat.exe*'
    - '*WSCommunicator.exe*'
    - '*xagt.exe*'
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
