title: Windows Impair Defense Set Win Defender Smart Screen Level To Warn
id: cc2a3425-2703-47e7-818f-3dca1b0bc56f
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects modifications to the Windows registry that set the Windows Defender SmartScreen level to "warn." This detection leverages data from the Endpoint.Registry data
  model, specifically monitoring changes to the ShellSmartScreenLevel registry value. This activity is significant because altering SmartScreen settings to "warn" can reduce immediate suspicion from users,
  allowing potentially malicious executables to run with just a warning prompt. If confirmed malicious, this could enable attackers to execute harmful files, increasing the risk of successful malware deployment
  and subsequent system compromise.
references:
- https://x.com/malmoeb/status/1742604217989415386?s=20
- https://github.com/undergroundwires/privacy.sexy
tags:
- attack.T1685
date: '2024-01-30'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Microsoft\Windows\System\ShellSmartScreenLevel'
  selection_1:
    Details: Warn
  condition: selection_0 and selection_1
