title: Windows New EventLog ChannelAccess Registry Value Set
id: 16eb11bc-ef42-42e8-9d0c-d21e0fa15725
status: stable
level: medium
author: Nasreddine Bencherchali, Michael Haag, Splunk
description: The following analytic detects suspicious modifications to the EventLog security descriptor registry value for defense evasion. It leverages data from the Endpoint.Registry data model, focusing
  on changes to the "CustomSD" value within the "HKEY_LOCAL_MACHINE\System\CurrentControlSet\Services\Eventlog\<Channel>\CustomSD" path. This activity is significant as changes to the access permissions
  of the event log could blind security products and help attackers evade defenses. If confirmed malicious, this could allow attackers to block users and security products from viewing, ingesting and interacting
  event logs.
references:
- https://web.archive.org/web/20220710181255/https://blog.minerva-labs.com/lockbit-3.0-aka-lockbit-black-is-here-with-a-new-icon-new-ransom-note-new-wallpaper-but-less-evasiveness
- https://attack.mitre.org/techniques/T1562/002/
tags:
- attack.t1685.001
date: '2024-12-06'
original_spl: '| tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Endpoint.Registry WHERE Registry.registry_path IN ("*\\Microsoft\\Windows\\CurrentVersion\\WINEVT\\Channels\\*",
  "*\Microsoft\Windows\EventLog\*") AND Registry.registry_value_name=ChannelAccess by Registry.action Registry.dest Registry.process_guid Registry.process_id Registry.registry_hive Registry.registry_path
  Registry.registry_key_name Registry.registry_value_data Registry.registry_value_name Registry.registry_value_type Registry.status Registry.user Registry.vendor_product | `drop_dm_object_name(Registry)`
  | where isnotnull(registry_value_data) | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)` | `windows_new_eventlog_channelaccess_registry_value_set_filter`'
splunk_rule_id: 16eb11bc-ef42-42e8-9d0c-d21e0fa15725
splunk_rule_type: Anomaly
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains:
    - \Microsoft\Windows\CurrentVersion\WINEVT\Channels\
    - \Microsoft\Windows\EventLog\
  selection_1:
    Details: ChannelAccess
  condition: selection_0 and selection_1
