title: Windows Impair Defense Deny Security Software With Applocker
id: e0b6ca60-9e29-4450-b51a-bba0abae2313
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects modifications in the Windows registry by the Applocker utility that deny the execution of various security products. This detection leverages data from the Endpoint.Registry
  datamodel, focusing on specific registry paths and values indicating a "Deny" action against known antivirus and security software. This activity is significant as it may indicate an attempt to disable
  security defenses, a tactic observed in malware like Azorult. If confirmed malicious, this could allow attackers to bypass security measures, facilitating further malicious activities and persistence
  within the environment.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
- https://www.microsoftpressstore.com/articles/article.aspx?p=2228450&seqNum=11
tags:
- attack.T1685
date: '2022-06-28'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Group Policy Objects\*'
  selection_1:
    TargetObject|contains: '*\Software\Policies\Microsoft\Windows\SrpV2*'
    Details|contains: '*Action\=\"Deny\"*'
    Details:
    - '*O=SYMANTEC*'
    - '*O=MCAFEE*'
    - '*O=KASPERSKY*'
    - '*O=BLEEPING COMPUTER*'
    - '*O=PANDA SECURITY*'
    - '*O=SYSTWEAK SOFTWARE*'
    - '*O=TREND MICRO*'
    - '*O=AVAST*'
    - '*O=GRIDINSOFT*'
    - '*O=MICROSOFT*'
    - '*O=NANO SECURITY*'
    - '*O=SUPERANTISPYWARE.COM*'
    - '*O=DOCTOR WEB*'
    - '*O=MALWAREBYTES*'
    - '*O=ESET*'
    - '*O=AVIRA*'
    - '*O=WEBROOT*'
  condition: selection_0 and selection_1
