title: Windows Autostart Execution LSASS Driver Registry Modification
id: 57fb8656-141e-4d8a-9f51-62cff4ecb82a
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects modifications to undocumented registry keys that allow a DLL to load into lsass.exe, potentially capturing credentials. It leverages the Endpoint.Registry data
  model to identify changes to \CurrentControlSet\Services\NTDS\DirectoryServiceExtPt or \CurrentControlSet\Services\NTDS\LsaDbExtPt. This activity is significant as it indicates a possible attempt to inject
  malicious code into the Local Security Authority Subsystem Service (LSASS), which can lead to credential theft. If confirmed malicious, this could allow attackers to gain unauthorized access to sensitive
  information and escalate privileges within the environment.
references:
- https://blog.xpnsec.com/exploring-mimikatz-part-1/
- https://github.com/oxfemale/LogonCredentialsSteal/tree/master/lsass_lib
tags:
- attack.T1547_008
date: '2022-08-22'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains:
    - '*\CurrentControlSet\Services\NTDS\DirectoryServiceExtPt'
    - '*\CurrentControlSet\Services\NTDS\LsaDbExtPt'
  condition: selection_0
