title: Windows Mshta Execution In Registry
id: e13ceade-b673-4d34-adc4-4d9c01729753
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the execution of mshta.exe via registry entries to run malicious scripts. It leverages registry activity logs to identify entries containing "mshta," "javascript,"
  "vbscript," or "WScript.Shell." This behavior is significant as it indicates potential fileless malware, such as Kovter, which uses encoded scripts in the registry to persist and execute without files.
  If confirmed malicious, this activity could allow attackers to maintain persistence, execute arbitrary code, and evade traditional file-based detection methods, posing a significant threat to system integrity
  and security.
references:
- https://redcanary.com/threat-detection-report/techniques/mshta/
- https://learn.microsoft.com/en-us/microsoft-365/security/intelligence/fileless-threats?view=o365-worldwide
tags:
- attack.T1218_005
date: '2022-10-14'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    Details|contains: '*mshta*'
  selection_1:
    Details|contains:
    - '*javascript:*'
    - '*vbscript:*'
    - '*WScript.Shell*'
  condition: selection_0 and selection_1
