title: Windows Disable Windows Group Policy Features Through Registry
id: 63a449ae-9f04-11ec-945e-acde48001122
status: stable
level: medium
author: Steven Dick, Teoderick Contreras, Splunk
description: The following analytic detects suspicious registry modifications aimed at disabling Windows Group Policy features. It leverages data from the Endpoint.Registry data model, focusing on specific
  registry paths and values associated with disabling key Windows functionalities. This activity is significant because it is commonly used by ransomware to hinder mitigation and forensic response efforts.
  If confirmed malicious, this behavior could severely impair the ability of security teams to analyze and respond to the attack, allowing the attacker to maintain control and persist within the compromised
  environment.
references:
- https://hybrid-analysis.com/sample/ef1c427394c205580576d18ba68d5911089c7da0386f19d1ca126929d3e671ab?environmentId=120&lang=en
- https://www.sophos.com/en-us/threat-center/threat-analyses/viruses-and-spyware/Troj~Krotten-N/detailed-analysis
- https://www.virustotal.com/gui/file/2d7855bf6470aa323edf2949b54ce2a04d9e38770f1322c3d0420c2303178d91/details
tags:
- attack.T1112
date: '2022-03-08'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\Explorer\*'
  selection_1:
    TargetObject|contains: '*\SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\*'
    Details:
    - NoDesktop
    - NoFind
    - NoControlPanel
    - NoFileMenu
    - NoSetTaskbar
    - NoTrayContextMenu
    - TaskbarLockAll
    - NoThemesTab
    - NoPropertiesMyDocuments
    - NoVisualStyleChoice
    - NoColorChoice
    - NoPropertiesMyDocuments
    - '0x00000001'
  condition: selection_0 and selection_1
