title: Windows New EventLog ChannelAccess Registry Value Set
id: 16eb11bc-ef42-42e8-9d0c-d21e0fa15725
status: stable
level: medium
author: Nasreddine Bencherchali, Michael Haag, Splunk
description: The following analytic detects suspicious modifications to the EventLog security descriptor registry value for defense evasion. It leverages data from the Endpoint.Registry data model, focusing
  on changes to the "CustomSD" value within the "HKEY_LOCAL_MACHINE\System\CurrentControlSet\Services\Eventlog\<Channel>\CustomSD" path. This activity is significant as changes to the access permissions
  of the event log could blind security products and help attackers evade defenses. If confirmed malicious, this could allow attackers to block users and security products from viewing, ingesting and interacting
  event logs.
references:
- https://web.archive.org/web/20220710181255/https://blog.minerva-labs.com/lockbit-3.0-aka-lockbit-black-is-here-with-a-new-icon-new-ransom-note-new-wallpaper-but-less-evasiveness
- https://attack.mitre.org/techniques/T1562/002/
tags:
- attack.T1685_001
date: '2024-12-06'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains:
    - '*\Microsoft\Windows\CurrentVersion\WINEVT\Channels\*'
    - '*\Microsoft\Windows\EventLog\*'
  selection_1:
    Details: ChannelAccess
  condition: selection_0 and selection_1
