title: Windows Remote Access Software RMS Registry
id: e5b7b5a9-e471-4be8-8c5d-4083983ba329
status: stable
level: medium
author: Teoderick Contreras, Splunk
description: The following analytic detects the creation or modification of Windows registry entries related to the Remote Manipulator System (RMS) Remote Admin tool. It leverages data from the Endpoint.Registry
  datamodel, focusing on registry paths containing "SYSTEM\\Remote Manipulator System." This activity is significant because RMS, while legitimate, is often abused by adversaries, such as in the Azorult
  malware campaigns, to gain unauthorized remote access. If confirmed malicious, this could allow attackers to remotely control the targeted host, leading to potential data exfiltration, system manipulation,
  or further network compromise.
references:
- https://app.any.run/tasks/a6f2ffe2-e6e2-4396-ae2e-04ea0143f2d8/
- https://malpedia.caad.fkie.fraunhofer.de/details/win.rms
tags:
- attack.T1219
date: '2022-06-24'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\SYSTEM\Remote Manipulator System*'
  condition: selection_0
