title: Windows Registry Delete Task SD
id: ffeb7893-ff06-446f-815b-33ca73224e92
status: stable
level: medium
author: Michael Haag, Teoderick Contreras, Splunk
description: |
  The following analytic detects a process attempting to delete a scheduled task's Security Descriptor (SD) from the registry path of that task.
  It leverages the Endpoint.Registry data model to identify registry actions performed by the SYSTEM user, specifically targeting deletions of the SD value.
  This activity is significant as it may indicate an attempt to remove evidence of a scheduled task for defense evasion.
  If confirmed malicious, it suggests an attacker with privileged access trying to hide their tracks, potentially compromising system integrity and security.
references:
- https://www.microsoft.com/security/blog/2022/04/12/tarrask-malware-uses-scheduled-tasks-for-defense-evasion/
- https://gist.github.com/MHaggis/5f7fd6745915166fc6da863d685e2728
- https://gist.github.com/MHaggis/b246e2fae6213e762a6e694cabaf0c17
tags:
- attack.T1053_005
- attack.T1685
date: '2022-04-18'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\Schedule\TaskCache\Tree\*'
  selection_1:
    User: SYSTEM
  selection_2:
    Details: SD
  selection_3:
    TargetObject: SD
  selection_4:
    action: deleted
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
