title: WSReset UAC Bypass
id: 8b5901bc-da63-11eb-be43-acde48001122
status: stable
level: medium
author: Steven Dick, Teoderick Contreras, Splunk
description: The following analytic detects a suspicious modification of the registry aimed at bypassing User Account Control (UAC) by leveraging WSReset.exe. It identifies the creation or modification
  of specific registry values under the path "*\\AppX82a6gwre4fdg3bt635tn5ctqjf8msdd2\\Shell\\open\\command*". This detection uses data from Endpoint Detection and Response (EDR) agents, focusing on process
  and registry events. This activity is significant because UAC bypass techniques can allow attackers to execute high-privilege actions without user consent. If confirmed malicious, this could lead to unauthorized
  code execution and potential system compromise.
references:
- https://github.com/hfiref0x/UACME
- https://blog.morphisec.com/trickbot-uses-a-new-windows-10-uac-bypass
tags:
- attack.T1548_002
date: '2021-07-08'
logsource:
  category: registry_event
  product: windows
detection:
  selection_0:
    TargetObject|contains: '*\AppX82a6gwre4fdg3bt635tn5ctqjf8msdd2\Shell\open\command*'
  condition: selection_0
