title: Windows RDP Connection Successful
id: ceaed840-56b3-4a70-b8e1-d762b1c5c08c
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects successful Remote Desktop Protocol (RDP) connections by monitoring EventCode 1149 from the Windows TerminalServices RemoteConnectionManager Operational log. This
  detection is significant as successful RDP connections can indicate remote access to a system, which may be leveraged by attackers to control or exfiltrate data. If confirmed malicious, this activity
  could lead to unauthorized access, data theft, or further lateral movement within the network. Monitoring successful RDP connections is crucial for identifying potential security breaches and mitigating
  risks promptly.
references:
- https://gist.github.com/MHaggis/138c6bf563bacbda4a2524f089773706
- https://doublepulsar.com/rdp-hijacking-how-to-hijack-rds-and-remoteapp-sessions-transparently-to-move-through-an-da2a1e73a5f6
tags:
- attack.T1563_002
date: '2023-04-17'
logsource:
  product: windows
  service: terminalservices
detection:
  selection_0:
    EventID: 1149
  condition: selection_0
