title: Windows Export Certificate
id: d8ddfa9b-b724-4df9-9dbe-f34cc0936714
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the export of a certificate from the Windows Certificate Store. It leverages the Certificates Lifecycle log channel, specifically event ID 1007, to identify this
  activity. Monitoring certificate exports is crucial as certificates can be used for authentication to VPNs or private resources. If malicious actors export certificates, they could potentially gain unauthorized
  access to sensitive systems or data, leading to significant security breaches.
references:
- https://atomicredteam.io/defense-evasion/T1553.004/#atomic-test-4---install-root-ca-on-windows
tags:
- attack.T1552_004
- attack.T1649
date: '2023-02-03'
logsource:
  product: windows
  service: certificateservices
detection:
  selection_0:
    EventID: 1007
  condition: selection_0
