title: 3CX Supply Chain Attack Network Indicators
id: 791b727c-deec-4fbe-a732-756131b3c5a1
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies DNS queries to domains associated with the 3CX supply chain attack. It leverages the Network_Resolution datamodel to detect these suspicious domain indicators.
  This activity is significant because it can indicate a potential compromise stemming from the 3CX supply chain attack, which is known for distributing malicious software through trusted updates. If confirmed
  malicious, this activity could allow attackers to establish a foothold in the network, exfiltrate sensitive data, or further propagate malware, leading to extensive damage and data breaches.
references:
- https://www.sentinelone.com/blog/smoothoperator-ongoing-campaign-trojanizes-3cx-software-in-software-supply-chain-attack/
- https://www.cisa.gov/news-events/alerts/2023/03/30/supply-chain-attack-against-3cxdesktopapp
- https://www.reddit.com/r/crowdstrike/comments/125r3uu/20230329_situational_awareness_crowdstrike/
- https://www.3cx.com/community/threads/crowdstrike-endpoint-security-detection-re-3cx-desktop-app.119934/page-2#post-558898
- https://www.3cx.com/community/threads/3cx-desktopapp-security-alert.119951/
tags:
- attack.t1195.002
date: '2023-04-11'
original_spl: |-
  | tstats `security_content_summariesonly`
    count min(_time) as firstTime
          max(_time) as lastTime
  from datamodel=Network_Resolution where
  DNS.query=*
  NOT DNS.query IN ("-", "unknown")
  by DNS.answer DNS.answer_count DNS.query
     DNS.query_count DNS.reply_code_id DNS.src
     DNS.vendor_product
  | `drop_dm_object_name(DNS)`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | lookup 3cx_ioc_domains domain as query OUTPUT Description isIOC
  | search isIOC=true
  | `3cx_supply_chain_attack_network_indicators_filter`
splunk_rule_id: 791b727c-deec-4fbe-a732-756131b3c5a1
splunk_rule_type: TTP
logsource:
  category: dns
detection:
  selection_0:
    QueryName|contains: ''
  filter_1:
    QueryName:
    - '-'
    - unknown
  condition: (selection_0) and not (filter_1)
