title: Detect hosts connecting to dynamic domain providers
id: a1e761ac-1344-4dbd-88b2-3f34c912d359
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies DNS queries from internal hosts to dynamic domain providers. It leverages DNS query logs from the `Network_Resolution` data model and cross-references them
  with a lookup file containing known dynamic DNS providers. This activity is significant because attackers often use dynamic DNS services to host malicious payloads or command-and-control servers, making
  it crucial for security teams to monitor. If confirmed malicious, this activity could allow attackers to bypass firewall blocks, evade detection, and maintain persistent access to the network.
tags:
- attack.t1189
date: '2019-10-16'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime
    from datamodel=Network_Resolution where
    DNS.query=*
    NOT DNS.query IN ("-", "unknown")
    by DNS.answer DNS.answer_count DNS.query DNS.query_count
       DNS.reply_code_id DNS.src DNS.vendor_product
  | `drop_dm_object_name("DNS")`
  | `security_content_ctime(firstTime)`
  | lookup update=true dynamic_dns_providers_default dynamic_dns_domains as query OUTPUTNEW isDynDNS_default
  | lookup update=true dynamic_dns_providers_local dynamic_dns_domains as query OUTPUTNEW isDynDNS_local
  | eval isDynDNS = coalesce(isDynDNS_local,isDynDNS_default)
  |fields - isDynDNS_default, isDynDNS_local| search isDynDNS=True
  | `detect_hosts_connecting_to_dynamic_domain_providers_filter`
splunk_rule_id: a1e761ac-1344-4dbd-88b2-3f34c912d359
splunk_rule_type: TTP
logsource:
  category: dns
detection:
  selection_0:
    QueryName|contains: ''
  filter_1:
    QueryName:
    - '-'
    - unknown
  condition: (selection_0) and not (filter_1)
