title: Detect DNS Query to Decommissioned S3 Bucket
id: 2f1c5fd1-4b8a-4f5d-a0e9-7d6a8e2f5e1e
status: experimental
level: medium
author: Jose Hernandez, Splunk
description: This detection identifies DNS queries to domains that match previously decommissioned S3 buckets. This activity is significant because attackers may attempt to recreate deleted S3 buckets that
  were previously public to hijack them for malicious purposes. If successful, this could allow attackers to host malicious content or exfiltrate data through compromised bucket names that may still be
  referenced by legitimate applications.
references:
- https://docs.aws.amazon.com/AmazonS3/latest/userguide/access-control-block-public-access.html
- https://labs.watchtowr.com/8-million-requests-later-we-made-the-solarwinds-supply-chain-attack-look-amateur/
tags:
- attack.t1485
date: '2025-02-12'
original_spl: |-
  | tstats `security_content_summariesonly` count min(_time) as firstTime max(_time) as lastTime FROM datamodel=Network_Resolution
    WHERE DNS.message_type=QUERY
    BY DNS.answer DNS.answer_count DNS.query
       DNS.query_count DNS.reply_code_id DNS.src
       DNS.vendor_product
  | `drop_dm_object_name("DNS")`
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | eval bucket_domain = lower(query)
  | lookup decommissioned_buckets bucketName as bucket_domain OUTPUT bucketName as match
  | where isnotnull(match)
  | `detect_dns_query_to_decommissioned_s3_bucket_filter`
splunk_rule_id: 2f1c5fd1-4b8a-4f5d-a0e9-7d6a8e2f5e1e
splunk_rule_type: Anomaly
logsource:
  category: dns
detection:
  selection_0:
    DNS.message_type: QUERY
  condition: selection_0
