title: DNS Kerberos Coercion
id: 8551252d-b5b6-4b6e-8a82-51460aeb29a3
status: stable
level: medium
author: Raven Tait, Splunk
description: Detects DNS-based Kerberos coercion attacks where adversaries inject marshaled credential structures into DNS records to spoof SPNs and redirect authentication such as in CVE-2025-33073. This
  detection leverages suricata looking for specific CREDENTIAL_TARGET_INFORMATION structures in DNS queries.
references:
- https://web.archive.org/web/20250617122747/https://www.synacktiv.com/publications/ntlm-reflection-is-dead-long-live-ntlm-reflection-an-in-depth-analysis-of-cve-2025
- https://www.synacktiv.com/publications/relaying-kerberos-over-smb-using-krbrelayx
- https://www.guidepointsecurity.com/blog/the-birth-and-death-of-loopyticket/
tags:
- attack.T1557_001
- attack.T1187
- attack.T1071_004
date: '2025-11-18'
logsource:
  category: dns
detection:
  selection_0:
    QueryName|contains: '*1UWhRC*'
  selection_1:
    QueryName|contains: '*AAAAA*'
  selection_2:
    QueryName|contains: '*YBAAAA*'
  condition: selection_0 and selection_1 and selection_2
