title: Large Volume of DNS ANY Queries
id: 8fa891f7-a533-4b3c-af85-5aa2e7c1f1eb
status: experimental
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies a large volume of DNS ANY queries, which may indicate a DNS amplification attack. It leverages the Network_Resolution data model to count DNS queries of type
  "ANY" directed to specific destinations. This activity is significant because DNS amplification attacks can overwhelm network resources, leading to Denial of Service (DoS) conditions. If confirmed malicious,
  this activity could disrupt services, degrade network performance, and potentially be part of a larger Distributed Denial of Service (DDoS) attack, impacting the availability of critical infrastructure.
tags:
- attack.T1498_002
date: '2020-04-29'
logsource:
  category: dns
detection:
  selection_0:
    nodename: DNS
  selection_1:
    message_type": QUERY
  selection_2:
    record_type": ANY
  condition: selection_0 and selection_1 and selection_2
