title: Ngrok Reverse Proxy on Network
id: 5790a766-53b8-40d3-a696-3547b978fcf0
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects DNS queries to common Ngrok domains, indicating potential use of the Ngrok reverse proxy tool. It leverages the Network Resolution datamodel to identify queries
  to domains such as "*.ngrok.com" and "*.ngrok.io". While Ngrok usage is not inherently malicious, it has been increasingly adopted by adversaries for covert communication and data exfiltration. If confirmed
  malicious, this activity could allow attackers to bypass network defenses, establish persistent connections, and exfiltrate sensitive data, posing a significant threat to the network's security.
references:
- https://www.cisa.gov/uscert/sites/default/files/publications/aa22-320a_joint_csa_iranian_government-sponsored_apt_actors_compromise_federal%20network_deploy_crypto%20miner_credential_harvester.pdf
tags:
- attack.T1572
- attack.T1090
- attack.T1102
date: '2022-11-16'
logsource:
  category: dns
detection:
  selection_0:
    QueryName|contains:
    - '*.ngrok.com'
    - '*.ngrok.io'
    - ngrok.*.tunnel.com
    - korgn.*.lennut.com
  condition: selection_0
