title: Azure AD Privileged Role Assigned
id: a28f0bc3-3400-4a6e-a2da-89b9e95f0d2a
status: stable
level: medium
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
description: The following analytic detects the assignment of privileged Azure Active Directory roles to a user. It leverages Azure AD audit logs, specifically monitoring the "Add member to role" operation.
  This activity is significant as adversaries may assign privileged roles to compromised accounts to maintain persistence within the Azure AD environment. If confirmed malicious, this could allow attackers
  to escalate privileges, access sensitive information, and maintain long-term control over the Azure AD infrastructure.
references:
- https://docs.microsoft.com/en-us/azure/active-directory/roles/concept-understand-roles
- https://docs.microsoft.com/en-us/azure/active-directory/roles/permissions-reference
- https://adsecurity.org/?p=4277
- https://www.mandiant.com/resources/detecting-microsoft-365-azure-active-directory-backdoors
- https://docs.microsoft.com/en-us/azure/active-directory/roles/security-planning
- https://attack.mitre.org/techniques/T1098/003/
tags:
- attack.t1098.003
date: '2022-08-29'
original_spl: |-
  `azure_monitor_aad` "operationName"="Add member to role"
    | rename properties.* as *
    | rename initiatedBy.user.userPrincipalName as initiatedBy
    | rename targetResources{}.modifiedProperties{}.newValue as roles
    | eval role=mvindex(roles,1)
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest user src
         vendor_account vendor_product initiatedBy
         result role signature
    | lookup privileged_azure_ad_roles azureadrole AS role OUTPUT isprvilegedadrole description
    | search isprvilegedadrole = True
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `azure_ad_privileged_role_assigned_filter`
splunk_rule_id: a28f0bc3-3400-4a6e-a2da-89b9e95f0d2a
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    '"operationName"': Add member to role
  condition: selection_0
