title: Azure Active Directory High Risk Sign-in
id: 1ecff169-26d7-4161-9a7b-2ac4c8e61bea
status: stable
level: medium
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
description: The following analytic detects high-risk sign-in attempts against Azure Active Directory, identified by Azure Identity Protection. It leverages the RiskyUsers and UserRiskEvents log categories
  from Azure AD events ingested via EventHub. This activity is significant as it indicates potentially compromised accounts, flagged by heuristics and machine learning. If confirmed malicious, attackers
  could gain unauthorized access to sensitive resources, leading to data breaches or further exploitation within the environment.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray
- https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/overview-identity-protection
- https://docs.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks
tags:
- attack.t1110.003
- attack.t1586.003
date: '2022-07-11'
original_spl: |-
  `azure_monitor_aad` category=UserRiskEvents properties.riskLevel=high
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest user src
         vendor_account vendor_product category
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `azure_active_directory_high_risk_sign_in_filter`
splunk_rule_id: 1ecff169-26d7-4161-9a7b-2ac4c8e61bea
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category: UserRiskEvents
  selection_1:
    properties.riskLevel: high
  condition: selection_0 and selection_1
