title: Azure AD Multi-Source Failed Authentications Spike
id: 116e11a9-63ea-41eb-a66a-6a13bdc7d2c7
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects potential distributed password spraying attacks in an Azure AD environment. It identifies a spike in failed authentication attempts across various user-and-IP
  combinations from multiple source IPs and countries, using different user agents. This detection leverages Azure AD SignInLogs, focusing on error code 50126 for failed authentications. This activity is
  significant as it indicates an adversary's attempt to bypass security controls by distributing login attempts. If confirmed malicious, this could lead to unauthorized access, data breaches, privilege
  escalation, and lateral movement within the organization's infrastructure.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://docs.microsoft.com/en-us/security/compass/incident-response-playbook-password-spray
- https://www.cisa.gov/uscert/ncas/alerts/aa21-008a
- https://docs.microsoft.com/azure/active-directory/reports-monitoring/reference-sign-ins-error-codes
tags:
- attack.T1110_003
- attack.T1110_004
- attack.T1586_003
date: '2023-11-16'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category|contains: '*SignInLogs'
  selection_1:
    status.errorCode: 50126
  selection_2:
    authenticationDetails{}.succeeded: 'false'
  condition: selection_0 and selection_1 and selection_2
