title: Azure AD Multiple Failed MFA Requests For User
id: 264ea131-ab1f-41b8-90e0-33ad1a1888ea
status: stable
level: medium
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
description: The following analytic identifies multiple failed multi-factor authentication (MFA) requests for a single user within an Azure AD tenant. It leverages Azure AD Sign-in Logs, specifically error
  code 500121, to detect more than 10 failed MFA attempts within 10 minutes. This behavior is significant as it may indicate an adversary attempting to bypass MFA by bombarding the user with repeated authentication
  prompts. If confirmed malicious, this activity could lead to unauthorized access, allowing attackers to compromise user accounts and potentially escalate their privileges within the environment.
references:
- https://www.mandiant.com/resources/blog/russian-targeting-gov-business
- https://arstechnica.com/information-technology/2022/03/lapsus-and-solar-winds-hackers-both-use-the-same-old-trick-to-bypass-mfa/
- https://therecord.media/russian-hackers-bypass-2fa-by-annoying-victims-with-repeated-push-notifications/
- https://attack.mitre.org/techniques/T1621/
- https://attack.mitre.org/techniques/T1078/004/
- https://www.cisa.gov/sites/default/files/publications/fact-sheet-implement-number-matching-in-mfa-applications-508c.pdf
tags:
- attack.T1078_004
- attack.T1586_003
- attack.T1621
date: '2022-08-25'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category: SignInLogs
  selection_1:
    operationName: Sign-in activity
  selection_2:
    status.errorCode: 500121
  selection_3:
    status.additionalDetails!: MFA denied; user declined the authentication
  condition: selection_0 and selection_1 and selection_2 and selection_3
