title: Azure AD Multiple Denied MFA Requests For User
id: d0895c20-de71-4fd2-b56c-3fcdb888eba1
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects an unusually high number of denied Multi-Factor Authentication (MFA) requests for a single user within a 10-minute window, specifically when more than nine MFA
  prompts are declined. It leverages Azure Active Directory (Azure AD) sign-in logs, focusing on "Sign-in activity" events with error code 500121 and additional details indicating "MFA denied; user declined
  the authentication." This behavior is significant as it may indicate a targeted attack or account compromise attempt, with the user actively declining unauthorized access. If confirmed malicious, it could
  lead to data exfiltration, lateral movement, or further malicious activities.
references:
- https://www.mandiant.com/resources/blog/russian-targeting-gov-business
- https://arstechnica.com/information-technology/2022/03/lapsus-and-solar-winds-hackers-both-use-the-same-old-trick-to-bypass-mfa/
- https://therecord.media/russian-hackers-bypass-2fa-by-annoying-victims-with-repeated-push-notifications/
- https://attack.mitre.org/techniques/T1621/
- https://attack.mitre.org/techniques/T1078/004/
- https://www.cisa.gov/sites/default/files/publications/fact-sheet-implement-number-matching-in-mfa-applications-508c.pdf
tags:
- attack.t1621
date: '2023-11-16'
original_spl: |-
  `azure_monitor_aad` category=SignInLogs operationName="Sign-in activity"
    | rename properties.* as *
    | search status.errorCode=500121 status.additionalDetails="MFA denied; user declined the authentication"
    | bucket span=10m _time
    | rename userAgent as user_agent
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime values(dest) as dest values(user_agent) as user_agent values(src) as src
      BY user status.additionalDetails vendor_account
         vendor_product signature _time
    | where count > 9
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `azure_ad_multiple_denied_mfa_requests_for_user_filter`
splunk_rule_id: d0895c20-de71-4fd2-b56c-3fcdb888eba1
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category: SignInLogs
  selection_1:
    operationName: Sign-in activity
  condition: selection_0 and selection_1
