title: Azure AD High Number Of Failed Authentications For User
id: 630b1694-210a-48ee-a450-6f79e7679f2c
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies an Azure AD account experiencing more than 20 failed authentication attempts within a 10-minute window. This detection leverages Azure SignInLogs data, specifically
  monitoring for error code 50126 and unsuccessful authentication attempts. This behavior is significant as it may indicate a brute force attack targeting the account. If confirmed malicious, an attacker
  could potentially gain unauthorized access, leading to data breaches or further exploitation within the environment. Security teams should adjust the threshold based on their specific environment to reduce
  false positives.
references:
- https://attack.mitre.org/techniques/T1110/
- https://attack.mitre.org/techniques/T1110/001/
tags:
- attack.t1110.001
date: '2023-01-23'
original_spl: |-
  `azure_monitor_aad`
  category=SignInLogs
  properties.status.errorCode=50126
  properties.authenticationDetails{}.succeeded=false
  | rename properties.* as *
  | bin span=10m _time
  | fillnull value=null
  | stats count min(_time) as firstTime max(_time) as lastTime values(dest) as dest values(src) as src values(user_agent) as user_agent by user _time vendor_account vendor_product
  | where count > 20
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `azure_ad_high_number_of_failed_authentications_for_user_filter`
splunk_rule_id: 630b1694-210a-48ee-a450-6f79e7679f2c
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category: SignInLogs
  selection_1:
    properties.status.errorCode: 50126
  selection_2:
    properties.authenticationDetails{}.succeeded: 'false'
  condition: selection_0 and selection_1 and selection_2
