title: Azure AD Multiple AppIDs and UserAgents Authentication Spike
id: 5d8bb1f0-f65a-4b4e-af2e-fcdb88276314
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects unusual authentication activity in Azure AD, specifically when a single user account has over 8 authentication attempts using 3+ unique application IDs and 5+
  unique user agents within a short period. It leverages Azure AD audit logs, focusing on authentication events and using statistical thresholds. This behavior is significant as it may indicate an adversary
  probing for MFA requirements. If confirmed malicious, it suggests a compromised account, potentially leading to further exploitation, lateral movement, and data exfiltration. Early detection is crucial
  to prevent substantial harm.
references:
- https://attack.mitre.org/techniques/T1078/
- https://www.blackhillsinfosec.com/exploiting-mfa-inconsistencies-on-microsoft-services/
- https://github.com/dafthack/MFASweep
- https://www.youtube.com/watch?v=SK1zgqaAZ2E
tags:
- attack.t1078
date: '2023-11-16'
original_spl: |-
  `azure_monitor_aad` category=SignInLogs operationName="Sign-in activity" (properties.authenticationRequirement="multiFactorAuthentication" properties.status.additionalDetails="MFA required in Azure AD") OR (properties.authenticationRequirement=singleFactorAuthentication "properties.authenticationDetails{}.succeeded"=true)
    | bucket span=5m _time
    | rename properties.* as *
    | rename userAgent as user_agent
    | fillnull
    | stats count dc(appId) as unique_app_ids dc(user_agent) as unique_user_agents min(_time) as firstTime max(_time) as lastTime values(dest) as dest values(user_agent) as user_agent
      BY user src vendor_account
         vendor_product signature
    | where count > 5 and unique_app_ids > 2 and unique_user_agents > 5
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `azure_ad_multiple_appids_and_useragents_authentication_spike_filter`
splunk_rule_id: 5d8bb1f0-f65a-4b4e-af2e-fcdb88276314
splunk_rule_type: Anomaly
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category: SignInLogs
    operationName: Sign-in activity
    properties.authenticationRequirement: multiFactorAuthentication
    properties.status.additionalDetails: MFA required in Azure AD
  selection_1:
    properties.authenticationRequirement: singleFactorAuthentication
    '"properties.authenticationDetails{}.succeeded"': 'true'
  condition: selection_0 and selection_1
