title: Azure AD Service Principal Owner Added
id: 7ddf2084-6cf3-4a44-be83-474f7b73c701
status: stable
level: medium
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
description: The following analytic detects the addition of a new owner to a Service Principal within an Azure AD tenant. It leverages Azure Active Directory events from the AuditLog log category to identify
  this activity. This behavior is significant because Service Principals do not support multi-factor authentication or conditional access policies, making them a target for adversaries seeking persistence
  or privilege escalation. If confirmed malicious, this activity could allow attackers to maintain access to the Azure AD environment with single-factor authentication, potentially leading to unauthorized
  access and control over critical resources.
references:
- https://attack.mitre.org/techniques/T1098/
tags:
- attack.t1098
date: '2022-08-30'
original_spl: |-
  `azure_monitor_aad` operationName="Add owner to application"
    | rename properties.* as *
    | rename initiatedBy.user.userPrincipalName as initiatedBy
    | rename targetResources{}.userPrincipalName as newOwner
    | rename targetResources{}.modifiedProperties{}.newValue as displayName
    | eval displayName = mvindex(displayName,1)
    | where initiatedBy!=newOwner
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest user src
         vendor_account vendor_product initiatedBy
         result newOwner displayName
         signature
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `azure_ad_service_principal_owner_added_filter`
splunk_rule_id: 7ddf2084-6cf3-4a44-be83-474f7b73c701
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    operationName: Add owner to application
  condition: selection_0
