title: Azure AD User ImmutableId Attribute Updated
id: 0c0badad-4536-4a84-a561-5ff760f3c00e
status: stable
level: medium
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
description: The following analytic identifies the modification of the SourceAnchor (ImmutableId) attribute for an Azure Active Directory user. This detection leverages Azure AD audit logs, specifically
  monitoring the "Update user" operation and changes to the SourceAnchor attribute. This activity is significant as it is a step in setting up an Azure AD identity federation backdoor, allowing an adversary
  to establish persistence. If confirmed malicious, the attacker could impersonate any user, bypassing password and MFA requirements, leading to unauthorized access and potential data breaches.
references:
- https://docs.microsoft.com/en-us/azure/active-directory/hybrid/plan-connect-design-concepts
- https://www.mandiant.com/resources/remediation-and-hardening-strategies-microsoft-365-defend-against-apt29-v13
- https://o365blog.com/post/federation-vulnerability/
- https://www.inversecos.com/2021/11/how-to-detect-azure-active-directory.html
- https://www.mandiant.com/resources/blog/detecting-microsoft-365-azure-active-directory-backdoors
- https://attack.mitre.org/techniques/T1098/
tags:
- attack.t1098
date: '2022-09-02'
original_spl: |-
  `azure_monitor_aad` operationName="Update user" properties.targetResources{}.modifiedProperties{}.displayName=SourceAnchor
    | rename properties.* as *
    | rename initiatedBy.user.userPrincipalName as initiatedBy
    | rename targetResources{}.modifiedProperties{}.newValue as modifiedProperties
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest user src
         vendor_account vendor_product initiatedBy
         signature
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `azure_ad_user_immutableid_attribute_updated_filter`
splunk_rule_id: 0c0badad-4536-4a84-a561-5ff760f3c00e
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    operationName: Update user
  selection_1:
    properties.targetResources{}.modifiedProperties{}.displayName: SourceAnchor
  condition: selection_0 and selection_1
