title: Azure AD Service Principal Created
id: f8ba49e7-ffd3-4b53-8f61-e73974583c5d
status: stable
level: medium
author: Gowthamaraj Rajendran, Mauricio Velazco, Splunk
description: The following analytic detects the creation of a Service Principal in an Azure AD environment. It leverages Azure Active Directory events ingested through EventHub, specifically monitoring
  the "Add service principal" operation. This activity is significant because Service Principals can be used by adversaries to establish persistence and bypass multi-factor authentication and conditional
  access policies. If confirmed malicious, this could allow attackers to maintain single-factor access to the Azure AD environment, potentially leading to unauthorized access to resources and prolonged
  undetected activity.
references:
- https://docs.microsoft.com/en-us/azure/active-directory/develop/app-objects-and-service-principals
- https://docs.microsoft.com/en-us/powershell/azure/create-azure-service-principal-azureps?view=azps-8.2.0
- https://www.truesec.com/hub/blog/using-a-legitimate-application-to-create-persistence-and-initiate-email-campaigns
- https://www.inversecos.com/2021/10/how-to-backdoor-azure-applications-and.html
- https://attack.mitre.org/techniques/T1136/003/
tags:
- attack.t1136.003
date: '2022-08-17'
original_spl: |-
  `azure_monitor_aad` operationName="Add service principal" properties.initiatedBy.user.id=*
    | rename properties.* as *
    | rename targetResources{}.displayName as displayName
    | rename targetResources{}.type as type
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY dest user src
         vendor_account vendor_product displayName
         result signature
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `azure_ad_service_principal_created_filter`
splunk_rule_id: f8ba49e7-ffd3-4b53-8f61-e73974583c5d
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    operationName: Add service principal
  selection_1:
    properties.initiatedBy.user.id|contains: ''
  condition: selection_0 and selection_1
