title: Azure Runbook Webhook Created
id: e98944a9-92e4-443c-81b8-a322e33ce75a
status: stable
level: medium
author: Mauricio Velazco, Brian Serocki, Splunk
description: The following analytic detects the creation of a new Automation Runbook Webhook within an Azure tenant. It leverages Azure Audit events, specifically the "Create or Update an Azure Automation
  webhook" operation, to identify this activity. This behavior is significant because Webhooks can trigger Automation Runbooks via unauthenticated URLs exposed to the Internet, posing a security risk. If
  confirmed malicious, an attacker could use this to execute code, create users, or maintain persistence within the environment, potentially leading to unauthorized access and control over Azure resources.
references:
- https://docs.microsoft.com/en-us/azure/automation/overview
- https://docs.microsoft.com/en-us/azure/automation/automation-runbook-types
- https://docs.microsoft.com/en-us/azure/automation/automation-webhooks?tabs=portal
- https://www.inversecos.com/2021/12/how-to-detect-malicious-azure.html
- https://www.netspi.com/blog/technical/cloud-penetration-testing/maintaining-azure-persistence-via-automation-accounts/
- https://microsoft.github.io/Azure-Threat-Research-Matrix/Persistence/AZT503/AZT503-3/
- https://attack.mitre.org/techniques/T1078/004/
tags:
- attack.T1078_004
date: '2022-08-23'
logsource:
  product: azure
  service: audit
detection:
  selection_0:
    value: Microsoft.Automation/automationAccounts/webhooks/write
  selection_1:
    value: Succeeded
  condition: selection_0 and selection_1
