title: Azure AD Global Administrator Role Assigned
id: 825fed20-309d-4fd1-8aaf-cd49c1bb093c
status: stable
level: medium
author: Gowthamaraj Rajendran, Mauricio Velazco, Splunk
description: The following analytic detects the assignment of the Azure AD Global Administrator role to a user. It leverages Azure Active Directory AuditLogs to identify when the "Add member to role" operation
  includes the "Global Administrator" role. This activity is significant because the Global Administrator role grants extensive access to data, resources, and settings, similar to a Domain Administrator
  in traditional AD environments. If confirmed malicious, this could allow an attacker to establish persistence, escalate privileges, and potentially gain control over Azure resources, posing a severe security
  risk.
references:
- https://o365blog.com/post/admin/
- https://adsecurity.org/?p=4277
- https://www.mandiant.com/resources/detecting-microsoft-365-azure-active-directory-backdoors
- https://docs.microsoft.com/en-us/azure/active-directory/roles/security-planning
- https://docs.microsoft.com/en-us/azure/role-based-access-control/elevate-access-global-admin
- https://attack.mitre.org/techniques/T1098/003/
tags:
- attack.T1098_003
date: '2022-08-17'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    operationName: Add member to role
  selection_1:
    targetResources{}.modifiedProperties{}.newValue|contains: '*Global Administrator*'
  condition: selection_0 and selection_1
