title: Azure AD AzureHound UserAgent Detected
id: d62852db-a1f1-40db-a7fc-c3d56fa8bda3
status: stable
level: medium
author: Dean Luxton
description: This detection identifies the presence of the default AzureHound user-agent string within Microsoft Graph Activity logs and NonInteractive SignIn Logs. AzureHound is a tool used for gathering
  information about Azure Active Directory environments, often employed by security professionals for legitimate auditing purposes. However, it can also be leveraged by malicious actors to perform reconnaissance
  activities, mapping out the Azure AD infrastructure to identify potential vulnerabilities and targets for further exploitation. Detecting its usage can help in identifying unauthorized access attempts
  and preemptively mitigating potential security threats to your Azure environment.
references:
- https://github.com/SpecterOps/AzureHound
- https://splunkbase.splunk.com/app/3110
- https://splunk.github.io/splunk-add-on-for-microsoft-cloud-services/Install/
tags:
- attack.T1087_004
- attack.T1526
date: '2025-01-05'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category|contains:
    - MicrosoftGraphActivityLogs
    - NonInteractiveUserSignInLogs
  selection_1:
    userAgent|contains: azurehound*
  condition: selection_0 and selection_1
