title: Azure AD Admin Consent Bypassed by Service Principal
id: 9d4fea43-9182-4c5a-ada8-13701fd5615d
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic identifies instances where a service principal in Azure Active Directory assigns app roles without standard admin consent. It uses Entra ID logs from the `azure_monitor_aad`
  data source, focusing on the "Add app role assignment to service principal" operation. This detection is significant as it highlights potential bypasses of critical administrative consent processes, which
  could lead to unauthorized privileges being granted. If confirmed malicious, this activity could allow attackers to exploit automation to assign sensitive permissions without proper oversight, potentially
  compromising the security of the Azure AD environment.
references:
- https://attack.mitre.org/techniques/T1098/003/
tags:
- attack.T1098_003
date: '2024-02-14'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    operationName: Add app role assignment to service principal
  selection_1:
    operationName|contains: Add member to role*
  selection_2:
    src_user_type: servicePrincipal
  condition: selection_0 and selection_1 and selection_2
