title: Azure AD Concurrent Sessions From Different Ips
id: a9126f73-9a9b-493d-96ec-0dd06695490d
status: stable
level: medium
author: Mauricio Velazco, Bhavin Patel, Splunk
description: The following analytic detects an Azure AD account with concurrent sessions originating from multiple unique IP addresses within a 5-minute window. It leverages Azure Active Directory NonInteractiveUserSignInLogs
  to identify this behavior by analyzing successful authentication events and counting distinct source IPs. This activity is significant as it may indicate session hijacking, where an attacker uses stolen
  session cookies to access corporate resources from a different location. If confirmed malicious, this could lead to unauthorized access to sensitive information and potential data breaches.
references:
- https://attack.mitre.org/techniques/T1185/
- https://breakdev.org/evilginx-2-next-generation-of-phishing-2fa-tokens/
- https://github.com/kgretzky/evilginx2
tags:
- attack.T1185
date: '2023-01-24'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    authenticationDetails{}.succeeded: 'true'
  selection_1:
    category: NonInteractiveUserSignInLogs
  selection_2:
    action: success
  condition: selection_0 and selection_1 and selection_2
