title: Azure AD Multiple Service Principals Created by SP
id: 66cb378f-234d-4fe1-bb4c-e7878ff6b017
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects when a single service principal in Azure AD creates more than three unique OAuth applications within a 10-minute span. It leverages Azure AD audit logs, specifically
  monitoring the 'Add service principal' operation initiated by service principals. This behavior is significant as it may indicate an attacker using a compromised or malicious service principal to rapidly
  establish multiple service principals, potentially staging an attack. If confirmed malicious, this activity could facilitate network infiltration or expansion, allowing the attacker to gain unauthorized
  access and persist within the environment.
references:
- https://attack.mitre.org/techniques/T1136/003/
- https://www.microsoft.com/en-us/security/blog/2024/01/25/midnight-blizzard-guidance-for-responders-on-nation-state-attack/
tags:
- attack.T1136_003
date: '2024-02-14'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    operationName: Add service principal
  selection_1:
    initiatedBy.app.appId|contains: '*'
  condition: selection_0 and selection_1
