title: Azure AD Authentication Failed During MFA Challenge
id: e62c9c2e-bf51-4719-906c-3074618fcc1c
status: stable
level: medium
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk, 0xC0FFEEEE
description: The following analytic identifies failed authentication attempts against an Azure AD tenant during the Multi-Factor Authentication (MFA) challenge, specifically flagged by error code 500121.
  It leverages Azure AD SignInLogs to detect these events. This activity is significant as it may indicate an adversary attempting to authenticate using compromised credentials on an account with MFA enabled.
  If confirmed malicious, this could suggest an ongoing effort to bypass MFA protections, potentially leading to unauthorized access and further compromise of the affected account.
references:
- https://attack.mitre.org/techniques/T1621/
- https://attack.mitre.org/techniques/T1078/004/
- https://docs.microsoft.com/en-us/azure/active-directory/authentication/concept-mfa-howitworks
- https://learn.microsoft.com/en-us/entra/identity/monitoring-health/concept-sign-in-log-activity-details
tags:
- attack.t1078.004
- attack.t1586.003
- attack.t1621
date: '2022-07-14'
original_spl: '`azure_monitor_aad` category=SignInLogs properties.status.errorCode=500121 | rename properties.* as *, authenticationDetails{}.* as * | eval time=strptime(authenticationStepDateTime,"%Y-%m-%dT%H:%M:%S")
  | eval auth_detail=mvzip(strftime(time, "%Y-%m-%dT%H:%M:%S"),authenticationStepResultDetail," - "), auth_msg=mvappend(''status.additionalDetails'', authenticationStepResultDetail) | eval auth_method=mvmap(authenticationMethod,
  if(isnull(mvfind(''mfaDetail.authMethod'',authenticationMethod)), authenticationMethod, null())) | search NOT auth_msg="MFA successfully completed" | rename userAgent as user_agent | fillnull | stats
  count min(_time) as firstTime max(_time) as lastTime by dest user src vendor_account vendor_product auth_method auth_msg user_agent signature | `security_content_ctime(firstTime)` | `security_content_ctime(lastTime)`
  | `azure_ad_authentication_failed_during_mfa_challenge_filter`'
splunk_rule_id: e62c9c2e-bf51-4719-906c-3074618fcc1c
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category: SignInLogs
  selection_1:
    properties.status.errorCode: 500121
  condition: selection_0 and selection_1
