title: Azure AD Concurrent Sessions From Different Ips
id: a9126f73-9a9b-493d-96ec-0dd06695490d
status: stable
level: medium
author: Mauricio Velazco, Bhavin Patel, Splunk
description: The following analytic detects an Azure AD account with concurrent sessions originating from multiple unique IP addresses within a 5-minute window. It leverages Azure Active Directory NonInteractiveUserSignInLogs
  to identify this behavior by analyzing successful authentication events and counting distinct source IPs. This activity is significant as it may indicate session hijacking, where an attacker uses stolen
  session cookies to access corporate resources from a different location. If confirmed malicious, this could lead to unauthorized access to sensitive information and potential data breaches.
references:
- https://attack.mitre.org/techniques/T1185/
- https://breakdev.org/evilginx-2-next-generation-of-phishing-2fa-tokens/
- https://github.com/kgretzky/evilginx2
tags:
- attack.t1185
date: '2023-01-24'
original_spl: |-
  `azure_monitor_aad` properties.authenticationDetails{}.succeeded=true category=NonInteractiveUserSignInLogs action=success
    | rename properties.* as *
    | bucket span=5m _time
    | rename userAgent as user_agent
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime dc(src) as unique_ips values(dest) as dest values(src) as src values(user_agent) as user_agent
      BY user _time vendor_account
         vendor_product category
    | where unique_ips > 1
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `azure_ad_concurrent_sessions_from_different_ips_filter`
splunk_rule_id: a9126f73-9a9b-493d-96ec-0dd06695490d
splunk_rule_type: TTP
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    properties.authenticationDetails{}.succeeded: 'true'
  selection_1:
    category: NonInteractiveUserSignInLogs
  selection_2:
    action: success
  condition: selection_0 and selection_1 and selection_2
