title: Azure AD Privileged Authentication Administrator Role Assigned
id: a7da845d-6fae-41cf-b823-6c0b8c55814a
status: stable
level: medium
author: Mauricio Velazco, Gowthamaraj Rajendran, Splunk
description: The following analytic detects the assignment of the Privileged Authentication Administrator role to an Azure AD user. It leverages Azure Active Directory audit logs to identify when this specific
  role is assigned. This activity is significant because users in this role can set or reset authentication methods for any user, including those in privileged roles like Global Administrators. If confirmed
  malicious, an attacker could change credentials and assume the identity and permissions of high-privilege users, potentially leading to unauthorized access to sensitive information and critical configurations.
references:
- https://learn.microsoft.com/en-us/azure/active-directory/roles/permissions-reference#privileged-authentication-administrator
- https://posts.specterops.io/azure-privilege-escalation-via-azure-api-permissions-abuse-74aee1006f48
- https://learn.microsoft.com/en-us/azure/active-directory/roles/permissions-reference
tags:
- attack.T1003_002
date: '2023-04-25'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    '"operationName"': Add member to role
  selection_1:
    targetResources{}.modifiedProperties{}.newValue": \"Privileged Authentication Administrator\"
  condition: selection_0 and selection_1
