title: Azure AD Multiple AppIDs and UserAgents Authentication Spike
id: 5d8bb1f0-f65a-4b4e-af2e-fcdb88276314
status: stable
level: medium
author: Mauricio Velazco, Splunk
description: The following analytic detects unusual authentication activity in Azure AD, specifically when a single user account has over 8 authentication attempts using 3+ unique application IDs and 5+
  unique user agents within a short period. It leverages Azure AD audit logs, focusing on authentication events and using statistical thresholds. This behavior is significant as it may indicate an adversary
  probing for MFA requirements. If confirmed malicious, it suggests a compromised account, potentially leading to further exploitation, lateral movement, and data exfiltration. Early detection is crucial
  to prevent substantial harm.
references:
- https://attack.mitre.org/techniques/T1078/
- https://www.blackhillsinfosec.com/exploiting-mfa-inconsistencies-on-microsoft-services/
- https://github.com/dafthack/MFASweep
- https://www.youtube.com/watch?v=SK1zgqaAZ2E
tags:
- attack.T1078
date: '2023-11-16'
logsource:
  product: azure
  service: aad
detection:
  selection_0:
    category: SignInLogs
    operationName: Sign-in activity
    authenticationRequirement: multiFactorAuthentication
    status.additionalDetails: MFA required in Azure AD
  selection_1:
    authenticationRequirement: singleFactorAuthentication
    authenticationDetails{}.succeeded": 'true'
  condition: selection_0 and selection_1
