title: Azure Automation Runbook Created
id: 178d696d-6dc6-4ee8-9d25-93fee34eaf5b
status: stable
level: medium
author: Mauricio Velazco, Brian Serocki, Splunk
description: The following analytic detects the creation of a new Azure Automation Runbook within an Azure tenant. It leverages Azure Audit events, specifically the Azure Activity log category, to identify
  when a new Runbook is created or updated. This activity is significant because adversaries with privileged access can use Runbooks to maintain persistence, escalate privileges, or execute malicious code.
  If confirmed malicious, this could lead to unauthorized actions such as creating Global Administrators, executing code on VMs, and compromising the entire Azure environment.
references:
- https://docs.microsoft.com/en-us/azure/automation/overview
- https://docs.microsoft.com/en-us/azure/automation/automation-runbook-types
- https://docs.microsoft.com/en-us/azure/automation/manage-runbooks
- https://www.inversecos.com/2021/12/how-to-detect-malicious-azure.html
- https://www.netspi.com/blog/technical/cloud-penetration-testing/maintaining-azure-persistence-via-automation-accounts/
- https://microsoft.github.io/Azure-Threat-Research-Matrix/Persistence/AZT503/AZT503-3/
- https://attack.mitre.org/techniques/T1136/003/
tags:
- attack.T1136_003
date: '2022-08-22'
logsource:
  product: azure
  service: audit
detection:
  selection_0:
    value: Microsoft.Automation/automationAccounts/runbooks/write
  selection_1:
    object!|contains: AzureAutomationTutorial*
  selection_2:
    value: Succeeded
  condition: selection_0 and selection_1 and selection_2
