title: Microsoft Intune Device Health Scripts
id: 6fe42e07-15b1-4caa-b547-7885666cb1bd
status: stable
level: medium
author: Dean Luxton
description: Microsoft Intune device remediation scripts are a tool administrators can use to remotely manage devices, this functionality can also be abused for SYSTEM level code execution and lateral movement
  to intune managed devices. This detection identifies when a new device health script has been added, updated or deleted.
references:
- https://posts.specterops.io/death-from-above-lateral-movement-from-azure-to-on-prem-ad-d18cb3959d4d
- https://securityintelligence.com/x-force/detecting-intune-lateral-movement/
- https://posts.specterops.io/maestro-9ed71d38d546
tags:
- attack.T1072
- attack.T1021_007
- attack.T1202
- attack.T1105
date: '2025-01-06'
logsource:
  product: azure
  service: activity
detection:
  selection_0:
    operationName|contains: '*DeviceHealthScript*'
  condition: selection_0
