title: Microsoft Intune Mobile Apps
id: 98e6b389-2806-4426-a580-8a92cb0d9710
status: experimental
level: medium
author: Dean Luxton
description: |
  Microsoft Intune supports deploying packaged applications to support software deployment, this functionality can also be abused for deploying malicious payloads to intune managed devices.
  This detection identifies when a new packaged application has been added, updated or deleted.
references:
- https://posts.specterops.io/death-from-above-lateral-movement-from-azure-to-on-prem-ad-d18cb3959d4d
- https://securityintelligence.com/x-force/detecting-intune-lateral-movement/
- https://posts.specterops.io/maestro-9ed71d38d546
tags:
- attack.T1072
- attack.T1021_007
- attack.T1202
- attack.T1105
date: '2025-01-06'
logsource:
  product: azure
  service: activity
detection:
  selection_0:
    operationName|contains: '*MobileApp*'
  condition: selection_0
