title: Microsoft Intune DeviceManagementConfigurationPolicies
id: 3c49e5ed-625c-408c-a2c7-8e2b524efb2c
status: stable
level: medium
author: Dean Luxton
description: Microsoft Intune device management configuration policies are a tool administrators can use to remotely manage policies and settings on intune managed devices. This functionality can also be
  abused to disable defences & evade detection. This detection identifies when a new device management configuration policy has been created.
references:
- https://posts.specterops.io/death-from-above-lateral-movement-from-azure-to-on-prem-ad-d18cb3959d4d
- https://securityintelligence.com/x-force/detecting-intune-lateral-movement/
- https://posts.specterops.io/maestro-9ed71d38d546
tags:
- attack.T1072
- attack.T1484
- attack.T1021_007
- attack.T1685
- attack.T1686
date: '2025-01-06'
logsource:
  product: azure
  service: activity
detection:
  selection_0:
    operationName|contains: '* DeviceManagementConfigurationPolicy*'
  condition: selection_0
