title: Microsoft Intune Bulk Wipe
id: c3f48aa9-878e-443f-8889-e42a11a9bea9
status: stable
level: medium
author: Jake Enea
description: |-
  The following analytic detects a high volume of "wipe ManagedDevice" events from the Intune admin portal (5+ per hour by default).
  It leverages Intune audit logs to identify when this action is triggered. This activity is significant beacuse the "wipe ManagedDevice" action factory resets devices connected to your Microsoft Intune tenant.
  If confirmed malicious, an attacker can abuse this action to perform a large-scale data wiping attack against your managed endpoints.
references:
- https://www.lumos.com/blog/stryker-hack
- https://www.covertswarm.com/post/swarm-intelligence-strykers-intune-wipe-proves-your-bcdr-plan-has-a-single-point-of-failure
- https://www.wwt.com/blog/how-the-stryker-intune-wipe-incident-highlights-a-critical-gap-in-endpoint-control
tags:
- attack.T1561_001
date: '2026-04-15'
logsource:
  product: azure
  service: activity
detection:
  selection_0:
    operationName: wipe ManagedDevice
  condition: selection_0
