title: Microsoft Intune Device Health Scripts
id: 6fe42e07-15b1-4caa-b547-7885666cb1bd
status: stable
level: medium
author: Dean Luxton
description: Microsoft Intune device remediation scripts are a tool administrators can use to remotely manage devices, this functionality can also be abused for SYSTEM level code execution and lateral movement
  to intune managed devices. This detection identifies when a new device health script has been added, updated or deleted.
references:
- https://posts.specterops.io/death-from-above-lateral-movement-from-azure-to-on-prem-ad-d18cb3959d4d
- https://securityintelligence.com/x-force/detecting-intune-lateral-movement/
- https://posts.specterops.io/maestro-9ed71d38d546
tags:
- attack.t1072
- attack.t1021.007
- attack.t1202
- attack.t1105
date: '2025-01-06'
original_spl: '`azure_monitor_activity` operationName="*DeviceHealthScript*" | rename identity as user, properties.TargetObjectIds{} as TargetObjectId, properties.TargetDisplayNames{} as TargetDisplayName,
  properties.Actor.IsDelegatedAdmin as user_isDelegatedAdmin | rex field="operationName" "^(?P<action>\w+?)DeviceHealthScript" | replace "patch" with "updated", "create" with "created", "delete", with "deleted",
  "assign", with "assigned" IN action | table _time operationName action user user_type user_isDelegatedAdmin TargetDisplayName TargetObjectId status tenantId correlationId | `microsoft_intune_device_health_scripts_filter`'
splunk_rule_id: 6fe42e07-15b1-4caa-b547-7885666cb1bd
splunk_rule_type: Hunting
logsource:
  product: azure
  service: activity
detection:
  selection_0:
    operationName|contains: DeviceHealthScript
  condition: selection_0
