title: Kubernetes Abuse of Secret by Unusual User Group
id: b6f45bbc-4ea9-4068-b3bc-0477f6997ae2
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects unauthorized access or misuse of Kubernetes Secrets by unusual user groups. It leverages Kubernetes Audit logs to identify anomalies in access patterns by analyzing
  the source of requests and user groups. This activity is significant for a SOC as Kubernetes Secrets store sensitive information like passwords, OAuth tokens, and SSH keys. If confirmed malicious, this
  behavior could indicate an attacker attempting to exfiltrate or misuse these secrets, potentially leading to unauthorized access to sensitive systems or data.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1552.007
date: '2023-12-20'
original_spl: |-
  `kube_audit` objectRef.resource=secrets verb=get
    | search NOT `kube_allowed_user_groups`
    | fillnull
    | stats count
      BY objectRef.name objectRef.namespace objectRef.resource
         requestReceivedTimestamp requestURI responseStatus.code
         sourceIPs{} stage user.groups{}
         user.uid user.username userAgent
         verb
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_abuse_of_secret_by_unusual_user_group_filter`
splunk_rule_id: b6f45bbc-4ea9-4068-b3bc-0477f6997ae2
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    objectRef.resource: secrets
  selection_1:
    verb: get
  condition: selection_0 and selection_1
