title: Kubernetes Create or Update Privileged Pod
id: 3c6bd734-334d-4818-ae7c-5234313fc5da
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation or update of privileged pods in Kubernetes. It identifies this activity by monitoring Kubernetes Audit logs for pod configurations that include root
  privileges. This behavior is significant for a SOC as it could indicate an attempt to escalate privileges, exploit the kernel, and gain full access to the host's namespace and devices. If confirmed malicious,
  this activity could lead to unauthorized access to sensitive information, data breaches, and service disruptions, posing a severe threat to the environment.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1204
date: '2024-01-30'
original_spl: |-
  `kube_audit` objectRef.resource=pods verb=create OR verb=update requestObject.metadata.annotations.kubectl.kubernetes.io/last-applied-configuration=*\"privileged\":true*
    | fillnull
    | stats count values(user.groups{}) as user_groups
      BY kind objectRef.name objectRef.namespace
         objectRef.resource requestObject.kind responseStatus.code
         sourceIPs{} stage user.username
         userAgent verb requestObject.metadata.annotations.kubectl.kubernetes.io/last-applied-configuration
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_create_or_update_privileged_pod_filter`
splunk_rule_id: 3c6bd734-334d-4818-ae7c-5234313fc5da
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    objectRef.resource: pods
    verb: create
  selection_1:
    verb: update
    requestObject.metadata.annotations.kubectl.kubernetes.io/last-applied-configuration|endswith: '*\'
  condition: selection_0 and selection_1
