title: Kubernetes Access Scanning
id: 2f4abe6d-5991-464d-8216-f90f42999764
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects potential scanning activities within a Kubernetes environment. It identifies unauthorized access attempts, probing of public APIs, or attempts to exploit known
  vulnerabilities by monitoring Kubernetes audit logs for repeated failed access attempts or unusual API requests. This activity is significant for a SOC as it may indicate an attacker's preliminary reconnaissance
  to gather information about the system. If confirmed malicious, this activity could lead to unauthorized access to sensitive systems or data, posing a severe security risk.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1046
date: '2023-12-20'
original_spl: |-
  `kube_audit` "user.groups{}"="system:unauthenticated" "responseStatus.code"=403
    | iplocation sourceIPs{}
    | stats count values(userAgent) as userAgent values(user.username) as user.username values(user.groups{}) as user.groups{} values(verb) as verb values(requestURI) as requestURI values(responseStatus.code) as responseStatus.code values(responseStatus.message) as responseStatus.message values(responseStatus.reason) as responseStatus.reason values(responseStatus.status) as responseStatus.status
      BY sourceIPs{} Country City
    | where count > 5
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_access_scanning_filter`
splunk_rule_id: 2f4abe6d-5991-464d-8216-f90f42999764
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    '"user.groups{}"': system:unauthenticated
  selection_1:
    '"responseStatus.code"': 403
  condition: selection_0 and selection_1
