title: Kubernetes Pod Created in Default Namespace
id: 3d6b1a81-367b-42d5-a925-6ef90b6b9f1e
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation of Kubernetes pods in the default, kube-system, or kube-public namespaces. It leverages Kubernetes audit logs to identify pod creation events within
  these specific namespaces. This activity is significant for a SOC as it may indicate an attacker attempting to hide their presence or evade defenses. Unauthorized pod creation in these namespaces can
  suggest a successful cluster breach, potentially leading to privilege escalation, persistent access, or further malicious activities within the cluster.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1204
date: '2023-12-20'
original_spl: |-
  `kube_audit` objectRef.resource=pods verb=create objectRef.namespace IN ("default", "kube-system", "kube-public")
    | fillnull
    | stats count
      BY objectRef.name objectRef.namespace objectRef.resource
         requestReceivedTimestamp requestURI responseStatus.code
         sourceIPs{} stage user.groups{}
         user.uid user.username userAgent
         verb
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_pod_created_in_default_namespace_filter`
splunk_rule_id: 3d6b1a81-367b-42d5-a925-6ef90b6b9f1e
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    objectRef.resource: pods
  selection_1:
    verb: create
  selection_2:
    objectRef.namespace:
    - default
    - kube-system
    - kube-public
  condition: selection_0 and selection_1 and selection_2
