title: Kubernetes Node Port Creation
id: d7fc865e-b8a1-4029-a960-cf4403b821b6
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation of a Kubernetes NodePort service, which exposes a service to the external network. It identifies this activity by monitoring Kubernetes Audit logs
  for the creation of NodePort services. This behavior is significant for a SOC as it could allow an attacker to access internal services, posing a threat to the Kubernetes infrastructure's integrity and
  security. If confirmed malicious, this activity could lead to data breaches, service disruptions, or unauthorized access to sensitive information.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1204
date: '2023-12-20'
original_spl: |-
  `kube_audit` "objectRef.resource"=services verb=create requestObject.spec.type=NodePort
    | fillnull
    | stats count values(user.groups{}) as user_groups
      BY kind objectRef.name objectRef.namespace
         objectRef.resource requestObject.kind requestObject.spec.type
         responseStatus.code sourceIPs{} stage
         user.username userAgent verb
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_node_port_creation_filter`
splunk_rule_id: d7fc865e-b8a1-4029-a960-cf4403b821b6
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    '"objectRef.resource"': services
  selection_1:
    verb: create
  selection_2:
    requestObject.spec.type: NodePort
  condition: selection_0 and selection_1 and selection_2
