title: Kubernetes Scanning by Unauthenticated IP Address
id: f9cadf4e-df22-4f4e-a08f-9d3344c2165d
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies potential scanning activities within a Kubernetes environment by unauthenticated IP addresses. It leverages Kubernetes audit logs to detect multiple unauthorized
  access attempts (HTTP 403 responses) from the same source IP. This activity is significant as it may indicate an attacker probing for vulnerabilities or attempting to exploit known issues. If confirmed
  malicious, such scanning could lead to unauthorized access, data breaches, or further exploitation of the Kubernetes infrastructure, compromising the security and integrity of the environment.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1046
date: '2023-12-20'
original_spl: |-
  `kube_audit` "user.groups{}"="system:unauthenticated" "responseStatus.code"=403
    | iplocation sourceIPs{}
    | stats count values(userAgent) as userAgent values(user.username) as user.username values(user.groups{}) as user.groups{} values(verb) as verb values(requestURI) as requestURI values(responseStatus.code) as responseStatus.code values(responseStatus.message) as responseStatus.message values(responseStatus.reason) as responseStatus.reason values(responseStatus.status) as responseStatus.status
      BY sourceIPs{} Country City
    | where count > 5
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_scanning_by_unauthenticated_ip_address_filter`
splunk_rule_id: f9cadf4e-df22-4f4e-a08f-9d3344c2165d
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    '"user.groups{}"': system:unauthenticated
  selection_1:
    '"responseStatus.code"': 403
  condition: selection_0 and selection_1
