title: Kubernetes Abuse of Secret by Unusual Location
id: 40a064c1-4ec1-4381-9e35-61192ba8ef82
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects unauthorized access or misuse of Kubernetes Secrets from unusual locations. It leverages Kubernetes Audit logs to identify anomalies in access patterns by analyzing
  the source of requests by country. This activity is significant for a SOC as Kubernetes Secrets store sensitive information like passwords, OAuth tokens, and SSH keys, making them critical assets. If
  confirmed malicious, this behavior could indicate an attacker attempting to exfiltrate or misuse these secrets, potentially leading to unauthorized access to sensitive systems or data.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1552.007
date: '2023-12-20'
original_spl: |-
  `kube_audit` objectRef.resource=secrets verb=get
    | iplocation sourceIPs{}
    | fillnull
    | search NOT `kube_allowed_locations`
    | stats count
      BY objectRef.name objectRef.namespace objectRef.resource
         requestReceivedTimestamp requestURI responseStatus.code
         sourceIPs{} stage user.groups{}
         user.uid user.username userAgent
         verb City Country
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_abuse_of_secret_by_unusual_location_filter`
splunk_rule_id: 40a064c1-4ec1-4381-9e35-61192ba8ef82
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    objectRef.resource: secrets
  selection_1:
    verb: get
  condition: selection_0 and selection_1
