title: Kubernetes Pod With Host Network Attachment
id: cce357cf-43a4-494a-814b-67cea90fe990
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation or update of a Kubernetes pod with host network attachment. It leverages Kubernetes Audit logs to identify pods configured with host network settings.
  This activity is significant for a SOC as it could allow an attacker to monitor all network traffic on the node, potentially capturing sensitive information and escalating privileges. If confirmed malicious,
  this could lead to unauthorized access, data breaches, and service disruptions, severely impacting the security and integrity of the Kubernetes environment.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1204
date: '2024-01-30'
original_spl: |-
  `kube_audit` objectRef.resource=pods verb=create OR verb=update requestObject.metadata.annotations.kubectl.kubernetes.io/last-applied-configuration=*\"hostNetwork\":true*
    | fillnull
    | stats count values(user.groups{}) as user_groups
      BY kind objectRef.name objectRef.namespace
         objectRef.resource requestObject.kind responseStatus.code
         sourceIPs{} stage user.username
         userAgent verb requestObject.metadata.annotations.kubectl.kubernetes.io/last-applied-configuration
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_pod_with_host_network_attachment_filter`
splunk_rule_id: cce357cf-43a4-494a-814b-67cea90fe990
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    objectRef.resource: pods
    verb: create
  selection_1:
    verb: update
    requestObject.metadata.annotations.kubectl.kubernetes.io/last-applied-configuration|endswith: '*\'
  condition: selection_0 and selection_1
