title: Kubernetes AWS detect suspicious kubectl calls
id: 042a3d32-8318-4763-9679-09db2644a8f2
status: experimental
level: medium
author: Rod Soto, Patrick Bareiss, Splunk
description: The following analytic detects anonymous and unauthenticated requests to a Kubernetes cluster. It identifies this behavior by monitoring API calls from users who have not provided any token
  or password in their request, using data from `kube_audit` logs. This activity is significant for a SOC as it indicates a severe misconfiguration, allowing unfettered access to the cluster with no traceability.
  If confirmed malicious, an attacker could gain access to sensitive data or control over the cluster, posing a substantial security risk.
date: '2020-06-23'
original_spl: |-
  `kube_audit` user.username="system:anonymous" user.groups{} IN ("system:unauthenticated")
    | fillnull
    | stats count
      BY objectRef.name objectRef.namespace objectRef.resource
         requestReceivedTimestamp requestURI responseStatus.code
         sourceIPs{} stage user.groups{}
         user.uid user.username userAgent
         verb
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_aws_detect_suspicious_kubectl_calls_filter`
splunk_rule_id: 042a3d32-8318-4763-9679-09db2644a8f2
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    user.username: system:anonymous
  selection_1:
    user.groups{}: system:unauthenticated
  condition: selection_0 and selection_1
