title: Kubernetes DaemonSet Deployed
id: bf39c3a3-b191-4d42-8738-9d9797bd0c3a
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation of a DaemonSet in a Kubernetes cluster. This behavior is identified by monitoring Kubernetes Audit logs for the creation event of a DaemonSet. DaemonSets
  ensure a specific pod runs on every node, making them a potential vector for persistent access. This activity is significant for a SOC as it could indicate an attempt to maintain persistent access to
  the Kubernetes infrastructure. If confirmed malicious, it could lead to persistent attacks, service disruptions, or unauthorized access to sensitive information.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1204
date: '2023-12-20'
original_spl: |-
  `kube_audit` "objectRef.resource"=daemonsets verb=create
    | fillnull
    | stats count values(user.groups{}) as user_groups
      BY kind objectRef.name objectRef.namespace
         objectRef.resource requestObject.kind responseStatus.code
         sourceIPs{} stage user.username
         userAgent verb
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_daemonset_deployed_filter`
splunk_rule_id: bf39c3a3-b191-4d42-8738-9d9797bd0c3a
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    '"objectRef.resource"': daemonsets
  selection_1:
    verb: create
  condition: selection_0 and selection_1
