title: Kubernetes Cron Job Creation
id: 5984dbe8-572f-47d7-9251-3dff6c3f0c0d
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation of a Kubernetes cron job, which is a task scheduled to run automatically at specified intervals. It identifies this activity by monitoring Kubernetes
  Audit logs for the creation events of cron jobs. This behavior is significant for a SOC as it could allow an attacker to execute malicious tasks repeatedly and automatically, posing a threat to the Kubernetes
  infrastructure. If confirmed malicious, this activity could lead to persistent attacks, service disruptions, or unauthorized access to sensitive information.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.t1053.007
date: '2024-01-30'
original_spl: |-
  `kube_audit` verb=create "objectRef.resource"=cronjobs
    | fillnull
    | stats count values(user.groups{}) as user_groups
      BY kind objectRef.name objectRef.namespace
         objectRef.resource requestObject.kind requestObject.spec.schedule
         requestObject.spec.jobTemplate.spec.template.spec.containers{}.image responseStatus.code sourceIPs{}
         stage user.username userAgent
         verb
    | rename sourceIPs{} as src_ip, user.username as user
    | `kubernetes_cron_job_creation_filter`
splunk_rule_id: 5984dbe8-572f-47d7-9251-3dff6c3f0c0d
splunk_rule_type: Anomaly
logsource:
  product: kubernetes
detection:
  selection_0:
    verb: create
  selection_1:
    '"objectRef.resource"': cronjobs
  condition: selection_0 and selection_1
