title: AWS ECR Container Upload Outside Business Hours
id: d4c4d4eb-3994-41ca-a25e-a82d64e125bb
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the upload of a new container image to AWS Elastic Container Registry (ECR) outside of standard business hours. It leverages AWS CloudTrail logs to identify `PutImage`
  events occurring between 8 PM and 8 AM or on weekends. This activity is significant because container uploads outside business hours can indicate unauthorized or suspicious activity, potentially pointing
  to a compromised account or insider threat. If confirmed malicious, this could allow an attacker to deploy unauthorized or malicious containers, leading to potential data breaches or service disruptions.
references:
- https://attack.mitre.org/techniques/T1204/003/
tags:
- attack.T1204_003
date: '2021-08-19'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: ecr.amazonaws.com
    eventName: PutImage
    date_hour: 20
  selection_1:
    date_hour: 8
  selection_2:
    date_wday: saturday
  selection_3:
    date_wday: sunday
  condition: selection_0 and selection_1 and selection_2 and selection_3
