title: AWS Defense Evasion PutBucketLifecycle
id: ce1c0e2b-9303-4903-818b-0d9002fc6ea4
status: stable
level: medium
author: Bhavin Patel
description: The following analytic detects `PutBucketLifecycle` events in AWS CloudTrail logs where a user sets a lifecycle rule for an S3 bucket with an expiration period of fewer than three days. This
  detection leverages CloudTrail logs to identify suspicious lifecycle configurations. This activity is significant because attackers may use it to delete CloudTrail logs quickly, thereby evading detection
  and impairing forensic investigations. If confirmed malicious, this could allow attackers to cover their tracks, making it difficult to trace their actions and respond to the breach effectively.
references:
- https://stratus-red-team.cloud/attack-techniques/AWS/aws.defense-evasion.cloudtrail-lifecycle-rule/
tags:
- attack.T1485_001
- attack.T1685_002
date: '2022-07-25'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: PutBucketLifecycle
  selection_1:
    user_type: IAMUser
  selection_2:
    errorCode: success
  condition: selection_0 and selection_1 and selection_2
