title: AWS Excessive Security Scanning
id: 1fdd164a-def8-4762-83a9-9ffe24e74d5a
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies excessive security scanning activities in AWS by detecting a high number of Describe, List, or Get API calls from a single user. It leverages AWS CloudTrail
  logs to count distinct event names and flags users with more than 50 such events. This behavior is significant as it may indicate reconnaissance activities by an attacker attempting to map out your AWS
  environment. If confirmed malicious, this could lead to unauthorized access, data exfiltration, or further exploitation of your cloud infrastructure.
references:
- https://github.com/aquasecurity/cloudsploit
tags:
- attack.T1526
date: '2021-04-13'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName|contains: Describe*
  selection_1:
    eventName|contains: List*
  selection_2:
    eventName|contains: Get*
  condition: selection_0 and selection_1 and selection_2
