title: AWS Console Login Failed During MFA Challenge
id: 55349868-5583-466f-98ab-d3beb321961e
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies failed authentication attempts to the AWS Console during the Multi-Factor Authentication (MFA) challenge. It leverages AWS CloudTrail logs, specifically the
  `additionalEventData` field, to detect when MFA was used but the login attempt still failed. This activity is significant as it may indicate an adversary attempting to access an account with compromised
  credentials but being thwarted by MFA. If confirmed malicious, this could suggest an ongoing attempt to breach the account, potentially leading to unauthorized access and further attacks if MFA is bypassed.
references:
- https://attack.mitre.org/techniques/T1621/
- https://aws.amazon.com/what-is/mfa/
tags:
- attack.t1586.003
- attack.t1621
date: '2022-10-03'
original_spl: |-
  `cloudtrail` eventName= ConsoleLogin errorMessage="Failed authentication" additionalEventData.MFAUsed = "Yes"
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product additionalEventData.MFAUsed
         errorMessage
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_console_login_failed_during_mfa_challenge_filter`
splunk_rule_id: 55349868-5583-466f-98ab-d3beb321961e
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: ConsoleLogin
  selection_1:
    errorMessage: Failed authentication
  selection_2:
    additionalEventData.MFAUsed: 'Yes'
  condition: selection_0 and selection_1 and selection_2
