title: AWS UpdateLoginProfile
id: 2a9b80d3-6a40-4115-11ad-212bf3d0d111
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects an AWS CloudTrail event where a user with permissions updates the login profile of another user. It leverages CloudTrail logs to identify instances where the
  user making the change is different from the user whose profile is being updated. This activity is significant because it can indicate privilege escalation attempts, where an attacker uses a compromised
  account to gain higher privileges. If confirmed malicious, this could allow the attacker to escalate their privileges, potentially leading to unauthorized access and control over sensitive resources within
  the AWS environment.
references:
- https://bishopfox.com/blog/privilege-escalation-in-aws
- https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
tags:
- attack.t1136.003
date: '2021-03-02'
original_spl: |-
  `cloudtrail` eventName = UpdateLoginProfile userAgent !=console.amazonaws.com errorCode = success
    | eval match=if(match(userIdentity.userName,requestParameters.userName), 1,0)
    | search match=0
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_updateloginprofile_filter`
splunk_rule_id: 2a9b80d3-6a40-4115-11ad-212bf3d0d111
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: UpdateLoginProfile
  selection_1:
    userAgent: console.amazonaws.com
  selection_2:
    errorCode: success
  condition: selection_0 and selection_1 and selection_2
