title: AWS Credential Access RDS Password reset
id: 6153c5ea-ed30-4878-81e6-21ecdb198189
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects the resetting of the master user password for an Amazon RDS DB instance. It leverages AWS CloudTrail logs to identify events where the `ModifyDBInstance` API
  call includes a new `masterUserPassword` parameter. This activity is significant because unauthorized password resets can grant attackers access to sensitive data stored in production databases, such
  as credit card information, PII, and healthcare data. If confirmed malicious, this could lead to data breaches, regulatory non-compliance, and significant reputational damage. Immediate investigation
  is required to determine the legitimacy of the password reset.
references:
- https://aws.amazon.com/premiumsupport/knowledge-center/reset-master-user-password-rds
tags:
- attack.T1110
- attack.T1586_003
date: '2022-08-07'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: rds.amazonaws.com
  selection_1:
    eventName: ModifyDBInstance
  selection_2:
    masterUserPassword"|contains: '*'
  condition: selection_0 and selection_1 and selection_2
