title: AWS ECR Container Upload Outside Business Hours
id: d4c4d4eb-3994-41ca-a25e-a82d64e125bb
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the upload of a new container image to AWS Elastic Container Registry (ECR) outside of standard business hours. It leverages AWS CloudTrail logs to identify `PutImage`
  events occurring between 8 PM and 8 AM or on weekends. This activity is significant because container uploads outside business hours can indicate unauthorized or suspicious activity, potentially pointing
  to a compromised account or insider threat. If confirmed malicious, this could allow an attacker to deploy unauthorized or malicious containers, leading to potential data breaches or service disruptions.
references:
- https://attack.mitre.org/techniques/T1204/003/
tags:
- attack.t1204.003
date: '2021-08-19'
original_spl: |-
  `cloudtrail` eventSource=ecr.amazonaws.com eventName=PutImage date_hour>=20 OR date_hour<8 OR date_wday=saturday OR date_wday=sunday
    | rename requestParameters.* as *
    | rename repositoryName AS repository
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature user user_agent
         src vendor_account vendor_region
         vendor_product repository
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_ecr_container_upload_outside_business_hours_filter`
splunk_rule_id: d4c4d4eb-3994-41ca-a25e-a82d64e125bb
splunk_rule_type: Anomaly
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: ecr.amazonaws.com
    eventName: PutImage
    date_hour: 20
  selection_1:
    date_hour: 8
  selection_2:
    date_wday: saturday
  selection_3:
    date_wday: sunday
  condition: selection_0 and selection_1 and selection_2 and selection_3
