title: AWS Create Policy Version to allow all resources
id: 2a9b80d3-6340-4345-b5ad-212bf3d0dac4
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies the creation of a new AWS IAM policy version that allows access to all resources. It detects this activity by analyzing AWS CloudTrail logs for the CreatePolicyVersion
  event with a policy document that grants broad permissions. This behavior is significant because it violates the principle of least privilege, potentially exposing the environment to misuse or abuse.
  If confirmed malicious, an attacker could gain extensive access to AWS resources, leading to unauthorized actions, data exfiltration, or further compromise of the AWS environment.
references:
- https://bishopfox.com/blog/privilege-escalation-in-aws
- https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
tags:
- attack.t1078.004
date: '2021-02-22'
original_spl: |-
  `cloudtrail` eventName=CreatePolicyVersion eventSource = iam.amazonaws.com errorCode = success
    | spath input=requestParameters.policyDocument output=key_policy_statements path=Statement{}
    | mvexpand key_policy_statements
    | spath input=key_policy_statements output=key_policy_action_1 path=Action
    | where key_policy_action_1 = "*"
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime values(key_policy_statements) as policy_added
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_create_policy_version_to_allow_all_resources_filter`
splunk_rule_id: 2a9b80d3-6340-4345-b5ad-212bf3d0dac4
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: CreatePolicyVersion
  selection_1:
    eventSource: iam.amazonaws.com
  selection_2:
    errorCode: success
  condition: selection_0 and selection_1 and selection_2
