title: AWS New MFA Method Registered For User
id: 4e3c26f2-4fb9-4bd7-ab46-1b76ffa2a23b
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the registration of a new Multi-Factor Authentication (MFA) method for an AWS account. It leverages AWS CloudTrail logs to identify the `CreateVirtualMFADevice`
  event. This activity is significant because adversaries who gain unauthorized access to an AWS account may register a new MFA method to maintain persistence. If confirmed malicious, this could allow attackers
  to secure their access, making it difficult to detect and remove their presence, potentially leading to further unauthorized activities and data breaches.
references:
- https://aws.amazon.com/blogs/security/you-can-now-assign-multiple-mfa-devices-in-iam/
- https://attack.mitre.org/techniques/T1556/
- https://attack.mitre.org/techniques/T1556/006/
- https://twitter.com/jhencinski/status/1618660062352007174
tags:
- attack.T1556_006
date: '2023-01-31'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: CreateVirtualMFADevice
  condition: selection_0
