title: AWS IAM Assume Role Policy Brute Force
id: f19e09b0-9308-11eb-b7ec-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects multiple failed attempts to assume an AWS IAM role, indicating a potential brute force attack. It leverages AWS CloudTrail logs to identify `MalformedPolicyDocumentException`
  errors with a status of `failure` and filters out legitimate AWS services. This activity is significant as repeated failures to assume roles can indicate an adversary attempting to guess role names, which
  is a precursor to unauthorized access. If confirmed malicious, this could lead to unauthorized access to AWS resources, potentially compromising sensitive data and services.
references:
- https://www.praetorian.com/blog/aws-iam-assume-role-vulnerabilities/
- https://rhinosecuritylabs.com/aws/assume-worst-aws-assume-role-enumeration/
- https://www.elastic.co/guide/en/security/current/aws-iam-brute-force-of-assume-role-policy.html
tags:
- attack.t1580
- attack.t1110
date: '2021-04-06'
original_spl: |-
  `cloudtrail` (errorCode=MalformedPolicyDocumentException) status=failure (userAgent!=*.amazonaws.com)
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime values(requestParameters.policyName) as policy_name
      BY src, user, vendor_account
         vendor_region, vendor_product, signature,
         dest, errorCode
    | where count >= 2
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_iam_assume_role_policy_brute_force_filter`
splunk_rule_id: f19e09b0-9308-11eb-b7ec-acde48001122
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    errorCode: MalformedPolicyDocumentException
  selection_1:
    status: failure
  selection_2:
    userAgent|endswith: .amazonaws.com
  condition: selection_0 and selection_1 and selection_2
