title: AWS Bedrock Delete Model Invocation Logging Configuration
id: 9c5e3d62-f743-11ee-9f6e-acde48001124
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies attempts to delete AWS Bedrock model invocation logging configurations. It leverages AWS CloudTrail logs to detect when a user or service calls the DeleteModelInvocationLogging
  API. This activity is significant as it may indicate an adversary attempting to remove audit trails of model interactions after compromising credentials. Deleting model invocation logs could allow attackers
  to interact with AI models without leaving traces, potentially enabling them to conduct data exfiltration, prompt injection attacks, or other malicious activities without detection. If confirmed malicious,
  this could represent a deliberate attempt to hide unauthorized model usage and evade detection.
references:
- https://www.sumologic.com/blog/defenders-guide-to-aws-bedrock/
- https://attack.mitre.org/techniques/T1562/008/
tags:
- attack.T1685_002
date: '2025-03-25'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: bedrock.amazonaws.com
  selection_1:
    eventName: DeleteModelInvocationLoggingConfiguration
  condition: selection_0 and selection_1
