title: AWS Successful Single-Factor Authentication
id: a520b1fe-cc9e-4f56-b762-18354594c52f
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies a successful Console Login authentication event for an AWS IAM user account without Multi-Factor Authentication (MFA) enabled. It leverages AWS CloudTrail
  logs to detect instances where MFA was not used during login. This activity is significant as it may indicate a misconfiguration, policy violation, or potential account takeover attempt. If confirmed
  malicious, an attacker could gain unauthorized access to the AWS environment, potentially leading to data exfiltration, resource manipulation, or further privilege escalation.
references:
- https://attack.mitre.org/techniques/T1621/
- https://attack.mitre.org/techniques/T1078/004/
- https://aws.amazon.com/what-is/mfa/
tags:
- attack.t1078.004
- attack.t1586.003
date: '2022-10-04'
original_spl: |-
  `cloudtrail` eventName= ConsoleLogin errorCode=success "additionalEventData.MFAUsed"=No
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_successful_single_factor_authentication_filter`
splunk_rule_id: a520b1fe-cc9e-4f56-b762-18354594c52f
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: ConsoleLogin
  selection_1:
    errorCode: success
  selection_2:
    '"additionalEventData.MFAUsed"': 'No'
  condition: selection_0 and selection_1 and selection_2
