title: AWS Multiple Users Failing To Authenticate From Ip
id: 71e1fb89-dd5f-4691-8523-575420de4630
status: stable
level: medium
author: Bhavin Patel
description: The following analytic identifies a single source IP failing to authenticate into the AWS Console with 30 unique valid users within 10 minutes. It leverages CloudTrail logs to detect multiple
  failed login attempts from the same IP address. This behavior is significant as it may indicate a Password Spraying attack, where an adversary attempts to gain unauthorized access or elevate privileges
  by trying common passwords across many accounts. If confirmed malicious, this activity could lead to unauthorized access, data breaches, or further exploitation within the AWS environment.
references:
- https://attack.mitre.org/techniques/T1110/003/
- https://www.whiteoaksecurity.com/blog/goawsconsolespray-password-spraying-tool/
- https://softwaresecuritydotblog.wordpress.com/2019/09/28/how-to-protect-against-credential-stuffing-on-aws/
tags:
- attack.t1110.003
- attack.t1110.004
date: '2022-09-26'
original_spl: |-
  `cloudtrail` eventName=ConsoleLogin action=failure
    | bucket span=10m _time
    | rename user_name as user
    | stats  dc(user) AS unique_accounts values(user) as user values(user_agent) as user_agent
      BY _time, src, signature,
         dest, vendor_account, vendor_region,
         vendor_product
    | where unique_accounts>30
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_multiple_users_failing_to_authenticate_from_ip_filter`
splunk_rule_id: 71e1fb89-dd5f-4691-8523-575420de4630
splunk_rule_type: Anomaly
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: ConsoleLogin
  selection_1:
    action: failure
  condition: selection_0 and selection_1
