title: AWS IAM Successful Group Deletion
id: e776d06c-9267-11eb-819b-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies the successful deletion of an IAM group in AWS. It leverages CloudTrail logs to detect `DeleteGroup` events with a success status. This activity is significant
  as it could indicate potential changes in user permissions or access controls, which may be a precursor to further unauthorized actions. If confirmed malicious, an attacker could disrupt access management,
  potentially leading to privilege escalation or unauthorized access to sensitive resources. Analysts should review related IAM events, such as recent user additions or new group creations, to assess the
  broader context.
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/iam/delete-group.html
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeleteGroup.html
tags:
- attack.T1069_003
- attack.T1098
date: '2021-04-06'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: iam.amazonaws.com
  selection_1:
    eventName: DeleteGroup
  selection_2:
    errorCode: success
  selection_3:
    userAgent!|contains: '*.amazonaws.com'
  condition: selection_0 and selection_1 and selection_2 and selection_3
