title: AWS Defense Evasion Update Cloudtrail
id: 7c921d28-ef48-4f1b-85b3-0af8af7697db
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects `UpdateTrail` events in AWS CloudTrail logs. It identifies attempts to modify CloudTrail settings, potentially to evade logging. The detection leverages CloudTrail
  logs, focusing on `UpdateTrail` events where the user agent is not the AWS console and the operation is successful. This activity is significant because altering CloudTrail settings can disable or limit
  logging, hindering visibility into AWS account activities. If confirmed malicious, this could allow attackers to operate undetected, compromising the integrity and security of the AWS environment.
references:
- https://attack.mitre.org/techniques/T1562/008/
tags:
- attack.T1685_002
date: '2022-07-19'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: UpdateTrail
  selection_1:
    eventSource: cloudtrail.amazonaws.com
  selection_2:
    userAgent: console.amazonaws.com
  selection_3:
    errorCode: success
  condition: selection_0 and selection_1 and selection_2 and selection_3
