title: AWS Password Policy Changes
id: aee4a575-7064-4e60-b511-246f9baf9895
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects successful API calls to view, update, or delete the password policy in an AWS organization. It leverages AWS CloudTrail logs to identify events such as "UpdateAccountPasswordPolicy,"
  "GetAccountPasswordPolicy," and "DeleteAccountPasswordPolicy." This activity is significant because it is uncommon for regular users to perform these actions, and such changes can indicate an adversary
  attempting to understand or weaken password defenses. If confirmed malicious, this could lead to compromised accounts and increased attack surface, potentially allowing unauthorized access and control
  over AWS resources.
references:
- https://www.trendmicro.com/cloudoneconformity/knowledge-base/aws/IAM/password-policy.html
tags:
- attack.t1201
date: '2023-01-26'
original_spl: |-
  `cloudtrail` eventName IN ("UpdateAccountPasswordPolicy","GetAccountPasswordPolicy","DeleteAccountPasswordPolicy") errorCode=success
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_password_policy_changes_filter`
splunk_rule_id: aee4a575-7064-4e60-b511-246f9baf9895
splunk_rule_type: Hunting
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName:
    - UpdateAccountPasswordPolicy
    - GetAccountPasswordPolicy
    - DeleteAccountPasswordPolicy
  selection_1:
    errorCode: success
  condition: selection_0 and selection_1
