title: AWS IAM Failure Group Deletion
id: 723b861a-92eb-11eb-93b8-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies failed attempts to delete AWS IAM groups. It leverages AWS CloudTrail logs to detect events where the DeleteGroup action fails due to errors like NoSuchEntityException,
  DeleteConflictException, or AccessDenied. This activity is significant as it may indicate unauthorized attempts to modify IAM group configurations, which could be a precursor to privilege escalation or
  other malicious actions. If confirmed malicious, this could allow an attacker to disrupt IAM policies, potentially leading to unauthorized access or denial of service within the AWS environment.
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/iam/delete-group.html
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeleteGroup.html
tags:
- attack.t1098
date: '2021-04-06'
original_spl: |-
  `cloudtrail` eventSource=iam.amazonaws.com eventName=DeleteGroup errorCode IN (NoSuchEntityException,DeleteConflictException, AccessDenied) (userAgent!=*.amazonaws.com)
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_iam_failure_group_deletion_filter`
splunk_rule_id: 723b861a-92eb-11eb-93b8-acde48001122
splunk_rule_type: Anomaly
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: iam.amazonaws.com
  selection_1:
    eventName: DeleteGroup
  selection_2:
    errorCode:
    - NoSuchEntityException
    - DeleteConflictException
    - AccessDenied
  selection_3:
    userAgent|endswith: .amazonaws.com
  condition: selection_0 and selection_1 and selection_2 and selection_3
