title: AWS IAM Delete Policy
id: ec3a9362-92fe-11eb-99d0-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects the deletion of an IAM policy in AWS. It leverages AWS CloudTrail logs to identify `DeletePolicy` events, excluding those from AWS internal services. This activity
  is significant as unauthorized policy deletions can disrupt access controls and weaken security postures. If confirmed malicious, an attacker could remove critical security policies, potentially leading
  to privilege escalation, unauthorized access, or data exfiltration. Monitoring this behavior helps ensure that only authorized changes are made to IAM policies, maintaining the integrity and security
  of the AWS environment.
references:
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeletePolicy.html
- https://docs.aws.amazon.com/cli/latest/reference/iam/delete-policy.html
tags:
- attack.t1098
date: '2021-04-06'
original_spl: |-
  `cloudtrail` eventName=DeletePolicy (userAgent!=*.amazonaws.com)
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_iam_delete_policy_filter`
splunk_rule_id: ec3a9362-92fe-11eb-99d0-acde48001122
splunk_rule_type: Hunting
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: DeletePolicy
  selection_1:
    userAgent|endswith: .amazonaws.com
  condition: selection_0 and selection_1
