title: AWS AMI Attribute Modification for Exfiltration
id: f2132d74-cf81-4c5e-8799-ab069e67dc9f
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects suspicious modifications to AWS AMI attributes, such as sharing an AMI with another AWS account or making it publicly accessible. It leverages AWS CloudTrail
  logs to identify these changes by monitoring specific API calls. This activity is significant because adversaries can exploit these modifications to exfiltrate sensitive data stored in AWS resources.
  If confirmed malicious, this could lead to unauthorized access and potential data breaches, compromising the confidentiality and integrity of organizational information.
references:
- https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
- https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ami/
- https://hackingthe.cloud/aws/enumeration/loot_public_ebs_snapshots/
tags:
- attack.t1537
date: '2023-03-31'
original_spl: |-
  `cloudtrail` eventName=ModifyImageAttribute (requestParameters.launchPermission.add.items{}.userId = * OR requestParameters.launchPermission.add.items{}.group = all)
    | rename requestParameters.launchPermission.add.items{}.group as group_added
    | rename requestParameters.launchPermission.add.items{}.userId as accounts_added
    | eval ami_status=if(match(group_added,"all") ,"Public AMI", "Not Public")
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime values(group_added) as group_added values(accounts_added) as accounts_added values(ami_status) as ami_status
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_ami_attribute_modification_for_exfiltration_filter`
splunk_rule_id: f2132d74-cf81-4c5e-8799-ab069e67dc9f
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: ModifyImageAttribute
  selection_1:
    requestParameters.launchPermission.add.items{}.userId|contains: ''
  selection_2:
    requestParameters.launchPermission.add.items{}.group: all
  condition: selection_0 and selection_1 and selection_2
