title: AWS IAM Successful Group Deletion
id: e776d06c-9267-11eb-819b-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic identifies the successful deletion of an IAM group in AWS. It leverages CloudTrail logs to detect `DeleteGroup` events with a success status. This activity is significant
  as it could indicate potential changes in user permissions or access controls, which may be a precursor to further unauthorized actions. If confirmed malicious, an attacker could disrupt access management,
  potentially leading to privilege escalation or unauthorized access to sensitive resources. Analysts should review related IAM events, such as recent user additions or new group creations, to assess the
  broader context.
references:
- https://awscli.amazonaws.com/v2/documentation/api/latest/reference/iam/delete-group.html
- https://docs.aws.amazon.com/IAM/latest/APIReference/API_DeleteGroup.html
tags:
- attack.t1069.003
- attack.t1098
date: '2021-04-06'
original_spl: |-
  `cloudtrail` eventSource=iam.amazonaws.com eventName=DeleteGroup errorCode=success (userAgent!=*.amazonaws.com)
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_iam_successful_group_deletion_filter`
splunk_rule_id: e776d06c-9267-11eb-819b-acde48001122
splunk_rule_type: Hunting
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: iam.amazonaws.com
  selection_1:
    eventName: DeleteGroup
  selection_2:
    errorCode: success
  selection_3:
    userAgent|endswith: .amazonaws.com
  condition: selection_0 and selection_1 and selection_2 and selection_3
