title: AWS Bedrock Invoke Model Access Denied
id: c53a8e62-f741-11ee-9f6e-acde48001122
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies access denied error when attempting to invoke AWS Bedrock models. It leverages AWS CloudTrail logs to detect when a user or service receives an AccessDenied
  error when calling the InvokeModel API. This activity is significant as it may indicate an adversary attempting to access Bedrock models with insufficient permissions after compromising credentials. If
  confirmed malicious, this could suggest reconnaissance activities or privilege escalation attempts targeting generative AI resources, potentially leading to data exfiltration or manipulation of model
  outputs.
references:
- https://docs.aws.amazon.com/bedrock/latest/APIReference/API_ListFoundationModels.html
- https://trustoncloud.com/blog/exposing-the-weakness-how-we-identified-a-flaw-in-bedrocks-foundation-model-access-control/
- https://attack.mitre.org/techniques/T1595/
tags:
- attack.T1078
- attack.T1550
date: '2025-03-25'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: bedrock.amazonaws.com
  selection_1:
    eventName: InvokeModel
  selection_2:
    errorCode: AccessDenied
  condition: selection_0 and selection_1 and selection_2
