title: AWS ECR Container Upload Unknown User
id: 300688e4-365c-4486-a065-7c884462b31d
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the upload of a new container image to AWS Elastic Container Registry (ECR) by an unknown user. It leverages AWS CloudTrail logs to identify `PutImage` events
  from the ECR service, filtering out known users. This activity is significant because container uploads should typically be performed by a limited set of authorized users. If confirmed malicious, this
  could indicate unauthorized access, potentially leading to the deployment of malicious containers, data exfiltration, or further compromise of the AWS environment.
references:
- https://attack.mitre.org/techniques/T1204/003/
tags:
- attack.T1204_003
date: '2021-08-19'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: ecr.amazonaws.com
  selection_1:
    eventName: PutImage
  condition: selection_0 and selection_1
