title: AWS Defense Evasion Impair Security Services
id: b28c4957-96a6-47e0-a965-6c767aac1458
status: stable
level: medium
author: Bhavin Patel, Gowthamaraj Rajendran, Splunk, PashFW, Github Community
description: The following analytic detects attempts to impair or disable AWS security services by monitoring specific deletion operations across GuardDuty, AWS WAF (classic and v2), CloudWatch, Route 53,
  and CloudWatch Logs. These actions include deleting detectors, rule groups, IP sets, web ACLs, logging configurations, alarms, and log streams. Adversaries may perform such operations to evade detection
  or remove visibility from defenders. By explicitly pairing eventName values with their corresponding eventSource services, this detection reduces noise and ensures that only security-related deletions
  are flagged. It leverages CloudTrail logs to identify specific API calls like "DeleteLogStream" and "DeleteDetector." This activity is significant because it indicates potential efforts to disable security
  monitoring and evade detection. If confirmed malicious, this could allow attackers to operate undetected, escalate privileges, or exfiltrate data without triggering security alerts, severely compromising
  the security posture of the AWS environment.
references:
- https://docs.aws.amazon.com/cli/latest/reference/guardduty/index.html
- https://docs.aws.amazon.com/cli/latest/reference/waf/index.html
- https://www.elastic.co/guide/en/security/current/prebuilt-rules.html
tags:
- attack.T1685_002
date: '2022-07-26'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: DeleteDetector
    eventSource: guardduty.amazonaws.com
  selection_1:
    eventName:
    - DeleteIPSet
    - DeleteWebACL
    - DeleteRuleGroup
    - DeleteRule
    eventSource:
    - guardduty.amazonaws.com
    - wafv2.amazonaws.com
    - waf.amazonaws.com
  selection_2:
    eventName: DeleteLoggingConfiguration
    eventSource:
    - wafv2.amazonaws.com
    - waf.amazonaws.com
    - route53.amazonaws.com
  condition: selection_0 and selection_1 and selection_2
