title: AWS ECR Container Upload Unknown User
id: 300688e4-365c-4486-a065-7c884462b31d
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the upload of a new container image to AWS Elastic Container Registry (ECR) by an unknown user. It leverages AWS CloudTrail logs to identify `PutImage` events
  from the ECR service, filtering out known users. This activity is significant because container uploads should typically be performed by a limited set of authorized users. If confirmed malicious, this
  could indicate unauthorized access, potentially leading to the deployment of malicious containers, data exfiltration, or further compromise of the AWS environment.
references:
- https://attack.mitre.org/techniques/T1204/003/
tags:
- attack.t1204.003
date: '2021-08-19'
original_spl: |-
  `cloudtrail` eventSource=ecr.amazonaws.com eventName=PutImage NOT `aws_ecr_users`
    | rename requestParameters.* as *
    | rename repositoryName AS image
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature user user_agent
         src vendor_account vendor_region
         vendor_product image
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_ecr_container_upload_unknown_user_filter`
splunk_rule_id: 300688e4-365c-4486-a065-7c884462b31d
splunk_rule_type: Anomaly
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: ecr.amazonaws.com
  selection_1:
    eventName: PutImage
  condition: selection_0 and selection_1
