title: AWS Exfiltration via DataSync Task
id: 05c4b09f-ea28-4c7c-a7aa-a246f665c8a2
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects the creation of an AWS DataSync task, which could indicate potential data exfiltration. It leverages AWS CloudTrail logs to identify the `CreateTask` event from
  the DataSync service. This activity is significant because attackers can misuse DataSync to transfer sensitive data from a private AWS location to a public one, leading to data compromise. If confirmed
  malicious, this could result in unauthorized access to sensitive information, causing severe data breaches and compliance violations.
references:
- https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
- https://www.shehackske.com/how-to/data-exfiltration-on-cloud-1606/
tags:
- attack.T1119
date: '2023-04-10'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: CreateTask
  selection_1:
    eventSource: datasync.amazonaws.com
  condition: selection_0 and selection_1
