title: AWS Credential Access Failed Login
id: a19b354d-0d7f-47f3-8ea6-1a7c36434968
status: stable
level: medium
author: Gowthamaraj Rajendran, Bhavin Patel, Splunk
description: The following analytic identifies unsuccessful login attempts to the AWS Management Console using a specific user identity. It leverages AWS CloudTrail logs to detect failed authentication
  events associated with the AWS ConsoleLogin action. This activity is significant for a SOC because repeated failed login attempts may indicate a brute force attack or unauthorized access attempts. If
  confirmed malicious, an attacker could potentially gain access to AWS account services and resources, leading to data breaches, resource manipulation, or further exploitation within the AWS environment.
references:
- https://attack.mitre.org/techniques/T1110/001/
tags:
- attack.T1110_001
- attack.T1586_003
date: '2022-08-07'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: ConsoleLogin
  selection_1:
    errorMessage: Failed authentication
  condition: selection_0 and selection_1
