title: AWS Exfiltration via EC2 Snapshot
id: ac90b339-13fc-4f29-a18c-4abbba1f2171
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects a series of AWS API calls related to EC2 snapshots within a short time window, indicating potential exfiltration via EC2 Snapshot modifications. It leverages
  AWS CloudTrail logs to identify actions such as creating, describing, and modifying snapshot attributes. This activity is significant as it may indicate an attacker attempting to exfiltrate data by sharing
  EC2 snapshots externally. If confirmed malicious, the attacker could gain access to sensitive information stored in the snapshots, leading to data breaches and potential compliance violations.
references:
- https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
- https://docs.aws.amazon.com/AWSEC2/latest/APIReference/API_ModifySnapshotAttribute.html
- https://bleemb.medium.com/data-exfiltration-with-native-aws-s3-features-c94ae4d13436
- https://stratus-red-team.cloud/attack-techniques/list/
tags:
- attack.T1537
date: '2023-03-22'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName|contains:
    - CreateSnapshot
    - DescribeSnapshotAttribute
    - ModifySnapshotAttribute
    - DeleteSnapshot
  selection_1:
    SourceIp: guardduty.amazonaws.com
  condition: selection_0 and selection_1
