title: AWS Multi-Factor Authentication Disabled
id: 374832b1-3603-420c-b456-b373e24d34c0
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects attempts to disable multi-factor authentication (MFA) for an AWS IAM user. It leverages AWS CloudTrail logs to identify events where MFA devices are deleted or
  deactivated. This activity is significant because disabling MFA can indicate an adversary attempting to weaken account security, potentially to maintain persistence using a compromised account. If confirmed
  malicious, this action could allow attackers to retain access to the AWS environment without detection, posing a significant risk to the security and integrity of the cloud infrastructure.
references:
- https://attack.mitre.org/techniques/T1621/
- https://aws.amazon.com/what-is/mfa/
tags:
- attack.T1556_006
- attack.T1586_003
- attack.T1621
date: '2022-10-04'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: DeleteVirtualMFADevice
  selection_1:
    eventName: DeactivateMFADevice
  condition: selection_0 and selection_1
