title: AWS AMI Attribute Modification for Exfiltration
id: f2132d74-cf81-4c5e-8799-ab069e67dc9f
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects suspicious modifications to AWS AMI attributes, such as sharing an AMI with another AWS account or making it publicly accessible. It leverages AWS CloudTrail
  logs to identify these changes by monitoring specific API calls. This activity is significant because adversaries can exploit these modifications to exfiltrate sensitive data stored in AWS resources.
  If confirmed malicious, this could lead to unauthorized access and potential data breaches, compromising the confidentiality and integrity of organizational information.
references:
- https://labs.nettitude.com/blog/how-to-exfiltrate-aws-ec2-data/
- https://stratus-red-team.cloud/attack-techniques/AWS/aws.exfiltration.ec2-share-ami/
- https://hackingthe.cloud/aws/enumeration/loot_public_ebs_snapshots/
tags:
- attack.T1537
date: '2023-03-31'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: ModifyImageAttribute
  selection_1:
    launchPermission.add.items{}.userId|contains: '*'
  selection_2:
    launchPermission.add.items{}.group: all
  condition: selection_0 and selection_1 and selection_2
