title: AWS Disable Bucket Versioning
id: 657902a9-987d-4879-a1b2-e7a65512824b
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects when AWS S3 bucket versioning is suspended by a user. It leverages AWS CloudTrail logs to identify `PutBucketVersioning` events with the `VersioningConfiguration.Status`
  set to `Suspended`. This activity is significant because disabling versioning can prevent recovery of deleted or modified data, which is a common tactic in ransomware attacks. If confirmed malicious,
  this action could lead to data loss and hinder recovery efforts, severely impacting data integrity and availability.
references:
- https://invictus-ir.medium.com/ransomware-in-the-cloud-7f14805bbe82
- https://bleemb.medium.com/data-exfiltration-with-native-aws-s3-features-c94ae4d13436
tags:
- attack.T1490
date: '2023-05-01'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: PutBucketVersioning
  selection_1:
    VersioningConfiguration.Status": Suspended
  condition: selection_0 and selection_1
