title: AWS Bedrock High Number List Foundation Model Failures
id: e84b3c74-f742-11ee-9f6e-acde48001122
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies an high number of AccessDenied attempts to list AWS Bedrock foundation models. It leverages AWS CloudTrail logs to detect when a user or service experiences
  multiple failures when calling the ListFoundationModels API. This activity is significant as it may indicate an adversary performing reconnaissance of available AI models after compromising credentials
  with limited permissions. Repeated failures could suggest brute force attempts to enumerate accessible resources or misconfigured access controls. If confirmed malicious, this could represent early-stage
  reconnaissance before attempting to access or manipulate Bedrock models or knowledge bases.
references:
- https://docs.aws.amazon.com/bedrock/latest/APIReference/API_ListFoundationModels.html
- https://trustoncloud.com/blog/exposing-the-weakness-how-we-identified-a-flaw-in-bedrocks-foundation-model-access-control/
- https://attack.mitre.org/techniques/T1595/
tags:
- attack.t1580
date: '2025-03-25'
original_spl: '`cloudtrail` eventSource=bedrock.amazonaws.com eventName=ListFoundationModels errorCode=AccessDenied  | rename user_name as user | stats count min(_time) as firstTime max(_time) as lastTime
  values(errorCode) as errorCodes values(errorMessage) as errorMessages by src user user_agent vendor_account vendor_product dest signature vendor_region | where count > 9 | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)` | `aws_bedrock_high_number_list_foundation_model_failures_filter`'
splunk_rule_id: e84b3c74-f742-11ee-9f6e-acde48001122
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: bedrock.amazonaws.com
  selection_1:
    eventName: ListFoundationModels
  selection_2:
    errorCode: AccessDenied
  condition: selection_0 and selection_1 and selection_2
