title: AWS SetDefaultPolicyVersion
id: 2a9b80d3-6340-4345-11ad-212bf3d0dac4
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects when a user sets a default policy version in AWS. It leverages AWS CloudTrail logs to identify the `SetDefaultPolicyVersion` event from the IAM service. This
  activity is significant because attackers may exploit this technique for privilege escalation, especially if previous policy versions grant more extensive permissions than the current one. If confirmed
  malicious, this could allow an attacker to gain elevated access to AWS resources, potentially leading to unauthorized actions and data breaches.
references:
- https://bishopfox.com/blog/privilege-escalation-in-aws
- https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
tags:
- attack.T1078_004
date: '2021-03-02'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: SetDefaultPolicyVersion
  selection_1:
    eventSource: iam.amazonaws.com
  condition: selection_0 and selection_1
