title: AWS Detect Users with KMS keys performing encryption S3
id: 884a5f59-eec7-4f4a-948b-dbde18225fdc
status: stable
level: medium
author: Rod Soto, Patrick Bareiss Splunk
description: The following analytic identifies users with KMS keys performing encryption operations on S3 buckets. It leverages AWS CloudTrail logs to detect the `CopyObject` event where server-side encryption
  with AWS KMS is specified. This activity is significant as it may indicate unauthorized or suspicious encryption of data, potentially masking exfiltration or tampering efforts. If confirmed malicious,
  an attacker could be encrypting sensitive data to evade detection or preparing it for exfiltration, posing a significant risk to data integrity and confidentiality.
references:
- https://rhinosecuritylabs.com/aws/s3-ransomware-part-1-attack-vector/
- https://github.com/d1vious/git-wild-hunt
- https://www.youtube.com/watch?v=PgzNib37g0M
tags:
- attack.T1486
date: '2020-10-27'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: CopyObject
  selection_1:
    x-amz-server-side-encryption: aws:kms
  condition: selection_0 and selection_1
