title: AWS Defense Evasion Delete CloudWatch Log Group
id: d308b0f1-edb7-4a62-a614-af321160710f
status: stable
level: medium
author: Gowthamaraj Rajendran, Splunk
description: The following analytic detects the deletion of CloudWatch log groups in AWS, identified through `DeleteLogGroup` events in CloudTrail logs. This detection leverages CloudTrail data to monitor
  for successful log group deletions, excluding console-based actions. This activity is significant as it indicates potential attempts to evade logging and monitoring, which is crucial for maintaining visibility
  into AWS activities. If confirmed malicious, this could allow attackers to hide their tracks, making it difficult to detect further malicious actions or investigate incidents within the compromised AWS
  environment.
references:
- https://attack.mitre.org/techniques/T1562/008/
tags:
- attack.t1685.002
date: '2022-07-19'
original_spl: |-
  `cloudtrail` eventName = DeleteLogGroup eventSource = logs.amazonaws.com userAgent !=console.amazonaws.com errorCode = success
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_defense_evasion_delete_cloudwatch_log_group_filter`
splunk_rule_id: d308b0f1-edb7-4a62-a614-af321160710f
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: DeleteLogGroup
  selection_1:
    eventSource: logs.amazonaws.com
  selection_2:
    userAgent: console.amazonaws.com
  selection_3:
    errorCode: success
  condition: selection_0 and selection_1 and selection_2 and selection_3
