title: AWS Concurrent Sessions From Different Ips
id: 51c04fdb-2746-465a-b86e-b413a09c9085
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies an AWS IAM account with concurrent sessions originating from more than one unique IP address within a 5-minute window. It leverages AWS CloudTrail logs, specifically
  the `DescribeEventAggregates` event, to detect this behavior. This activity is significant as it may indicate a session hijacking attack, where an adversary uses stolen session cookies to access AWS resources
  from a different location. If confirmed malicious, this could allow unauthorized access to sensitive corporate resources, leading to potential data breaches or further exploitation within the AWS environment.
references:
- https://attack.mitre.org/techniques/T1185/
- https://breakdev.org/evilginx-2-next-generation-of-phishing-2fa-tokens/
- https://github.com/kgretzky/evilginx2
tags:
- attack.t1185
date: '2023-02-01'
original_spl: |-
  `cloudtrail` eventName = DescribeEventAggregates src_ip!="AWS Internal"
    | bin span=5m _time
    | rename user_name as user
    | stats min(_time) as firstTime max(_time) as lastTime values(user_agent) as user_agent values(signature) as signature values(src) as src values(dest) as dest dc(src) as distinct_ip_count
      BY _time user vendor_account
         vendor_region vendor_product
    | where distinct_ip_count > 1
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_concurrent_sessions_from_different_ips_filter`
splunk_rule_id: 51c04fdb-2746-465a-b86e-b413a09c9085
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: DescribeEventAggregates
  selection_1:
    src_ip: AWS Internal
  condition: selection_0 and selection_1
