title: AWS IAM Assume Role Policy Brute Force
id: f19e09b0-9308-11eb-b7ec-acde48001122
status: stable
level: medium
author: Michael Haag, Splunk
description: The following analytic detects multiple failed attempts to assume an AWS IAM role, indicating a potential brute force attack. It leverages AWS CloudTrail logs to identify `MalformedPolicyDocumentException`
  errors with a status of `failure` and filters out legitimate AWS services. This activity is significant as repeated failures to assume roles can indicate an adversary attempting to guess role names, which
  is a precursor to unauthorized access. If confirmed malicious, this could lead to unauthorized access to AWS resources, potentially compromising sensitive data and services.
references:
- https://www.praetorian.com/blog/aws-iam-assume-role-vulnerabilities/
- https://rhinosecuritylabs.com/aws/assume-worst-aws-assume-role-enumeration/
- https://www.elastic.co/guide/en/security/current/aws-iam-brute-force-of-assume-role-policy.html
tags:
- attack.T1580
- attack.T1110
date: '2021-04-06'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    errorCode: MalformedPolicyDocumentException
  selection_1:
    sc-status: failure
  selection_2:
    userAgent!|contains: '*.amazonaws.com'
  condition: selection_0 and selection_1 and selection_2
