title: AWS ECR Container Scanning Findings Medium
id: 0b80e2c8-c746-4ddb-89eb-9efd892220cf
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic identifies medium-severity findings from AWS Elastic Container Registry (ECR) image scans. It leverages AWS CloudTrail logs, specifically the DescribeImageScanFindings
  event, to detect vulnerabilities in container images. This activity is significant for a SOC as it highlights potential security risks in containerized applications, which could be exploited if not addressed.
  If confirmed malicious, these vulnerabilities could lead to unauthorized access, data breaches, or further exploitation within the container environment, compromising the overall security posture.
references:
- https://docs.aws.amazon.com/AmazonECR/latest/userguide/image-scanning.html
tags:
- attack.T1204_003
date: '2021-08-18'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: ecr.amazonaws.com
  selection_1:
    eventName: DescribeImageScanFindings
  condition: selection_0 and selection_1
