title: AWS SetDefaultPolicyVersion
id: 2a9b80d3-6340-4345-11ad-212bf3d0dac4
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects when a user sets a default policy version in AWS. It leverages AWS CloudTrail logs to identify the `SetDefaultPolicyVersion` event from the IAM service. This
  activity is significant because attackers may exploit this technique for privilege escalation, especially if previous policy versions grant more extensive permissions than the current one. If confirmed
  malicious, this could allow an attacker to gain elevated access to AWS resources, potentially leading to unauthorized actions and data breaches.
references:
- https://bishopfox.com/blog/privilege-escalation-in-aws
- https://rhinosecuritylabs.com/aws/aws-privilege-escalation-methods-mitigation-part-2/
tags:
- attack.t1078.004
date: '2021-03-02'
original_spl: |-
  `cloudtrail` eventName=SetDefaultPolicyVersion eventSource = iam.amazonaws.com
    | rename user_name as user
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_setdefaultpolicyversion_filter`
splunk_rule_id: 2a9b80d3-6340-4345-11ad-212bf3d0dac4
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: SetDefaultPolicyVersion
  selection_1:
    eventSource: iam.amazonaws.com
  condition: selection_0 and selection_1
