title: AWS Credential Access GetPasswordData
id: 4d347c4a-306e-41db-8d10-b46baf71b3e2
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic identifies more than 10 GetPasswordData API calls within a 5-minute window in your AWS account. It leverages AWS CloudTrail logs to detect this activity by counting the
  distinct instance IDs accessed. This behavior is significant as it may indicate an attempt to retrieve encrypted administrator passwords for running Windows instances, which is a critical security concern.
  If confirmed malicious, attackers could gain unauthorized access to administrative credentials, potentially leading to full control over the affected instances and further compromise of the AWS environment.
references:
- https://attack.mitre.org/techniques/T1552/
- https://stratus-red-team.cloud/attack-techniques/AWS/aws.credential-access.ec2-get-password-data/
tags:
- attack.T1110_001
- attack.T1586_003
date: '2022-08-10'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: GetPasswordData
  selection_1:
    eventSource: ec2.amazonaws.com
  condition: selection_0 and selection_1
