title: AWS Exfiltration via Bucket Replication
id: eeb432d6-2212-43b6-9e89-fcd753f7da4c
status: stable
level: medium
author: Bhavin Patel, Splunk
description: The following analytic detects API calls to enable S3 bucket replication services. It leverages AWS CloudTrail logs to identify `PutBucketReplication` events, focusing on fields like `bucketName`,
  `ReplicationConfiguration.Rule.Destination.Bucket`, and user details. This activity is significant as it can indicate unauthorized data replication, potentially leading to data exfiltration. If confirmed
  malicious, attackers could replicate sensitive data to external accounts, leading to data breaches and compliance violations.
references:
- https://hackingthe.cloud/aws/exploitation/s3-bucket-replication-exfiltration/
tags:
- attack.t1537
date: '2023-04-28'
original_spl: |-
  `cloudtrail`  eventName = PutBucketReplication eventSource = s3.amazonaws.com
    | rename user_name as user, requestParameters.ReplicationConfiguration.Rule.Destination.Bucket as bucket_name
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY signature dest user
         user_agent src vendor_account
         vendor_region vendor_product bucket_name
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `aws_exfiltration_via_bucket_replication_filter`
splunk_rule_id: eeb432d6-2212-43b6-9e89-fcd753f7da4c
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventName: PutBucketReplication
  selection_1:
    eventSource: s3.amazonaws.com
  condition: selection_0 and selection_1
