title: Detect New Open S3 Buckets over AWS CLI
id: 39c61d09-8b30-4154-922b-2d0a694ecc22
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation of open/public S3 buckets via the AWS CLI. It leverages AWS CloudTrail logs to identify events where a user has set bucket permissions to allow access
  to "AuthenticatedUsers" or "AllUsers." This activity is significant because open S3 buckets can expose sensitive data to unauthorized users, leading to data breaches. If confirmed malicious, an attacker
  could gain unauthorized access to potentially sensitive information stored in the S3 bucket, posing a significant security risk.
tags:
- attack.t1530
date: '2021-01-12'
original_spl: |-
  `cloudtrail` eventSource="s3.amazonaws.com" (userAgent="[aws-cli*" OR userAgent=aws-cli* ) eventName=PutBucketAcl OR requestParameters.accessControlList.x-amz-grant-read-acp IN ("*AuthenticatedUsers","*AllUsers") OR requestParameters.accessControlList.x-amz-grant-write IN ("*AuthenticatedUsers","*AllUsers") OR requestParameters.accessControlList.x-amz-grant-write-acp IN ("*AuthenticatedUsers","*AllUsers") OR requestParameters.accessControlList.x-amz-grant-full-control IN ("*AuthenticatedUsers","*AllUsers")
    | rename requestParameters.bucketName AS bucketName
    | fillnull
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY userIdentity.userName userIdentity.principalId userAgent
         bucketName requestParameters.accessControlList.x-amz-grant-read requestParameters.accessControlList.x-amz-grant-read-acp
         requestParameters.accessControlList.x-amz-grant-write requestParameters.accessControlList.x-amz-grant-write-acp requestParameters.accessControlList.x-amz-grant-full-control
    | rename userIdentity.userName as user
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `detect_new_open_s3_buckets_over_aws_cli_filter`
splunk_rule_id: 39c61d09-8b30-4154-922b-2d0a694ecc22
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: s3.amazonaws.com
    eventName: PutBucketAcl
  selection_1:
    requestParameters.accessControlList.x-amz-grant-read-acp|endswith:
    - AuthenticatedUsers
    - AllUsers
  selection_2:
    requestParameters.accessControlList.x-amz-grant-write|endswith:
    - AuthenticatedUsers
    - AllUsers
  selection_3:
    requestParameters.accessControlList.x-amz-grant-write-acp|endswith:
    - AuthenticatedUsers
    - AllUsers
  selection_4:
    requestParameters.accessControlList.x-amz-grant-full-control|endswith:
    - AuthenticatedUsers
    - AllUsers
  condition: selection_0 and selection_1 and selection_2 and selection_3 and selection_4
