title: Detect New Open S3 buckets
id: 2a9b80d3-6340-4345-b5ad-290bf3d0dac4
status: stable
level: medium
author: Bhavin Patel, Patrick Bareiss, Splunk
description: The following analytic identifies the creation of open/public S3 buckets in AWS. It detects this activity by analyzing AWS CloudTrail events for `PutBucketAcl` actions where the access control
  list (ACL) grants permissions to all users or authenticated users. This activity is significant because open S3 buckets can expose sensitive data to unauthorized access, leading to data breaches. If confirmed
  malicious, an attacker could read, write, or fully control the contents of the bucket, potentially leading to data exfiltration or tampering.
tags:
- attack.t1530
date: '2020-04-29'
original_spl: |-
  `cloudtrail` eventSource=s3.amazonaws.com eventName=PutBucketAcl
    | rex field=_raw "(?<json_field>{.+})"
    | spath input=json_field output=grantees path=requestParameters.AccessControlPolicy.AccessControlList.Grant{}
    | search grantees=*
    | mvexpand grantees
    | spath input=grantees output=uri path=Grantee.URI
    | spath input=grantees output=permission path=Permission
    | search uri IN ("http://acs.amazonaws.com/groups/global/AllUsers","http://acs.amazonaws.com/groups/global/AuthenticatedUsers")
    | search permission IN ("READ","READ_ACP","WRITE","WRITE_ACP","FULL_CONTROL")
    | rename requestParameters.bucketName AS bucketName
    | stats count min(_time) as firstTime max(_time) as lastTime
      BY user_arn userIdentity.principalId userAgent
         uri permission bucketName
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `detect_new_open_s3_buckets_filter`
splunk_rule_id: 2a9b80d3-6340-4345-b5ad-290bf3d0dac4
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    eventSource: s3.amazonaws.com
  selection_1:
    eventName: PutBucketAcl
  condition: selection_0 and selection_1
