title: Kubernetes Unauthorized Access
id: 9b5f1832-e8b9-453f-93df-07a3d6a72a45
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects unauthorized access attempts to Kubernetes by analyzing Kubernetes audit logs. It identifies anomalies in access patterns by examining the source of requests
  and their response statuses. This activity is significant for a SOC as it may indicate an attacker attempting to infiltrate the Kubernetes environment. If confirmed malicious, such access could lead to
  unauthorized control over Kubernetes resources, potentially compromising sensitive systems or data within the cluster.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.T1204
date: '2023-12-20'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    verb: create
  selection_1:
    reason: Forbidden
  condition: selection_0 and selection_1
