title: Kubernetes Abuse of Secret by Unusual User Group
id: b6f45bbc-4ea9-4068-b3bc-0477f6997ae2
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects unauthorized access or misuse of Kubernetes Secrets by unusual user groups. It leverages Kubernetes Audit logs to identify anomalies in access patterns by analyzing
  the source of requests and user groups. This activity is significant for a SOC as Kubernetes Secrets store sensitive information like passwords, OAuth tokens, and SSH keys. If confirmed malicious, this
  behavior could indicate an attacker attempting to exfiltrate or misuse these secrets, potentially leading to unauthorized access to sensitive systems or data.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.T1552_007
date: '2023-12-20'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    resource: secrets
  selection_1:
    verb: get
  condition: selection_0 and selection_1
