title: Kubernetes Pod With Host Network Attachment
id: cce357cf-43a4-494a-814b-67cea90fe990
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation or update of a Kubernetes pod with host network attachment. It leverages Kubernetes Audit logs to identify pods configured with host network settings.
  This activity is significant for a SOC as it could allow an attacker to monitor all network traffic on the node, potentially capturing sensitive information and escalating privileges. If confirmed malicious,
  this could lead to unauthorized access, data breaches, and service disruptions, severely impacting the security and integrity of the Kubernetes environment.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.T1204
date: '2024-01-30'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    resource: pods
    verb: create
  selection_1:
    verb: update
    metadata.annotations.kubectl.kubernetes.io/last-applied-configuration|contains: '*\'
  condition: selection_0 and selection_1
