title: Kubernetes Scanner Image Pulling
id: 4890cd6b-0112-4974-a272-c5c153aee551
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the pulling of known Kubernetes security scanner images such as kube-hunter, kube-bench, and kube-recon. It leverages Kubernetes logs ingested through Splunk
  Connect for Kubernetes, specifically monitoring for messages indicating the pulling of these images. This activity is significant because the use of security scanners can indicate an attempt to identify
  vulnerabilities within the Kubernetes environment. If confirmed malicious, this could lead to the discovery and exploitation of security weaknesses, potentially compromising the entire Kubernetes cluster.
references:
- https://github.com/splunk/splunk-connect-for-kubernetes
tags:
- attack.t1526
date: '2021-08-24'
original_spl: |-
  `kube_objects_events` object.message IN ("Pulling image *kube-hunter*", "Pulling image *kube-bench*", "Pulling image *kube-recon*", "Pulling image *kube-recon*")
    | rename object.* AS *
    | rename involvedObject.* AS *
    | rename source.host AS host
    | eval phase="operate"
    | eval severity="high"
    | stats min(_time) as firstTime max(_time) as lastTime count
      BY host, name, namespace,
         kind, reason, message,
         phase, severity
    | `security_content_ctime(firstTime)`
    | `security_content_ctime(lastTime)`
    | `kubernetes_scanner_image_pulling_filter`
splunk_rule_id: 4890cd6b-0112-4974-a272-c5c153aee551
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    object.message|startswith:
    - Pulling image *kube-hunter
    - Pulling image *kube-bench
    - Pulling image *kube-recon
    - Pulling image *kube-recon
  condition: selection_0
