title: Kubernetes Node Port Creation
id: d7fc865e-b8a1-4029-a960-cf4403b821b6
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation of a Kubernetes NodePort service, which exposes a service to the external network. It identifies this activity by monitoring Kubernetes Audit logs
  for the creation of NodePort services. This behavior is significant for a SOC as it could allow an attacker to access internal services, posing a threat to the Kubernetes infrastructure's integrity and
  security. If confirmed malicious, this activity could lead to data breaches, service disruptions, or unauthorized access to sensitive information.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.T1204
date: '2023-12-20'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    resource": services
  selection_1:
    verb: create
  selection_2:
    spec.type: NodePort
  condition: selection_0 and selection_1 and selection_2
