title: Kubernetes AWS detect suspicious kubectl calls
id: 042a3d32-8318-4763-9679-09db2644a8f2
status: experimental
level: medium
author: Rod Soto, Patrick Bareiss, Splunk
description: The following analytic detects anonymous and unauthenticated requests to a Kubernetes cluster. It identifies this behavior by monitoring API calls from users who have not provided any token
  or password in their request, using data from `kube_audit` logs. This activity is significant for a SOC as it indicates a severe misconfiguration, allowing unfettered access to the cluster with no traceability.
  If confirmed malicious, an attacker could gain access to sensitive data or control over the cluster, posing a substantial security risk.
date: '2020-06-23'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    username: system:anonymous
  selection_1:
    groups{}|contains: system:unauthenticated
  condition: selection_0 and selection_1
