title: Kubernetes Cron Job Creation
id: 5984dbe8-572f-47d7-9251-3dff6c3f0c0d
status: stable
level: medium
author: Patrick Bareiss, Splunk
description: The following analytic detects the creation of a Kubernetes cron job, which is a task scheduled to run automatically at specified intervals. It identifies this activity by monitoring Kubernetes
  Audit logs for the creation events of cron jobs. This behavior is significant for a SOC as it could allow an attacker to execute malicious tasks repeatedly and automatically, posing a threat to the Kubernetes
  infrastructure. If confirmed malicious, this activity could lead to persistent attacks, service disruptions, or unauthorized access to sensitive information.
references:
- https://kubernetes.io/docs/tasks/debug/debug-cluster/audit/
tags:
- attack.T1053_007
date: '2024-01-30'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    verb: create
  selection_1:
    resource": cronjobs
  condition: selection_0 and selection_1
