title: O365 Email Password and Payroll Compromise Behavior
id: e36de71a-6bdc-4002-98ff-e3e51b0d8f96
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when an O365 email recipient receives and then deletes emails for the combination of both password and banking/payroll changes within a short period. This
  behavior may indicate a compromised account where the threat actor is attempting to redirect the victims payroll to an attacker controlled bank account.
references:
- https://attack.mitre.org/techniques/T1114/
- https://www.hhs.gov/sites/default/files/help-desk-social-engineering-sector-alert-tlpclear.pdf
- https://intelligence.abnormalsecurity.com/attack-library/threat-actor-convincingly-impersonates-employee-requesting-direct-deposit-update-in-likely-ai-generated-attack
tags:
- attack.t1070.008
- attack.t1485
- attack.t1114.001
date: '2025-01-23'
original_spl: |-
  `o365_messagetrace` subject IN ("*banking*","*direct deposit*","*pay-to*","*password *","*passcode *","*OTP *","*MFA *","*Account Recovery*")
  | eval mailtime = _time
  | bin _time span=4hr
  | eval user = lower(RecipientAddress)
  | eval InternetMessageId = lower(MessageId)
  | join InternetMessageId, user max=0
    [
    | search `o365_management_activity` Workload=Exchange Operation IN ("SoftDelete","HardDelete")
    | spath path=AffectedItems{}  output=AffectedItemSplit
    | fields _time,ClientIP,ClientInfoString,UserId,Operation,ResultStatus,MailboxOwnerUPN,AffectedItemSplit
    | mvexpand AffectedItemSplit | spath input=AffectedItemSplit
    | search Subject IN ("*banking*","*direct deposit*","*pay-to*","*password *","*passcode *","*OTP *","*MFA *","*Account Recovery*")
    | eval deltime = _time
    | bin _time span=4hr
    | eval InternetMessageId = lower(InternetMessageId), user = lower(UserId)
    ]
  | stats values(ClientInfoString) as http_user_agent, values(ClientIP) as src, values(Subject) as subject, dc(Subject) as subject_count, values(Operation) as action, values(ResultStatus) as result, count, min(mailtime) as firstTime, max(deltime) as lastTime by user,_time
  | search subject IN ("*banking*","*direct deposit*","*pay-to*") AND subject IN ("*password *","*passcode *","*OTP *","*MFA *","*Account Recovery*")
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_email_password_and_payroll_compromise_behavior_filter`
splunk_rule_id: e36de71a-6bdc-4002-98ff-e3e51b0d8f96
splunk_rule_type: TTP
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    subject|contains:
    - banking
    - direct deposit
    - pay-to
    - 'password '
    - 'passcode '
    - 'OTP '
    - 'MFA '
    - Account Recovery
  condition: selection_0
