title: O365 Email Receive and Hard Delete Takeover Behavior
id: b66aeaa4-586f-428b-8a2b-c4fd3039d8d3
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when an O365 email recipient receives and then deletes emails related to password or banking/payroll changes within a short period. This behavior may indicate
  a compromised account where the threat actor is attempting to redirect the victims payroll to an attacker controlled bank account.
references:
- https://attack.mitre.org/techniques/T1114/
- https://www.hhs.gov/sites/default/files/help-desk-social-engineering-sector-alert-tlpclear.pdf
- https://intelligence.abnormalsecurity.com/attack-library/threat-actor-convincingly-impersonates-employee-requesting-direct-deposit-update-in-likely-ai-generated-attack
tags:
- attack.T1070_008
- attack.T1485
- attack.T1114_001
date: '2025-01-23'
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    subject|contains:
    - '*banking*'
    - '*direct deposit*'
    - '*pay-to*'
    - '*password *'
    - '*passcode *'
    - '*OTP *'
    - '*MFA *'
    - '*Account Recovery*'
  condition: selection_0
