title: O365 Email Receive and Hard Delete Takeover Behavior
id: b66aeaa4-586f-428b-8a2b-c4fd3039d8d3
status: stable
level: medium
author: Steven Dick
description: The following analytic identifies when an O365 email recipient receives and then deletes emails related to password or banking/payroll changes within a short period. This behavior may indicate
  a compromised account where the threat actor is attempting to redirect the victims payroll to an attacker controlled bank account.
references:
- https://attack.mitre.org/techniques/T1114/
- https://www.hhs.gov/sites/default/files/help-desk-social-engineering-sector-alert-tlpclear.pdf
- https://intelligence.abnormalsecurity.com/attack-library/threat-actor-convincingly-impersonates-employee-requesting-direct-deposit-update-in-likely-ai-generated-attack
tags:
- attack.t1070.008
- attack.t1485
- attack.t1114.001
date: '2025-01-23'
original_spl: |-
  `o365_messagetrace` subject IN ("*banking*","*direct deposit*","*pay-to*","*password *","*passcode *","*OTP *","*MFA *","*Account Recovery*")
  | eval mailtime = _time
  | bin _time span=4hr
  | eval user = lower(RecipientAddress)
  | eval InternetMessageId = lower(MessageId)
  | join InternetMessageId, user max=0
    [
    | search `o365_management_activity` Workload=Exchange Operation IN ("HardDelete") AND Folder.Path IN ("\\Sent Items","\\Recoverable Items\\Deletions")
    | spath path=AffectedItems{}  output=AffectedItemSplit
    | fields _time,ClientProcessName,ClientIPAddress,ClientInfoString,UserId,Operation,ResultStatus,MailboxOwnerUPN,AffectedItemSplit,Folder.Path
    | mvexpand AffectedItemSplit | spath input=AffectedItemSplit
    | search Subject IN ("*banking*","*direct deposit*","*pay-to*","*password *","*passcode *","*OTP *","*MFA *","*Account Recovery*")
    | eval deltime = _time
    | bin _time span=4hr
    | eval InternetMessageId = lower(InternetMessageId), user = lower(UserId), subject = Subject
    ]
  | stats values(ClientIPAddress) as src, values(ClientInfoString) as http_user_agent, values(Folder.Path) as file_path, values(Operation) as signature, values(ResultStatus) as result, values(InternetMessageId) as signature_id, count, min(mailtime) as firstTime, max(deltime) as lastTime by user,subject
  | `security_content_ctime(firstTime)`
  | `security_content_ctime(lastTime)`
  | `o365_email_receive_and_hard_delete_takeover_behavior_filter`
splunk_rule_id: b66aeaa4-586f-428b-8a2b-c4fd3039d8d3
splunk_rule_type: Anomaly
logsource:
  product: aws
  service: cloudtrail
detection:
  selection_0:
    subject|contains:
    - banking
    - direct deposit
    - pay-to
    - 'password '
    - 'passcode '
    - 'OTP '
    - 'MFA '
    - Account Recovery
  condition: selection_0
